{"Kendrick-lamar-swimming-pools-drank": "\" Pour up (Drank), head shot (Drank) Sit down (Drank), stand up (Drank) Pass out (Drank), wake up (Drank) Faded (Drank), faded (Drank) Now I done grew up 'round some people livin' their life in bottles Granddaddy had the golden flask Backstroke every day in Chicago Some people like the way it feels Some people wanna kill their sorrows Some people wanna fit in with the popular, that was my problem I was in a dark room, loud tunes Lookin' to make a vow soon That I'ma get fucked up, fillin' up my cup I see the crowd mood Changin' by the minute and the record on repeat Took a sip, then another sip, then somebody said to me Nigga, why you babysittin' only two or three shots? I'ma show you how to turn it up a notch First you get a swimming pool full of liquor, then you dive in it Pool full of liquor, then you dive in it I wave a few bottles, then I watch 'em all flock All the girls wanna play Baywatch I got a swimming pool full of liquor and they dive in it Pool full of liquor, I'ma dive in it Pour up (Drank), head shot (Drank) Sit down (Drank), stand up (Drank) Pass out (Drank), wake up (Drank) Faded (Drank), faded (Drank) Okay, now open your mind up and listen me, Kendrick I am your conscience, if you do not hear me Then you will be history, Kendrick I know that you're nauseous right now And I'm hopin' to lead you to victory, Kendrick If I take another one down I'ma drown in some poison, abusin' my limit I think that I'm feelin' the vibe, I see the love in her eyes I see the feelin', the freedom is granted As soon as the damage of vodka arrived This how you capitalize, this is parental advice Then apparently, I'm over-influenced by what you are doin' I thought I was doin' the most 'til someone said to me Nigga, why you babysittin' only two or three shots? I'ma show you how to turn it up a notch First you get a swimming pool full of liquor, then you dive in it Pool full of liquor, then you dive in it I wave a few bottles, then I watch 'em all flock All the girls wanna play Baywatch I got a swimming pool full of liquor and they dive in it Pool full of liquor, I'ma dive in it Pour up (Drank), head shot (Drank) Sit down (Drank), stand up (Drank) Pass out (Drank), wake up (Drank) Faded (Drank), faded (Drank) I ride, you ride, bang One chopper, 100 shots, bang Hop out, do you bang? Two chopper, 200 shots, bang I ride, you ride, bang One chopper, 100 shots, bang Hop out, do you bang? Two chopper, 200 shots, bang Nigga, why you babysittin' only two or three shots? I'ma show you how to turn it up a notch First you get a swimming pool full of liquor, then you dive in it Pool full of liquor, then you dive in it I wave a few bottles, then I watch 'em all flock All the girls wanna play Baywatch I got a swimming pool full of liquor and they dive in it Pool full of liquor, I'ma dive in it Pour up (Drank), head shot (Drank) Sit down (Drank), stand up (Drank) Pass out (Drank), wake up (Drank) Faded (Drank), faded (Drank) Aw man\\u2026 where is she takin' me? Where is she takin' me? All I have in life is my new appetite for failure And I got hunger pain that grow insane Tell me, do that sound familiar? If it do, then you're like me Makin' excuse that your relief Is in the bottom of the bottle and the greenest indo leaf As the window open I release Everything that corrode inside of me I see you jokin', why you laugh? Don't you feel bad? I probably sleep And never ever wake up, never ever wake up, never ever wake up In God I trust, but just when I thought I had enough They stomped the homie out over a bitch? K-dot, you good, blood? Now we can drop, ye we can drop you back off That nigga's straight, man, that nigga ain't trippin' We gon' do the same ol' shit I'ma pop a few shots, they gon' run, they gon' run opposite ways Fall right in ****'s lap And he gon' tear they ass up, simple as that And I hope that bitch that set him up out there We gon' pop that bitch too Wait hold up, ayy, I see somebody   Aha! Got them niggas, K-Dot, you good? L****, you good? Yeah, blood, I'm good \\u2013 Dave, you good? Dave? Dave, say somethin' \\u2013 Dave? These bitch-ass niggas killed my brother!  \"}", "Kendrick-lamar-money-trees": "\" Uh, me and my niggas tryna get it, ya bish (ya bish) Hit the house lick: tell me, is you wit' it, ya bish? (ya bish) Home invasion was persuasive (was persuasive) From nine to five I know it's vacant, ya bish (ya bish) Dreams of livin' life like rappers do (like rappers do) Back when condom wrappers wasn't cool (they wasn't cool) I fucked Sherane and went to tell my bros (tell my bros) Then Usher Raymond \\\"Let It Burn\\\" came on (\\\"Let Burn\\\" came on) Hot sauce all in our Top Ramen, ya bish (ya bish) Park the car, then we start rhymin', ya bish (ya bish) The only thing we had to free our mind (free our mind) Then freeze that verse when we see dollar signs (see dollar signs) You lookin' like a easy come-up, ya bish (ya bish) A silver spoon I know you come from, ya bish (ya bish) And that's a lifestyle that we never knew (we never knew) Go at a reverend for the revenue It go Halle Berry or hallelujah Pick your poison, tell me what you doin' Everybody gon' respect the shooter But the one in front of the gun lives forever (The one in front of the gun, forever) And I been hustlin' all day This-a-way, that-a-way Through canals and alleyways, just to say Money trees is the perfect place for shade And that's just how I feel, nah, nah A dollar might just fuck your main bitch That's just how I feel, nah A dollar might say fuck them niggas that you came with That's just how I feel, nah, nah A dollar might just make that lane switch That's just how I feel, nah A dollar might turn to a million and we all rich That's just how I feel Dreams of livin' life like rappers do (like rappers do) Bump that new E-40 after school (way after school) You know, \\u201cBig Ballin' With My Homies\\u201d (my homies) Earl Stevens had us thinkin' rational (thinkin' rational) Back to reality, we poor, ya bish (ya bish) Another casualty at war, ya bish (ya bish) Two bullets in my Uncle Tony head (my Tony head) He said one day I'll be on tour, ya bish (ya bish) That Louis Burgers never be the same (won't be the same) A Louis belt will never ease that pain (won't ease that pain) But I'ma purchase when that day is jerkin' (that day is jerkin') Pull off at Church's, with Pirellis skirtin' (Pirellis skirtin') Gang signs out the window, ya bish (ya bish) Hopin' all of 'em offend you, ya bish (ya bish) They say your hood is a pot of gold (a pot of gold) And we gon' crash it when nobody's home It go Halle Berry or hallelujah Pick your poison, tell me what you doin' Everybody gon' respect the shooter But the one in front of the gun lives forever (The one in front of the gun, forever) And I been hustlin' all day This-a-way, that-a-way Through canals and alleyways, just to say Money trees is the perfect place for shade And that's just how I feel, nah, nah A dollar might just fuck your main bitch That's just how I feel, nah A dollar might say fuck them niggas that you came with That's just how I feel, nah, nah A dollar might just make that lane switch That's just how I feel, nah A dollar might turn to a million and we all rich That's just how I feel Be the last one out to get this dough? No way! Love one of you bucket-headed hoes? No way! Hit the streets, then we break the code? No way! Hit the brakes when they on patrol? No way! Be the last one out to get this dough? No way! Love one of you bucket-headed hoes? No way! Hit the streets, then we break the code? No way! Hit the brakes when they on patrol? No way! Imagine Rock up in them projects Where them niggas pick your pockets Santa Claus don't miss them stockings Liquors spillin', pistols poppin' Bakin' soda YOLA whippin' Ain't no turkey on Thanksgivin' My homeboy just dome'd a nigga I just hope the Lord forgive him Pots with cocaine residue Every day I'm hustlin' What else is a thug to do When you eatin' cheese from the government? Gotta provide for my daughter n'em Get the fuck up out my way, bish Got that drum and I got them bands Just like a parade, bish Drop that work up in the bushes Hope them boys don't see my stash If they do, tell the truth This the last time you might see my ass From the gardens where the grass ain't cut Them serpents lurkin', Blood Bitches sellin' pussy, niggas sellin' drugs But it's all good Broken promises, steal your watch And tell you what time it is Take your J's and tell you to kick it where a FootLocker is In the streets with a heater under my Dungarees Dreams of me gettin' shaded under a money tree It go Halle Berry or hallelujah Pick your poison, tell me what you doin' Everybody gon' respect the shooter But the one in front of the gun lives forever (The one in front of the gun, forever) And I been hustlin' all day This-a-way, that-a-way Through canals and alleyways, just to say Money trees is the perfect place for shade And that's just how I feel K\\u2019s Mom: Kendrick, just bring my car back, man. I called in for another appointment. I figured you weren\\u2019t gonna be back here on time anyways. Look, shit, shit, I just wanna get out the house, man. This man is on one, he feelin' good as a motherfucker. Shit, I\\u2019m tryna get my thing goin', too. Just bring my car back. Shit, he faded. He feelin' good. Look, listen to him! K\\u2019s Dad: Girl, girl, I want your body, I want your body, 'cause of that big ol\\u2019 fat ass. Girl, girl, I want your body, I want your body, 'cause of that big ol\\u2019 fat ass K\\u2019s Mom: See, he high as hell. Shit, and he ain\\u2019t even trippin' off them damn dominoes anymore. Just bring the car back! K\\u2019s Dad: Did somebody say dominoes?  \"}", "Kendrick-lamar-xxx": "\" America, God bless you if it's good to you America, please take my hand Can you help me underst\\u2014 New Kung Fu Kenny! Throw a steak off the ark to a pool full of sharks, he'll take it Leave him in the wilderness with a sworn nemesis, he'll make it Take the gratitude from him, I bet he'll show you somethin', whoa I'll chip a nigga lil' bit of nothin', I'll chip a nigga lil' bit of nothin' I'll chip a nigga lil' bit of nothin', I'll chip a nigga, then throw the blower in his lap Walk myself to the court like, \\\"Bitch, I did that!,\\\" X-rated Johnny don't wanna go to school no mo', no mo' Johnny said books ain't cool no mo' (No mo') Johnny wanna be a rapper like his big cousin Johnny caught a body yesterday out hustlin' God bless America, you know we all love him Yesterday I got a call like from my dog like 101 Said they killed his only son because of insufficient funds He was sobbin', he was mobbin', way belligerent and drunk Talkin' out his head, philosophin' on what the Lord had done He said: \\\"K-Dot, can you pray for me? It been a fucked up day for me I know that you anointed, show me how to overcome.\\\" He was lookin' for some closure Hopin' I could bring him closer To the spiritual, my spirit do know better, but I told him \\\"I can't sugarcoat the answer for you, this is how I feel: If somebody kill my son, that mean somebody gettin' killed.\\\" Tell me what you do for love, loyalty, and passion of All the memories collected, moments you could never touch I'll wait in front a nigga's spot and watch him hit his block I'll catch a nigga leavin' service if that's all I got I'll chip a nigga, then throw the blower in his lap Walk myself to the court like, \\\"Bitch, I did that!\\\" Ain't no Black Power when your baby killed by a coward I can't even keep the peace, don't you fuck with one of ours It be murder in the street, it be bodies in the hour Ghetto bird be on the street, paramedics on the dial Let somebody touch my momma Touch my sister, touch my woman Touch my daddy, touch my niece Touch my nephew, touch my brother You should chip a nigga, then throw the blower in his lap Matter fact, I'm 'bout to speak at this convention Call you back\\u2014 Alright, kids, we're gonna talk about gun control (Pray for me) Damn! It's not a place This country is to me a sound Of drum and bass You close your eyes to look around Hail Mary, Jesus and Joseph The great American flag is wrapped in drag with explosives Compulsive disorder, sons and daughters Barricaded blocks and borders Look what you taught us! It's murder on my street, your street, back streets Wall Street, corporate offices Banks, employees, and bosses with Homicidal thoughts; Donald Trump's in office We lost Barack and promised to never doubt him again But is America honest, or do we bask in sin? Pass the gin, I mix it with American blood Then bash him in, you Crippin' or you married to Blood? I'll ask again\\u2014oops, accident It's nasty when you set us up Then roll the dice, then bet us up You overnight the big rifles, then tell Fox to be scared of us Gang members or terrorists, et cetera, et cetera America's reflections of me, that's what a mirror does It's not a place This country is to me a sound Of drum and bass You close your eyes to look ar\\u2014  \"}", "A-ap-rocky-fuckin-problems": "\" I love bad bitches, that's my fuckin' problem And yeah, I like to fuck, I got a fuckin' problem I love bad bitches, that's my fuckin' problem And yeah, I like to fuck, I got a fuckin' problem I love bad bitches, that's my fuckin' problem And yeah, I like to fuck, I got a fuckin' problem If findin' somebody real is your fuckin' problem (Yeah) Bring your girls to the crib, maybe we can solve it, ayy Hold up, bitches simmer down (Uh) Takin' hella long, bitch, give it to me now (Uh) Make that thing pop like a semi or a 9 Ooh, baby like it raw with the shimmy shimmy ya, huh? A$AP (Yeah,) get like me (Uh) Never met a motherfucker fresh like me (Yeah) All these motherfuckers wanna dress like me (Uh) But the chrome to your dome make you sweat like Keith \\u2018Cause I'm the nigga, the nigga nigga, like how you figure? (Yeah) Gettin' figures and fuckin' bitches, she rollin' Swishers Brought her bitches, I brought my niggas (Uh) They gettin' bent up off the liquor (Uh) She love my licorice, I let her lick it (Alright) They say money make a nigga act niggerish (Uh) But least a nigga nigga rich I be fuckin' broads like I be fuckin' bored Turn a dyke bitch out, have her fuckin' boys; beast I love bad bitches, that's my fuckin' problem And yeah, I like to fuck, I got a fuckin' problem I love bad bitches, that's my fuckin' problem And yeah, I like to fuck, I got a fuckin' problem I love bad bitches, that's my fuckin' problem And yeah, I like to fuck, I got a fuckin' problem If findin' somebody real is your fuckin' problem Bring your girls to the crib, maybe we can solve it, ayy Ooh, I know you love it when this beat is on Make you think about all of the niggas you been leadin' on Make me think about all of the rappers I've been feedin' on Got a feelin' that's the same dudes that we speakin' on, oh word? Ain't heard my album? Who you sleepin' on? You should print the lyrics out and have a fuckin' read-along Ain't a fuckin' sing-along 'less you brought the weed along Then ju\\u2026 okay, I got it Then just drop down and get your eagle on Or we can stare up at the stars and put the Beatles on All that shit you talkin' 'bout is not up for discussion I will pay to make it bigger, I don't pay for no reduction If it's comin' from a nigga I don't know, then I don't trust it If you comin' for my head, then motherfucker get to bustin' Yes, Lord, I don't really say this often But this long-dick nigga ain't for the long talkin'; I'm beast I love bad bitches, that's my fuckin' problem And yeah, I like to fuck, I got a fuckin' problem I love bad bitches, that's my fuckin' problem And yeah, I like to fuck, I got a fuckin' problem I love bad bitches, that's my fuckin' problem And yeah, I like to fuck, I got a fuckin' problem If findin' somebody real is your fuckin' problem Bring your girls to the crib, maybe we can solve it Uh, yeah, ho, this the finale My pep talk turn into a pep rally Say she from the hood, but she live inside in the valley, now Vaca'd in Atlanta, then she goin' back to Cali, mmm Got your girl on my line, world on my line The irony, I fuck 'em at the same damn time She eyein' me like a nigga don't exist Girl, I know you want this dick Girl, I'm Kendrick Lamar (Uh) A.K.A. Benz is to me just a car (Uh) That mean your friends-es need be up to par See, my standards are pampered by threesomes tomorrow Mmm, kill 'em all, dead bodies in the hallway Don't get involved, listen what the crystal ball say Halle Berry, hallelujah Holla back, I'll do ya; beast I love bad bitches, that's my fuckin' problem And yeah, I like to fuck, I got a fuckin' problem I love bad bitches, that's my fuckin' problem And yeah, I like to fuck, I got a fuckin' problem I love bad bitches, that's my fuckin' problem And yeah, I like to fuck, I got a fuckin' problem If findin' somebody real is your fuckin' problem Bring your girls to the crib, maybe we can solve it, ayy \"}", "Kendrick-lamar-dna": "\" I got, I got, I got, I got\\u2014 Loyalty, got royalty inside my DNA Cocaine quarter piece, got war and peace inside my DNA I got power, poison, pain and joy inside my DNA I got hustle though, ambition flow inside my DNA I was born like this, since one like this, immaculate conception I transform like this, perform like this, was Yeshua new weapon I don't contemplate, I meditate, then off your fucking head This that put-the-kids-to-bed This that I got, I got, I got, I got\\u2014 Realness, I just kill shit \\u2019cause it's in my DNA I got millions, I got riches buildin' in my DNA I got dark, I got evil, that rot inside my DNA I got off, I got troublesome heart inside my DNA I just win again, then win again like Wimbledon, I serve Yeah, that\\u2019s him again, the sound that engine in is like a bird You see fireworks and Corvette tire skrrt the boulevard I know how you work, I know just who you are See, you's a, you's a, you's a\\u2014 Bitch, your hormones prolly switch inside your DNA Problem is, all that sucker shit inside your DNA Daddy prolly snitched, heritage inside your DNA Backbone don't exist, born outside a jellyfish, I gauge See, my pedigree most definitely don't tolerate the front Shit I've been through prolly offend you, this is Paula's oldest son I know murder, conviction Burners, boosters, burglars, ballers, dead, redemption Scholars, fathers dead with kids and I wish I was fed forgiveness Yeah, yeah, yeah, yeah, soldier\\u2019s DNA (I\\u2019m a soldier's DNA) Born inside the beast, my expertise checked out in second grade When I was 9, on cell, motel, we didn\\u2019t have nowhere to stay At 29, I've done so well, hit cartwheel in my estate And I'm gon' shine like I\\u2019m supposed to, antisocial extrovert And excellent mean the extra work And absentness what the fuck you heard And pessimists never struck my nerve And Nazareth gon' plead his case The reason my power's here on earth Salute the truth, when the prophet say I-I got loyalty, got royalty inside my DNA This is why I say that hip hop has done more damage to young African Americans than racism in recent years I got loyalty, got royalty inside my DNA I live a better life, I'm rollin' several dice, fuck your life I got loyalty, got royalty inside my DNA I live a be-, fuck your life 5, 4, 3, 2, 1 This is my heritage, all I'm inheritin' Money and power, the mecca of marriages Tell me somethin' You mothafuckas can't tell me nothin' I'd rather die than to listen to you My DNA not for imitation Your DNA an abomination This how it is when you in the Matrix Dodgin' bullets, reapin' what you sow And stackin' up the footage, livin' on the go And sleepin' in a villa Sippin' from a Grammy, walkin' in the buildin' Diamond in the ceilin', marble on the floors Beach inside the window, peekin' out the window Baby in the pool, godfather goals Only Lord knows I've been goin' hammer Dodgin' paparazzi, freakin' through the cameras Eat at Four Daughters, Brock wearin' sandals Yoga on a Monday, stretchin' to Nirvana Watchin' all the snakes, curvin' all the fakes Phone never on, I don't conversate I don't compromise, I just penetrate Sex, money, murder\\u2014these are the breaks These are the times, level number 9 Look up in the sky, 10 is on the way Sentence on the way, killings on the way Motherfucker, I got winners on the way You ain't shit without a body on your belt You ain't shit without a ticket on your plate You ain't sick enough to pull it on yourself You ain't rich enough to hit the lot and skate Tell me when destruction gonna be my fate Gonna be your fate, gonna be our faith Peace to the world, let it rotate Sex, money, murder\\u2014our DNA \"}", "Kendrick-lamar-poetic-justice": "\" Every second, every minute Man, I swear that she can get it Say if you a bad bitch, put your hands up high Hands up high, hands up high Tell 'em dim the lights down right now Put me in the mood I'm talkin' about dark room, perfume, go, go I recognize your fragrance Hold up, you ain't never gotta say shit Uh, and I know your taste is A little bit, hmm, high maintenance Uh, everybody else basic You live life on an everyday basis With poetic justice, poetic justice If I told you that a flower bloomed in a dark room Would you trust it? I mean, I write poems in these songs dedicated to you when You're in the mood for empathy, there's blood in my pen Better yet, where your friends and 'em? I really wanna know you all I really wanna show you off Fuck that, pour up plenty of champagne Cold nights when you curse this name You called up your girlfriends And y'all curled in that little bitty Range I heard that she wanna go and party, she wanna go and party Nigga, don't approach her with that Atari Nigga, that ain't good game, homie, sorry They say conversation rule a nation, I can tell But I could never right my wrongs 'Less I write it down for real, P.S You can get it, you can get it You can get it, you can get it And I know just, know just, know just Know just, know just what you want Poetic justice, put it in a song, alright You can get it, you can get it You can get it, you can get it And I know just, know just, know just Know just, know just what you want Poetic justice, put it in a song, alright I really hope you play this, 'cause ol' girl, you test my patience With all these seductive photographs And all these one-off vacations you've been takin' Clearly a lot for me to take in, it don't make sense Young East African girl, you too busy fuckin' with your other man I was tryna put you on game, put you on a plane Take you and your momma to the motherland I could do it, maybe one day When you figure out you're gonna need someone When you figure out it's alright here in the city And you don't run from where we come from That sound like poetic justice, poetic justice You were so new to this life, but goddamn, you got adjusted I mean, I write poems in these songs, dedicated to the fun sex Your natural hair and your soft skin And your big ass in that sundress, ooh Good God, what you doin' that walk for? When I see that thing move I just wish we would fight less and we would talk more They say communication save relations, I can tell But I can never right my wrongs Unless I write 'em down for real, P.S You can get it, you can get it You can get it, you can get it And I know just, know just, know just Know just, know just what you want Poetic justice, put it in a song, alright You can get it, you can get it You can get it, you can get it And I know just, know just, know just Know just, know just what you want Poetic justice, put it in a song, alright Every time I write these words they become a taboo Makin' sure my punctuation curve, every letter here's true Livin' my life in the margin and that metaphor was proof I'm talkin' poetic justice, poetic justice If I told you that a flower bloomed in a dark room Would you trust it? I mean, you need to hear this Love is not just a verb, it's you lookin' in the mirror Love is not just a verb, it's you lookin' for it, maybe Call me crazy, we can both be insane A fatal attraction is common, and what we have common is pain I mean, you need to hear this, love is not just a verb And I can see power steerin', sex drive when you swerve I want that interference, it's coherent, I can hear it Uh-huh, that's your heartbeat It either caught me or it called me, uh-huh Read slow and you'll find gold mines in these lines Sincerely, yours truly, and right before you go blind, P.S You can get it, you can get it You can get it, you can get it And I know just, know just, know just Know just, know just what you want Poetic justice, put it in a song \\\"I'm gon' ask you one more time, homie Where is you from? Or it is a problem.\\\" \\\"Ayy, you over here for Sherane, homie?\\\" \\\"Yo, I don't care who this nigga over here for If he don't tell me where he from, it's a wrap! I'm sorry.\\\" \\\"Hol' up, hol' up, hol' up, we gon' do it like this, okay? I'ma tell you where I'm from, okay? You gon' tell me where you from, okay? Or where your grandma stay, where your mama stay, or where your daddy stay, okay?\\\" \\\"Enough with all this talkin'.\\\" \\\"Matter of fact, get out the van, homie! Get out the car before I snatch you out that motherfucker, homie!\\\"  \"}", "Kendrick-lamar-bitch-dont-kill-my-vibe": "\" I am a sinner who's probably gonna sin again Lord, forgive me! Lord, forgive me! Things I don't understand Sometimes I need to be alone Bitch, don't kill my vibe! Bitch, don't kill my vibe! I can feel your energy from two planets away I got my drink, I got my music I would share it, but today I'm yelling Bitch, don't kill my vibe! Bitch, don't kill my vibe! Bitch, don't kill my vibe! Bitch, don't kill my vibe! Look inside of my soul and you can find gold and maybe get rich Look inside of your soul and you can find out it never exist I can feel the changes I can feel a new life, I always knew life can be dangerous I can say that I like a challenge and you tell me it's painless You don't know what pain is How can I paint this picture When the color blind is hangin' with you? Fell on my face and awoke with a scar Another mistake livin' deep in my heart Wear it on top of my sleeve in a flick I can admit that it did look like yours Why you resent every making of this? Tell me your purpose is petty again But even a small lighter can burn a bridge Even a small lighter can burn a bridge I can feel the changes I can feel the new people around me just want to be famous You can see that my city found me Then put me on stages, to me that's amazin' To you that's a quick check With all disrespect, let me say this I am a sinner who's probably gonna sin again Lord, forgive me! Lord, forgive me! Things I don't understand Sometimes I need to be alone Bitch, don't kill my vibe! Bitch, don't kill my vibe! I can feel your energy from two planets away I got my drink, I got my music I would share it, but today I'm yelling Bitch, don't kill my vibe! Bitch, don't kill my vibe! Bitch, don't kill my vibe! Bitch, don't kill my vibe! I'm tryin' to keep it alive And not compromise the feeling we love You're tryin' to keep it deprived And only co-sign what radio does And I'm lookin' right past you We live in a world, we live in a world on two different axles You live in a world, you livin' behind the mirror I know what you scared of The feeling of feeling emotions inferior This shit is vital, I know you had to This shit is vital, I know you had to Die in a pitiful vain, tell me a watch and a chain Is way more believable, give me a feasible gain Rather a seasonal name I'll let the people know this is somethin' you can blame On yourselves, you can remain stuck in a box I'ma break out and then hide every lock I'ma break out and then hide every lock I can feel the changes I can feel the new people around me just want to be famous You can see that my city found me Then put me on stages, to me that's amazin' To you that's a quick check With all disrespect, let me say this I am a sinner who's probably gonna sin again Lord, forgive me! Lord, forgive me! Things I don't understand Sometimes I need to be alone Bitch, don't kill my vibe! Bitch, don't kill my vibe! I can feel your energy from two planets away I got my drink, I got my music I would share it, but today I'm yelling Bitch, don't kill my vibe! Bitch, don't kill my vibe! Bitch, don't kill my vibe! Bitch, don't kill my vibe! Bitch, don't kill my vibe! You ain't heard the coast like this in a long time Don't you see that long line? And they waiting on Kendrick like the first and the fifteenth Threes in the air, I can see you are in sync Hide your feelings, hide your feelings Now what you better do I'll take your girlfriend and put that pussy on a pedestal Bitch, don't kill my vibe! Bitch, don't kill my vibe! Walk out the door and they scream it's alive My New Year's resolution is to stop all the pollution Talk too motherfuckin' much, I got my drink, I got my music I say bitch, don't kill my vibe! Bitch, don't kill my vibe! Bitch, don't kill my vibe! Bitch, don't kill my vibe! Ayy, K-Dot, get in the car, nigga! Come on, we finna roll out! Nigga, I got a pack of blacks and a beat CD Get yo' freestyles ready!  \"}", "Kendrick-lamar-king-kunta": "\" I got a bone to pick I don't want you monkey-mouth motherfuckers Sittin' in my throne again Ayy, ayy, nigga, what's happenin'? K-Dot back in the hood, nigga! I'm mad (He mad!), but I ain't stressin' True friends, one question Bitch, where you when I was walkin'? Now I run the game, got the whole world talkin' King Kunta, everybody wanna cut the legs off him Kunta, black man taking no losses, oh yeah Bitch, where you when I was walkin'? Now I run the game, got the whole world talkin' King Kunta, everybody wanna cut the legs off him When you got the yams\\u2014(What's the yams?) The yam is the power that be You can smell it when I'm walkin' down the street (Oh yes, we can, oh yes, we can) I can dig rappin', but a rapper with a ghost writer? What the fuck happened? (Oh no!) I swore I wouldn't tell, but most of y'all sharing bars Like you got the bottom bunk in a two-man cell (A two-man cell) Something's in the water (Something's in the water) And if I gotta brown-nose for some gold Then I'd rather be a bum than a motherfuckin' baller (Oh yeah!) Bitch, where you when I was walkin'? Now I run the game, got the whole world talkin' King Kunta, everybody wanna cut the legs off him King Kunta, black man taking no losses, oh yeah Bitch, where you when I was walkin'? Now I run the game, got the whole world talkin' King Kunta, everybody wanna cut the legs off him When you got the yams\\u2014(What's the yams?) The yam brought it out of Richard Pryor Manipulated Bill Clinton with desires 24/7, 365 days times two I was contemplatin' gettin' off stage Just to go back to the hood, see my enemy, and say\\u2026 (Oh yeah) Bitch, where you when I was walkin'? Now I run the game, got the whole world talkin' King Kunta, everybody wanna cut the legs off him King Kunta, black man taking no losses, oh yeah Bitch, where you when I was walkin'? Now I run the game, got the whole world talkin' King Kunta, everybody wanna cut the legs off him You goat-mouth mammyfucker I was gonna kill a couple rappers, but they did it to themselves Everybody's suicidal, they ain't even need my help This shit is elementary, I'll probably go to jail If I shoot at your identity and bounce to the left Stuck a flag in my city, everybody's screamin', \\\"Compton!\\\" I should probably run for mayor when I'm done, to be honest And I put that on my momma and my baby boo too 20 million walkin' out the court buildin', woo-woo! Aw, yeah, fuck the judge I made it past 25, and there I was A little nappy-headed nigga with the world behind him Life ain't shit but a fat vagina Screamin', \\\"Annie, are you okay? Annie, are you okay?\\\" Limo tinted with the gold plates Straight from the bottom, this the belly of the beast From a peasant to a prince to a motherfuckin' king (Oh yeah) Bitch, where you when I was walkin'\\u2014*Gunshot* By the time you hear the next pop The funk shall be within you\\u2014*Gunshot* Now I run the game, got the whole world talkin' King Kunta, everybody wanna cut the legs off him King Kunta, black man taking no losses, oh yeah Bitch, where you when I was walkin'? Now I run the game, got the whole world talkin' King Kunta, everybody wanna cut the legs off him Funk, funk, funk, funk, funk, funk, funk, funk, funk, funk, funk We want the funk We want the funk Now if I give you the funk, you gon' take it? We want the funk Now if I give you the funk, you gon' take it? We want the funk Now if I give you the funk, you gon' take it? We want the funk Do you want the funk? We want the funk Do you want the funk? We want the funk Now if I give you the funk, you gon' take it? We want the funk I remember you was conflicted, misusing your influence  \"}", "Kendrick-lamar-element": "\" New Kung Fu Kenny Ain't nobody prayin' for me Y'all know, what happens on Earth stays on Earth Here we go! I don't give a fuck, I don't give a fuck I don't give a, I don't give a, I don't give a fuck I'm willin' to die for this shit I done cried for this shit, might take a life for this shit Put the Bible down and go eye for an eye for this shit D-O-T my enemy, won't catch a vibe for this shit, ayy I been stomped out in front of my mama My daddy commissary made it to commas Bitch, all my grandmas dead So ain't nobody prayin' for me, I'm on your head, ayy Thirty millions later, know the feds watchin' Auntie on my Telegram like, \\\"Be cautious!\\\" I be hangin' out at Tam's, I be on Stockton I don't do it for the 'Gram, I do it for Compton I'm willin' to die for this shit, nigga I'll take your fuckin' life for this shit, nigga We ain't goin' back to broke, family sellin' dope That's why you maney-ass rap niggas better know If I gotta slap a pussy-ass nigga, I'ma make it look sexy If I gotta go hard on a bitch, I'ma make it look sexy I pull up, hop out, air out, made it look sexy They won't take me out my element Nah, take me out my element I'm allergic to a bitch nigga, ayy An imaginary rich nigga, ayy Seven figures ho, that's slimmer than my bitch figure, ayy Goin' digital and physical on all y'all, ayy Bunch of criminals and money in my phone calls, ayy We okay, we let the A1 fly Relocate, jump on the same G5 Checkin' for me heavy 'cause I go yeah, I go yeah They never been ready, yeah, I know yeah, know yeah 100K spread across the floor, 'cross the floor, yeah None of y'all fuckin' with the flow yeah, the flow yeah Years in the makin', and don't y'all mistake it I got 'em by a landslide, we talkin' about races You know this'll never be a tie, just look at they laces You know careers take off, just gotta be patient Mr. One through Five, that's the only logic Fake my death, go to Cuba, that's the only option If I gotta slap a pussy-ass nigga, I'ma make it look sexy If I gotta go hard on a bitch, I'ma make it look sexy I pull up, hop out, air out, made it look sexy They won't take me out my element Nah, take me out my element Damned if I do, if I don't (Yuh) Goddamn us all if you won't (Yuh) Damn, damn, damn, it's a goddamn shame You ain't front in line, get out the goddamn way Niggas thought they wasn't gonna see me, huh? Niggas thought that K-Dot real life Was the same life they see on TV, huh? Niggas wanna flex on me and be in L.A. for free, huh? Next time they hit the 10 freeway, we need a receipt, huh? 'Cause most of y'all ain't real, most of y'all gon' squeal Most of y'all just envy, but jealousy get you killed Most of y'all throw rocks and try to hide your hand Just say his name and I promise that you'll see Candyman Because it's all in your eyes, most of y'all tell lies Most of y'all don't fade, most of y'all been advised Last LP I tried to lift the black artists But it's a difference 'tween black artists and wack artists If I gotta slap a pussy-ass nigga, I'ma make it look sexy It's the one and only, the world's greatest, the Kid Capri If I gotta go hard on a bitch, I'ma make it look sexy I pull up, hop out, air out, made it look sexy They won't take me out my element Nah, take me out my element  \"}", "Kendrick-lamar-the-blacker-the-berry": "\" Everything black, I don't want black (They want us to bow) I want everything black, I ain't need black (Down to our knees) Some white, some black, I ain't mean black (And pray to the God) I want everything black (We don't believe) Everything black, want all things black I don't need black, want everything black Don't need black, our eyes ain't black I own black, own everything black Six in the morn', fire in the street Burn, baby, burn, that's all I wanna see And sometimes I get off watchin' you die in vain It's such a shame they may call me crazy They may say I suffer from schizophrenia or somethin' But homie, you made me Black don't crack, my nigga I'm the biggest hypocrite of 2015 Once I finish this, witnesses will convey just what I mean Been feeling this way since I was 16, came to my senses You never liked us anyway, fuck your friendship, I meant it I'm African-American, I'm African I'm black as the moon, heritage of a small village Pardon my residence Came from the bottom of mankind My hair is nappy, my dick is big, my nose is round and wide You hate me don't you? You hate my people, your plan is to terminate my culture You're fuckin' evil I want you to recognize that I'm a proud monkey You vandalize my perception but can't take style from me And this is more than confession I mean I might press the button just so you know my discretion I'm caught in my feelings, I know that you feel it You sabotage my community, makin' a killin' You made me a killer, emancipation of a real nigga The blacker the berry, the sweeter the juice The blacker the berry, the sweeter the juice The blacker the berry, the sweeter the juice The blacker the berry, the bigger I shoot I said they treat me like a slave, cah' me black Woi, we feel a whole heap of pain, cah' we black And man a say they put me inna chains, cah' we black Imagine now, big gold chains full of rocks How you no see the whip, left scars 'pon me back But now we have a big whip parked 'pon the block All them say we doomed from the start, cah' we black Remember this, every race start from the block, jus 'member dat I'm the biggest hypocrite of 2015 Once I finish this, witnesses will convey just what I mean I mean, it's evident that I'm irrelevant to society That's what you're telling me, penitentiary would only hire me Curse me till I'm dead Church me with your fake prophesizing that I'ma be just another slave in my head Institutionalized manipulation and lies Reciprocation of freedom only live in your eyes You hate me don't you? I know you hate me just as much as you hate yourself Jealous of my wisdom and cards I dealt Watchin' me as I pull up, fill up my tank, then peel out Muscle cars like pull ups, show you what these big wheels 'bout, ah Black and successful, this black man meant to be special Katzkins on my radar, bitch, how can I help you? How can I tell you I'm making a killin'? You made me a killer, emancipation of a real nigga The blacker the berry, the sweeter the juice The blacker the berry, the sweeter the juice The blacker the berry, the sweeter the juice The blacker the berry, the bigger I shoot I said they treat me like a slave, cah' me black Woi, we feel a whole heap of pain, cah' we black And man a say they put me inna chains, cah' we black Imagine now, big gold chains full of rocks How you no see the whip, left scars 'pon me back But now we have a big whip parked 'pon the block All them say we doomed from the start, cah' we black Remember this, every race start from the block, jus 'member dat I'm the biggest hypocrite of 2015 When I finish this if you listenin' then sure you will agree This plot is bigger than me, it's generational hatred It's genocism, it's grimy, little justification I'm African-American, I'm African I'm black as the heart of a fuckin' Aryan I'm black as the name of Tyrone and Darius Excuse my French but fuck you \\u2014 no, fuck y'all That's as blunt as it gets, I know you hate me, don't you? You hate my people, I can tell cause it's threats when I see you I can tell cause your ways deceitful Know I can tell because you're in love with that Desert Eagle Thinkin' maliciously, he get a chain then you gone bleed him It's funny how Zulu and Xhosa might go to war Two tribal armies that want to build and destroy Remind me of these Compton Crip gangs that live next door Beefin' with Pirus, only death settle the score So don't matter how much I say I like to preach with the Panthers Or tell Georgia State \\\"Marcus Garvey got all the answers\\\" Or try to celebrate February like it's my B-Day Or eat watermelon, chicken, and Kool-Aid on weekdays Or jump high enough to get Michael Jordan endorsements Or watch BET cause urban support is important So why did I weep when Trayvon Martin was in the street When gang banging make me kill a nigga blacker than me? Hypocrite! \"}", "Kendrick-lamar-loyalty": "\" I said I'm geeked and I\\u2019m fired up (Fired, fire) All I want tonight is just get high (High, high, high) Girl, you look so good, it's to die for (Die for) Ooh, that pussy good, it's to die for (In fire) It\\u2019s a secret society All we ask is trust (All we ask is trust) All we got is us Loyalty, loyalty, loyalty Loyalty, loyalty, loyalty Kung Fu Kenny now My resume is real enough for two millenniums A better way to make a wave, stop defendin' them I meditate and moderate all of my wins again I'm hangin' on the fence again I'm always on your mind I put my lyric and my lifeline on the line And ain't no limit when I might shine, might grind You rollin' with it at the right time, right now (Only for the dollar sign) Bad girl RiRi now Swerve, swerve, swerve, swerve, leave it now On your pulse like it's EDM Gas in the bitch like it\\u2019s premium Haul ass on a bitch all in the fast lane Been a bad bitch way before any cash came I\\u2019m established, hundred carats on my name Run the atlas, I'm a natural, I\\u2019m alright I'm a savage, I'm an asshole, I'm a king Shimmy ya, shimmy ya, shimmy ya rah (Yeah) You can tell your nigga he can meet me outside (Yeah) You can babysit him when I leave him outside Ain\\u2019t no other love like the one I know I done been down so long lost hope I done came down so hard I slowed Honestly forever, all a real nigga want I said I'm geeked and I'm fired up (Fired, fire) All I want tonight is just to get high up (Yeah) All I want is, all I want is Loyalty, loyalty, loyalty Loyalty, loyalty, loyalty 10-4, no switchin' sides Feel somethin' wrong You actin' shifty, you don't ride With me no more, I need Loyalty, loyalty, loyalty Loyalty, loyalty, loyalty Tell me who you loyal to Is it money? Is it fame? Is it weed? Is it drink? Is it comin' down with the loud pipes in the rain? Big chillin', only for the power in your name Tell me who you loyal to Is it love for the streets when the lights get dark? Is it unconditional when the 'Rari don't start? Tell me when your loyalty is comin' from the heart Tell me who you loyal to Do it start with your woman or your man? (Mmm) Do it end with your family and friends? (Mmm) Are you loyal to yourself in advance? I said, tell me who you loyal to Is it anybody that you would lie for? Anybody you would slide for? Anybody you would die for? That's what God for I said I'm geeked and I'm fired up (Fired, fire) All I want tonight is just to get high up (Yeah) All I want is, all I want is Loyalty, loyalty, loyalty Loyalty, loyalty, loyalty 10-4, no switchin' sides Feel somethin' wrong You actin' shifty, you don't ride With me no more, I need Loyalty, loyalty, loyalty Loyalty, loyalty, loyalty It's so hard to be humble It's so hard to be Lord knows I'm tryin' Lord knows I'm dyin', baby  \"}", "Kendrick-lamar-alright": "\" Alls my life I has to fight, nigga Alls my life I... Hard times like, \\\"Yah!\\\" Bad trips like, \\\"Yah!\\\" Nazareth, I'm fucked up Homie, you fucked up But if God got us, then we gon' be alright Nigga, we gon' be alright Nigga, we gon' be alright We gon' be alright Do you hear me, do you feel me? We gon' be alright Nigga, we gon' be alright Huh? We gon' be alright Nigga, we gon' be alright Do you hear me, do you feel me? We gon' be alright Uh, and when I wake up I recognize you're looking at me for the pay cut But homicide be looking at you from the face down What MAC-11 even boom with the bass down? Schemin', and let me tell you 'bout my life Painkillers only put me in the twilight Where pretty pussy and Benjamin is the highlight Now tell my momma I love her, but this what I like, Lord knows Twenty of 'em in my Chevy, tell 'em all to come and get me Reaping everything I sow, so my karma come in heaven No preliminary hearings on my record I'm a motherfucking gangster in silence for the record, uh Tell the world I know it's too late Boys and girls, I think I gone cray Drown inside my vices all day Won't you please believe when I say Wouldn't you know We been hurt, been down before Nigga, when our pride was low Lookin' at the world like, \\\"Where do we go?\\\" Nigga, and we hate po-po Wanna kill us dead in the street fo sho' Nigga, I'm at the preacher's door My knees gettin' weak, and my gun might blow But we gon' be alright Nigga, we gon' be alright Nigga, we gon' be alright We gon' be alright Do you hear me, do you feel me? We gon' be alright Nigga, we gon' be alright Huh? We gon' be alright Nigga, we gon' be alright Do you hear me, do you feel me? We gon' be alright What you want you, a house\\u2060? You, a car? 40 acres and a mule? A piano, a guitar? Anything, see my name is Lucy, I'm your dog Motherfucker, you can live at the mall I can see the evil, I can tell it, I know it's illegal I don't think about it, I deposit every other zero Thinking of my partner, put the candy, paint it on the Regal Digging in my pocket, ain't a profit big enough to feed you Every day my logic get another dollar just to keep you In the presence of your chico... Ah! I don't talk about it, be about it, every day I sequel If I got it then you know you got it, Heaven, I can reach you Pat Dawg, Pat Dawg, Pat Dawg, my dog, that's all Bick back and Chad, I trap the bag for y'all I rap, I black on track so rest assured My rights, my wrongs; I write 'til I'm right with God Wouldn't you know We been hurt, been down before Nigga, when our pride was low Lookin' at the world like, \\\"Where do we go?\\\" Nigga, and we hate po-po Wanna kill us dead in the street fo sho' Nigga, I'm at the preacher's door My knees gettin' weak, and my gun might blow But we gon' be alright Nigga, we gon' be alright Nigga, we gon' be alright We gon' be alright Do you hear me, do you feel me? We gon' be alright Nigga, we gon' be alright Huh? We gon' be alright Nigga, we gon' be alright Do you hear me, do you feel me? We gon' be alright I keep my head up high I cross my heart and hope to die Lovin' me is complicated Too afraid of a lot of changes I'm alright, and you're a favorite Dark nights in my prayers I remembered you was conflicted Misusing your influence, sometimes I did the same Abusing my power, full of resentment Resentment that turned into a deep depression Found myself screamin' in the hotel room I didn't wanna self-destruct The evils of Lucy was all around me So I went runnin' for answers  \"}", "Kendrick-lamar-backseat-freestyle": "\" Uh, Martin had a dream Martin had a dream Kendrick have a dream All my life I want money and power Respect my mind or die from lead shower I pray my dick get big as the Eiffel Tower So I can fuck the world for seventy-two hours Goddamn I feel amazin', damn, I'm in the Matrix My mind is livin' on cloud nine and this 9 is never on vacation Start up that Maserati and \\u2013 vroom-vroom! \\u2013 I'm racin' Poppin' pills in the lobby and I pray they don't find her naked And I pray you niggas is hatin', shooters go after Judas Jesus Christ, if I live life on my knees ain't no need to do this Park it in front of Lueders, next to that Church's Chicken All you pussies is losers, all my niggas is winners, screamin'\\u2014 All my life I want money and power Respect my mind or die from lead shower I pray my dick get big as the Eiffel Tower So I can fuck the world for seventy-two hours Goddamn I got bitches, damn I got bitches Damn I got bitches: wifey, girlfriend and mistress All my life I want money and power Respect my mind or die from lead showers I've got 25 lighters on my dresser, yessir Put fire to that ass, body cast on a stretcher And her body got that ass that a ruler couldn't measure And it make me cum fast, but I never get embarrassed And I recognize you have what I've been wantin' since that record That Adina Howard had pop it fast to impress her She rollin', I'm holdin' my scrotum and posin' This voice here is golden, so fuck y'all, I goes in, and\\u2014 All my life I want money and power Respect my mind or die from lead shower I pray my dick get big as the Eiffel Tower So I can fuck the world for seventy-two hours Goddamn I got bitches, damn I got bitches Damn I got bitches: wifey, girlfriend and mistress All my life I want money and power Respect my mind or, nigga, it's go time I roll in dough with a good grind And I run at ho with a baton That's a relay race with a bouquet They say, \\\"K, you goin' marry mines.\\\" Beeotch! No way, beeotch! No way Beeotch! No way, beeotch! Okay I'm never livin' life confined As I feel you even if I'm blind I can tell you who, what, when, where How to sell your game right on time Beeotch! Go play, beeotch! Go play Beeotch! Go play, beeotch! I look like OJ Killin' everything from pussy to a mothafuckin' Hit-Boy beat She pussy poppin' and I got options like an audible, I be C-O-M-P-T-O-N, I win, then ball at your defeat C-O-M-P-T-O-N, my city, mobbin' in the street, yellin'\\u2014 All my life I want money and power Respect my mind or die from lead shower I pray my dick get big as the Eiffel Tower So I can fuck the world for seventy-two hours Goddamn I got bitches, damn I got bitches Damn I got bitches, wifey, girlfriend and mistress All my life I want money and power Respect my mind or die from lead showers Let it run, Ali Martin had a dream Martin had a dream Kendrick have a dream  \"}", "Kendrick-lamar-love": "\" Damn, love or lust Damn, all of us Give me a run for my money There is nobody, no one to outrun me (Another world premiere!) So give me a run for my money Sippin' bubbly, feelin\\u2019 lovely, livin' lovely Just love me I wanna be with you, ayy, I wanna be with Just love me, just love me, just love I wanna be with you, ayy, I wanna be with Love me I wanna be with you Love me, just love me If I didn't ride blade on curb, would you still love me? If I minimized my net-worth, would you still love me? Keep it a hundred, I\\u2019d rather you trust me than to love me Keep it a whole one hund': don't got you, I got nothin' Ayy, I got somethin' Hol' up, we gon' function, ayy, no assumptions, ayy Feelin' like Tyson with it Knock it out twice, I\\u2019m with it Only for the night, I\\u2019m kiddin' Only for life, yeah, only for life, yeah Only for life, let\\u2019s get it Hit that shoulder lean I know what comin' over me Backstroke oversea I know what you need Already on ten, all money come in All feeling go out, this feeling don't drought This party won't end If I didn\\u2019t ride blade on curb, would you still love me? If I minimized my net-worth, would you still love me? Keep it a hundred, I'd rather you trust me than to love me Keep it a whole one hund': don't got you, I got nothin' Give me a run for my money There is nobody, no one to outrun me So give me a run for my money Sippin' bubbly, feelin' lovely, livin' lovely Just love me I wanna be with you, ayy, I wanna be with Just love me, just love me, just love I wanna be with you, ayy, I wanna be with Love me I wanna be with you Love me, just love me I'm on the way We ain't got no time to waste Poppin' your gum on the way (love me) Am I in the way? I don't wan' pressure you none I want your blessing today (love me) Oh, by the way, open the door by the way Told you that I'm on the way (love me) I'm on the way, I know connection is vague Pick up the phone for me, babe Dammit, we jammin' Bad attitude from yo' nanny Curves and your hips from yo' mammy Remember Gardena, I took the studio camera I know Top will be mad at me I had to do it, I want your body, your music I bought the big one to prove it Look what you made Told you that I'm on the way I'm like a exit away, yep If I didn't ride blade on curb, would you still love me? If I minimized my net-worth, would you still love me? Keep it a hundred, I'd rather you trust me than to love me Keep it a whole one hund': don't got you, I got nothin' Give me a run for my money There is nobody, no one to outrun me So give me a run for my money Sippin' bubbly, feelin' lovely, livin' lovely Just love me I wanna be with you, ayy, I wanna be with Just love me, just love me, just love me I wanna be with you, ayy, I wanna be with Love me I wanna be with you Love me, just love me  \"}", "Travis-scott-goosebumps": "\" Yeah 7:30 in the night, yeah Ooh-oooh, ooh I get those goosebumps every time, yeah, you come around, yeah You ease my mind, you make everything feel fine Worried 'bout those comments I'm way too numb, yeah, it's way too dumb, yeah I get those goosebumps every time, I need the Heimlich Throw that to the side, yeah I get those goosebumps every time, yeah When you're not around (straight up) When you throw that to the side, yeah (it's lit) I get those goosebumps every time, yeah 7-1-3 Through the 2-8-1, yeah, I'm ridin', why they on me? Why they on me? I'm flyin', sippin' low-key I'm sippin' low-key in Onyx, rider, rider When I'm pullin' up right beside ya Pop star, lil' Mariah When I text a cute game, wildness Throw a stack on the Bible Never Snapchat or took molly She fall through plenty, her and all her ginnies, yeah We at the top floor, right there off Doheny, yeah Oh no, I can't fuck with y'all Yeah, when I'm with my squad I cannot do no wrong Yeah, saucin' in the city, don't get misinformed Yeah, they gon' pull up on you (Brr, brr, brr) Yeah, we gon' do some things, some things you can't relate Yeah, 'cause we from a place, a place you cannot stay Oh, you can't go, oh, I don't know Oh, back the fuck up off me (Brr, brr, brr) I get those goosebumps every time, yeah, you come around, yeah You ease my mind, you make everything feel fine Worried 'bout those comments I'm way too numb, yeah, it's way too dumb, yeah I get those goosebumps every time, I need the Heimlich Throw that to the side, yeah I get those goosebumps every time, yeah When you're not around When you throw that to the side, yeah I get those goosebumps every time I want to press my like, yeah, I wanna press my I want a green light, I wanna be like I wanna press my line, yeah I wanna take that ride, yeah I'm gonna press my line I want a green light, I wanna be like, I wanna press my\\u2014 Mama, dear, spare your feelings I'm relivin' moments, peeling more residual (I can) buy the building, burn the building Take your bitch, rebuild the building just to fuck some more (I can) justify my love for you And touch the sky for God to stop, debating war Put the pussy on a pedestal (Ayy) Put the pussy on a high horse That pussy to die for That pussy to die for Peter, piper, picked a pepper So I could pick your brain and put your heart together We depart the shady parts and party hard The diamonds yours, the coupe forever My best shots might shoot forever like (Brr) I get those goosebumps every time, yeah, you come around, yeah You ease my mind, you make everything feel fine Worried 'bout those comments I'm way too numb, yeah, it's way too dumb, yeah I get those goosebumps every time, I need the Heimlich Throw that to the side, yeah I get those goosebumps every time, yeah When you're not around When you throw that to the side, yeah I get those goosebumps every time  \"}", "Kendrick-lamar-sing-about-me-im-dying-of-thirst": "\" When the lights shut off and it's my turn To settle down, my main concern Promise that you will sing about me Promise that you will sing about me I said when the lights shut off and it's my turn To settle down, my main concern Promise that you will sing about me Promise that you will sing about me I woke up this morning and figured I'd call you In case I'm not here tomorrow I'm hopin' that I can borrow A peace of mind, I'm behind on what's really important My mind is really distorted I find nothing but trouble in my life I'm fortunate you believe in a dream This orphanage we call a ghetto is quite a routine And last night was just another distraction Or a reaction of what we consider madness I know exactly what happened You ran outside when you heard my brother cry for help Held him like a newborn baby and made him feel Like everything was alright in a fight he tried to put up But the type of bullet that stuck Had went against his will, that's blood spilled on your hands My plan's rather vindictive Everybody's a victim in my eyes When I ride it's a murderous rhythm And outside became pitch black A demon glued to my back, whispering \\\"Get 'em!\\\" I got 'em and I ain't give a fuck That same mentality I told my brother not to duck In actuality it's a trip how we trip off of colors I wonder if I'll ever discover a passion like you and recover The life that I knew as a youngin In pajamas and dun-ta-duns When thunder comes it rains cats and dogs dumb Niggas like me never prosper Prognosis of a problem child, I'm proud and well-devoted This Piru shit been in me forever So forever I'ma push it, wherever, whenever And I love you 'cause you love my brother like you did Just promise me you'll tell this story when you make it big And if I die before your album drop, I hope\\u2014 Promise that you will sing about me Promise that you will sing about me I said when the lights shut off and it's my turn To settle down, my main concern Promise that you will sing about me Promise that you will sing about me You wrote a song about my sister on your tape And called it Section.80 The message resembled \\\"Brenda's Got a Baby\\\" What's crazy was I was hearin' about it But doubted your ignorance How could you ever just put her on blast and shit? Judgin' her past and shit? Well, it's completely my future Her nigga behind me right now askin' for ass and shit And I'ma need that forty dollars Even if I got to fuck, suck and swallow In the parking lot, Gonzales Park, I'm followed By a married man, and father of three My titties bounce on the cadence of his tinklin' keys Matter of fact, he my favorite 'cause he tip me with E's He got a cousin named David and I seen him last week This is the life of another girl damaged by the system These foster homes, I run away and never do miss 'em See, my hormones just run away and if I can get 'em Back to where they used to be, then I'll probably be in the denim Of a family gene that show women how to be woman Or better yet, a leader, you need her to learn somethin' Then you probably need to beat her, that's how I was taught Three niggas in one room, first time I was tossed And I'm exhausted, but fuck that \\\"Sorry for your loss\\\" shit My sister died in vain, but what point are you tryna gain If you can't fit the pumps I walk in? I'll wait\\u2026 Your rebuttal a little too late And if you have a album date, just make sure I'm not in the song 'Cause I don't need the attention, bring enough of that on my own And matter fact, did I mention that I physically feel great? A doctor's approval is a waste of time, I know I'm straight I'll probably live longer than you and never fade away I'll never fade away, I'll never fade away, I know my fate And I'm on the grind for this cake, I'ma get it or die tryin' I'm eyein' every male gender with intentions of buyin' You lyin' to these motherfuckers Talkin' about you can help 'em with my story You can help me if you sell this pussy for me, nigga Don't ignore me, nigga, fuck your glory, nigga, you ain't shit... When the lights shut off and it's my turn To settle down, my main concern Promise that you will sing about me Promise that you will sing about me I said when the lights shut off and it's my turn To settle down, my main concern Promise that you will sing about me Promise that you will sing about me Sometimes I look in the mirror And ask myself: Am I really scared of passin' away? If it's today, I hope I hear a Cry out from Heaven so loud it can water down a demon With the Holy Ghost 'til it drown in the blood of Jesus I wrote some raps that made sure that my lifeline reekin' The scent of a reaper, ensurin' that my allegiance With the other side may come soon, and if I'm doomed May the womb of my mother be blessed for many moons I suffer a lot And every day that glass mirror get tougher to watch I tie my stomach in knots And I'm not sure why I'm infatuated with death My imagination is surely an aggravation of threats That can come about, \\u2019cause the tongue is mighty powerful And I can name a list of your favorites that probably vouch Maybe 'cause I'm a dreamer and sleep is the cousin of death Really stuck in the schema of wonderin' when I'ma rest And you're right, your brother was a brother to me And your sister's situation was the one that pulled me In a direction to speak on somethin' That's realer than the TV screen By any means, wasn't tryin' to offend or come between Her personal life, I was like \\\"It need to be told\\\" Cursin' the life of twenty generations after her soul Exactly what'd happen if I ain't continue rappin' Or steady bein' distracted by money, drugs and 4-5's I count lives, all on these songs Look at the weak and cry, pray one day you'll be strong Fightin' for your rights, even when you're wrong And hope that at least one of you sing about me when I'm gone Am I worth it? Did I put enough work in? Promise that you will sing about me Promise that you will sing about me I said when the lights shut off and it's my turn To settle down, my main concern Promise that you will sing about me Promise that you will sing about me Promise that you'll sing about me forever Promise that you'll sing about me for\\u2014 ooooh Promise that you'll sing about me forever Promise that you'll sing about me for\\u2014 ooooh Promise that you'll sing about me forever Promise that you'll sing about me for\\u2014 ooooh Promise that you'll sing about me forever Promise that you'll sing about me for\\u2014 ooooh (On the phone) \\\"Ay, ay, ay, Where you 'bout to go?\\\" \\\"Nigga, the homie's brother-- nigga, right here, he gone, my nigga, he gone!\\\" \\\"Nigga-- they just killed the homie's brother, my nigga. We right here on the block, my nigga.\\\" \\\"Al- alright, nigga-- nigga just come-- alright, alright, just call me back, man, just call me back.\\\"   \\\"Arghh... Fuck! So what we gon' do, my niggas? What we gon' do?\\\" \\\"Bro, we can go back right now, my nigga. Like... nigga, I don't give a fuck, my nigga. We can go back right now\\\" \\\"Fuck! I'm tired of this shit! I'm tired of fuckin' runnin', I'm tired of this shit! My brother, homie!\\\" Tired of runnin', tired of huntin' My own kind, but retirin' nothin' Tires are steady screechin', the driver is rubbin' Hands on the wheel, who said we wasn't Dyin' of thirst, dyin' of thirst, dyin' of thirst? Dope on the corner, look at the coroner Daughter is dead, mother is mournin' her Stray bullets, AK bullets Resuscitation was waitin' patiently, but they couldn't Bring her back, who got the footage? Channel 9, cameras is lookin' It's hard to channel your energy when you know he crooked Banana clip, split his banana pudding I'm like Tre, that's Cuba Gooding I know I'm good at Dyin' of thirst, dyin' of thirst, dyin' of thirst How many sins? I'm runnin' out How many sins? I lost count Dreams of ballin' like Spalding But only shotty bounce The reaper callin', I'm cottonmouth Money is power (Money is power) Yours is ours (Yours is ours) Lay with a snitch, die with a coward Hope we get rich, hope we can tower Over the city with vanity with the music louder The same song, a black flower I'll show you how to Dye your thirst, dye your thirst, dye your thirst What are we doin'? Who are we foolin'? Hell is hot, fire is proven To burn for eternity, return of the student That never learned how to live righteous but how to shoot it Tired of runnin', choirs is hummin' Tell us to visit, we lie about comin' Now back to business, loadin' the guns in Back of the Buick, your hood is feudin' The beef is bubblin', it's no discussion Hereditary, all of my cousins Dyin' of thirst, dyin' of thirst, dyin' of thirst Too many sins, I'm runnin' out Somebody send me a well for the drought See all I know is takin' notes On takin' this life for granted, granted, if he provoke My best days, I stress days (Lord, forgive me for all my sins, for I not know\\u2014) My best days, I stress days Say \\\"fuck the world,\\\" my sex slave Money, pussy, and greed \\u2013 what's my next crave? Whatever it is, know it's my next grave Tired of runnin', tired of runnin', tired of tumblin' Tired of runnin', tired of tumblin' \\u2013 backwards My momma say \\\"See, a pastor give me a promise What if today was the rapture and you completely tarnished? The truth will set you free, so to me be completely honest You dyin' of thirst, you dyin' of thirst So hop in that water, and pray that it works.\\\" Fuck! I\\u2019m tired of this shit! I\\u2019m tired of fuckin' runnin', I\\u2019m tired of this shit! That\\u2019s my brother, homie! Young man, come talk to me! Is that what I think that is? I know that's not what I think that is Why are you so angry? See, you young men are dying of thirst Do you know what that means? That means you need water, holy water You need to be baptized, with the spirit of the Lord Do you want to receive God as your personal savior? Okay, repeat after me: \\\"Lord God, I come to You a sinner.\\\" (Lord God, I come to You a sinner) \\\"And I humbly repent for my sins.\\\" (And I humbly repent for my sins) \\\"I believe that Jesus is Lord.\\\" (I believe that Jesus is Lord) \\\"I believe you raised Him from the dead.\\\" (I believe you raised Him from the dead) \\\"I would ask that Jesus come into my life.\\\" (I would ask that Jesus come in my life) \\\"And be my Lord and Savior.\\\" (And be my Lord and Savior) \\\"I receive Jesus to take control of my life.\\\" (I receive Jesus to take control of my life) \\\"And that I may live for Him from this day forward.\\\" (And that I may live for Him from this day forward) \\\"Thank you, Lord Jesus For saving me with Your precious blood.\\\" (Thank you, Lord Jesus For saving me with Your precious blood) \\\"In Jesus name, amen.\\\" (In Jesus name, amen) Alright now, remember this day The start of a new life \\u2013 your REAL life  \"}", "Lil-wayne-mona-lisa": "\" I got a story to tell, you know that I cherish thee Hope it ain't too many feelings involved I see niggas in this bitch Stuntin', poppin' bottles Gettin' drunk with these bitches And when they leave they get followed Fall asleep with that bitch And really don't know much about her Then she let us in, we take all of your shit And when you wake up, she help you try to find it, I love it I be with bitches that be with bitches That be with niggas with riches I tell her, \\\"Get him,\\\" she say, \\\"I got you\\\" I say, \\\"No, bitch, I said get him\\\" And they so pretty, and they hair lengthy He hit it and sleep on her titties Then she give us the word, we come through with AKs It's a stick-up, she scream like a victim Now you feelin' so silly I smoke color purple, I'm up in here feelin' like Celie (Ooh) Nappy-ass dreads, what's that you say? Watch your mouth, Milli Vanilli (Ooh) You can get snaked, you can get faked Out by the bitch that you feelin' 'Cause you thought that she was an angel That bitch ain't no angel, I treat her halo like a frisbee And you tellin' your business, she tell me your business You tell that bitch what you feelin' All of the beans you be spillin' To you, she lie through her teeth cavities, fillin's She know where you hide to tell me where it's hidden She know when you're gone, tell me when to visit We break in your home and take the specifics And meanwhile, the bitch is on vacation with him So she don't get blamed, we don't snatch chains We find out addresses, and we don't leave messes You'll only know that it's gone when you check it Then your first thought is to start second guessin' She say, \\\"What's wrong?\\\" He say, \\\"Nothin', keep restin'\\\" She say, \\\"What's missin'?\\\", \\\"How you know somethin' missin'?\\\" He scratch his head, she say, \\\"Get back in bed\\\" And she gave him some head Boy, you can't trust them bitches, and then she say\\u2014ooh I see niggas in this bitch Stuntin', poppin' bottles Gettin' drunk with these bitches Then when they leave they get followed I be with bitches that know the bitches That's with the niggas we followin' Get them on the line, stay two cars behind And tell them hoes, \\\"Don't be so obvious!\\\" Mona Lisa, long hair, don't care She handle the business and don't ever tell She bite the bullet and cough up the shells She tell 'em, \\\"Ooh, daddy, let's go to your place!\\\" And if he say yeah, then we meet him there She feed him lies with his silverware She don't want love, she just want her share I know a bitch named Liz This nigga think she his 'cause she tell him that it is So he tell her all his secrets, he tell her all his fears And then she tell me and I be all ears And then I go and tell my people and they already know him And then I call Liz and she say he comin' over I say, \\\"Good girl, just remember what I told ya\\\" She gave me the salute, I say, \\\"Girl, you're a soldier\\\" We're waitin' outside, watch him pull up Walk up to the door and right before he knock She open the door naked, she left it unlocked They started French kissin' so he didn't see moi And then she let him in, they stopped on the couch Music up loud with his head in the clouds Turn that shit down and I scared the piss out of him Piss a nigga off, put a gun to his frown Nigga, turn around, I ain't here to fuck around I ain't here to fuck around, caught you wit' your pants down You know what it is, put your fuckin' hands up Liz, that's enough, you can put your hands down And then he looked dead at her and he shook his head at her She a good actress and you a dead actor You'll be dead after we get what we're after If Liz call you daddy, she about to be a bastard, oh I got way too many bitches that do anything for me, nigga But think for me, nigga Send her to you like she ain't for me, nigga I hope you alone like bankruptcy, nigga She pour you a drink, that drink on me, nigga She slip somethin' in it, now faint for me, nigga Mona Lisa, I done painted the picture Mo-Mona Lisa, out the frame on these niggas Pussy got you out of character, nigga You fall for these hoes off your ladder, my nigga Take everything that you have 'til you don't even have an opinion We have your attention And now you're lookin' down a barrel though, nigga Now she lookin' for her pantyhose, nigga We just lookin' for the casserole, nigga But she gon' show us where you stash it though, nigga (uh) Ah, every day she wake up with a different color makeup And a promise he gone take her to the movie and the mall Chillin' with the Laker, on the floor, fourth quarter Four minute on the clock, Black Mamba with the ball Paparazzi lookin' at 'em both poppin' up and take a picture, uh Probably on a Internet blog In a minute, he gon' be admittin' that he love her on his mother Man, he want to meet her mother by tomorrow Mona Lisa Pussy good enough, it got him sinnin' in the walls And he diggin' in it like he livin' in it Make a new religion with it, man a nigga 'bout to go against God Poetry in a pear tree Sweet tone like a hummingbird when she asked him Did he want to make love in a yellow taxi Never gave two fucks, jumped in the backseat Woke up in the morning to The Great Gatsby Then he dogged it again like the bitch Lassie I'm a dog in the wind, I'm a pit laughing I'ma call up again like I did last week Make good with the friend and I'm all jazzy Britney with the twin and the girl Ashley Found out that I fucked, he was unhappy Bitch, I never let the bullshit get past me Better yet, I wanna break up, don't you ask me 'Bout a motherfuckin' double standard, acting Fucking on another nigga, that's a negative alone But you sucked this dick, that's just nasty Matter of fact, bitch, gimme your phone! (No!) You fuckin' with Wayne's? (No!) Bitch, gimme your phone! (No!) Let me, let me take this call real quick (\\u2026 lick me like a lollipop) He on your fuckin' ringtone? Is that the shit that you do?   Touchin' yourself, lookin' at Kendrick videos Jump on the internet, watchin' his interviews I don't know what the fuck lately got into you Tell me who love you, I bet I love harder Forgot all the shit that I did for your daughter? The Pampers, the Pedialyte and my momma Daycare after school and she never did charge ya You scandalous as fuck and I hope you blow up You know what, I give up, let me go get my gun I got one in the chamber I'm plannin' on aimin' Goddammit, you know that the damage is done Bitch I'm emotional 'cause I'm in stress I'm not supposed to go through this, I guess So in conclusion, since you like rappers that's killin' that pussy I'm killin' myself She say, ooh, Daddy, ooh, Mona Lisa, Mona Lisa Ooh, fake smile, Mona Lisa, Mona Lisa She say, ooh, no emotion, Mona Lisa, Mona Lisa Now he get the picture, Mona Lisa, Mona Lisa, yeah  \"}", "Kanye-west-all-day": "\" All day, nigga Dance, ayy, ayy ayy ayy All day, nigga How long you niggas ball? All day, nigga How much time you spent at the mall? All day, nigga How many runners do you got on call? All day, nigga Swish, swish, how long they keep you in court? All day, nigga Take you to get this fly? All day, nigga Tell your P.O. how-how long you been high? All day, nigga You already know I\\u2019m straight from the Chi, all day, nigga South, south, south side! All day, nigga This Ye, nigga Shoppin' for the winter and it\\u2019s just May, nigga Ball so hard, man, this shit cray, nigga And you ain't gettin' money 'less you got eight figures For that Jesus piece, man, I've been saved, nigga Just talked to Farrakhan, that's sensei, nigga Told him I've been on ten since the 10th grade, nigga Got a middle finger longer than Dikembe, my nigga, uh I don't let 'em play with me I don't let 'em talk to me no kind of way Uh, they better watch what they say to me Niggas still gettin' popped on the day to day Yeah, I still got the hundred with the small face, nigga Might spend 50 racks on my off day, nigga You a fake Denzel like the Allstate nigga If you run into me, better have Allstate with yah You a Rico Suave nigga Ride 'round listen to Sade, nigga If you ain't with us, you in our way, nigga You an actor, you should be on Broadway, nigga 'Cause you do shit the broad way, nigga Your bitch got a ass, but my broad way thicker Late for the class, in the hallway, nigga Yeah, the dropout at it as always nigga, as always All day, nigga I took a young sweet breath, and I reached into my Earth Gave him what I had left At that moment I dispersed At that moment I dispersed All day, nigga How-h-how long you ball? All day, nigga How much time you spent at the mall? All day, nigga How long it take you to get this fly? All day, nigga Tell your P.O. how-how long you been high? All day, nigga Pour some Hen out for my niggas that died, all day, nigga And I keep a bad bitch on the passenger side, all day, nigga You already know I\\u2019m straight from the Chi, all day, nigga South, south, south side! All day, nigga I could do this all day, boy, I'm finna turn this bitch out They need that Ye in the streets, boy, there's been a mothafuckin' drought Don't really matter what I make, boy, you know I still go wild Like a light-skinned slave, boy, we in the mothafuckin' house! Right now, you lookin' real sus right now I swear I've been on this flight like a month right now Stupid niggas gettin' money, Forrest Gump right now Shout-out to Jackie Chan, I need to stunt right now They've been lookin' at the Gram, I've been lookin' at the Grammys Like, huh, that's us right now 24/7, 365 days, everybody gettin' paid Niggas lookin' at me like I'm worth both MJs People saying, \\\"Ye, Ye, take it easy\\\" 20 Gs for the Yeezys off of eBay Niggas do the most and they ain't done shit Only way I can sum it up, sumbitch (Hands up, hands up, hands up) Hands up, hands up, hands up So won't you dance? ayy, ayy ayy ayy (All day, nigga) I took a young sweet breath, and I reached into my Earth Gave him what I had left At that moment I dispersed At that moment I dispersed Get low, alright Get low, alright What up? Alright, alright Stay low, alright Stay low, alright Stay low, alright South, south, south side! All day, nigga Whistling Well, well, well, let me run (let me run) Let me run to see who came undone You've been right in my face Let me run 'til you're off my case Whooooa, whooooa Whooooa, whooooa Whooooa, whooooa Whooooa, whooooa \"}", "Kendrick-lamar-the-heart-part-4": "\" Don't tell a lie on me I won\\u2019t tell the truth 'bout you Don't tell a lie on me I won\\u2019t tell the truth 'bout you Thirty millions later, my future favors The legendary status of a hip-hop rhyme savior Travel 'round the atlas in this spaceship Candy-coated, my day shift's Been devoted to fuckin' up bundles of paper Pi equals three-fourteen The devil's pie is big enough to justify the whole thing Wait up, lampin' in Jamaica The clouds turnin', my thoughts turnin\\u2019 Burnin\\u2019 castor oil, yo I been determined to make an earnin' This seed in this soil is classified I\\u2019m satisfied when I strategize my kid's future I ain't sanctified enough to say that I won't shoot ya I done vandalized the industry full circuit The earthiest slash thirstiest nigga you know versus this Scum of a land that transcend two surfaces The richer the poorer, the bigger the picture The more blood pours, but\\u2014 Don\\u2019t tell a lie on me I won't tell the truth 'bout you Don't tell a lie on me I won't tell the truth 'bout you My fans can't wait for me to son ya punk-ass And crush ya whole lil' shit I'll Big Pun ya punk-ass, you a scared lil' bitch Tiptoein' around my name, nigga, you lame And when I get at you, homie Don't you just tell me you was just playin' Oh, I was just playin', K-Dot C'mon, you know a nigga rock with you, bro Shut the fuck up, you sound like the last nigga I know Might end up like the last nigga I know Oh, you don't wanna clash? Nigga, I know I put my foot on the gas, head on the floor Hoppin' out before the vehicle crash, I'm on a roll Yellin', \\\"One, two, three, four, five I am the greatest rapper alive\\\" So damn great, motherfucker, I've died What you hearin' now is a paranormal vibe House on the hill, house on the beach, nigga (facts) A condo in Compton, I'm still in reach, nigga (facts) I'm fresh out the water, I'm 'bout to breach, nigga The five-foot giant woke up out of his sleep, nigga Oh yeah, oh yeah, mo' cars, mo' lears Mo' bars, no peers, no scars, no fear\\u2014fuck y'all, sincere I heard the whispers, I curved the whispers You know what the risk is Earthed in ditches, your body revertin' to stiffness The whole world gone mad Bodies is addin' up, market's about to crash Niggas is fake rich, bitches is fake bad Blacks that act white, whites that do the dab Donald Trump is a chump Know how we feel, punk\\u2014tell him that God comin' And Russia need a replay button, y'all up to somethin' Electorial votes look like memorial votes But America's truth ain't ignorin' the votes It's blasphemy, how many gon' blast for me? I prophesized on my last song, you laughed at me But when the shit get brackin', don't you ask for me How many leaders gon' tell you the truth after me? G Malone, big bro, kudos to him I was two O's from a M, tryna be big as Em Thirty millions later, my future favors The legendary status of a hip-hop rhyme savior Salmon and capers, fame and lawsuits You lookin' at me in Chucks, I'm lookin' at y'all suits Me and Top Dawg playin' rock-paper-scissors in court A real hustler lose money just to go get some more I said it's like that, dropped one classic, came right back 'Nother classic, right back My next album, the whole industry on a ice pack With TOC, you see the flames In my E-Y-E's\\u2014it's not a game And the whole world is goin' mad, daddy, it's sad, daddy My only advice? Go and get you a bag, daddy Lee Baca on trial tryna portray a boxer Beatin' up on my niggas while the CO's watch him Tables turned, lesson learned, my best look You jumped sides on me, now you 'bout to meet Westbrook Go celebrate with your team and let victory vouch you Just know, the next game played I might slap the shit out you Technical foul, I'm flagrant, I'm foul They throwin' me out, you throw in the towel Look at the crowd, they\\u2014 (Naw, I don't like that) Look at my smile, I'm smirkin' Calm but urgent (That ain't the style, fuck!) So many verses, you live in denial (Fuck!) So many verses, I never run out (What?) You makin' him nervous, the music is loud Ho, JAY-Z Hall of Fame, sit yo punk-ass down! (Sit yo punk-ass down) So that means you ain't bigger than rapping (What else?) So that means no more playin' the back scenes (What else?) My spot is solidified if you ask me (What else?) My name is identified as \\\"That King\\\" I'll let y'all worry about a list, I'm on some other shit A difference between accomplishments and astonishments You know what time it is, ante up, this is in forever Y'all got 'til April the 7th to get y'all shit together Let's get it! Look, look! On foenem  \"}", "Ti-memories-back-then": "\" Ayy, in my apartment a long time ago I knew a bad bitch, but she was kinda slow Still gave it up when it's a few of us She let me finger-fuck her on the school bus We used to cut school with her and run train She wanted to hang with us, we wanted one thang Just penetratin' that throat, dawg She choked on it like smoke, dawg But whenever I fucked up my re-up In a dice game I go see her She'll give me enough to buy a quarter ounce And then blow a blunt of that reefer She used to buy a nigga new sneakers Pay the bill on my beeper Just so she can page to put a \\\"69\\\" And I know it time to go freak her Then one day I just asked her \\\"Why you always give your ass up? I mean, damn, these hoes get paid All you do is get laid\\u2014this shit don't add up.\\\" She said, \\\"Tip, all I wanna do is feel love Even if I know it ain't real love Even if I know a nigga only finna hit it And then never call back, I still fuck.\\\" And that's fucked up, but she so trill I need somethin', she go steal When the trap hot and police ride Nigga, guess where we go chill? For 'bout four years she held dope And my four pounds 'til it go down I remember shawty, she stayed down I won't say her name \\u2018cause she married now When the lights go out And I'm in my bed I think of all the madness in my head All of the things that I did back then When I'm in my bed I think of all the memories I've had All of the things I did back then She would always turn heads when she'd fall through She would always make moves how a boss do And she never gave any nigga time of day But she the chick all the niggas tried to talk to But when it came to me, she had a thing for me When we kicked it she roll up the weed for me And we'd both cut class post up in the cut steady Watchin' just to see if the police comin' We got close over time, her and I Right around the time that I first got signed Come to think about it I was 'bout 17 I ain't even have a license, couldn't even drive I was goin' back and forth with each flight Another show after show, each night She became so suspicious of these other bitches She'd go through my phone and we'd fight Talk about torn between the two Wasn't really much more that we could do Wasn't really much space for us But she stayed down with every tour she seen me do But I guess one night I had a few Huh, one night I had a few Yeah, this little chick that caught my eye I told her: \\\"Hurry up, meet me at the room!\\\" And no, I didn't have a contraceptive What my common sense neglected And two months later, next thing I know I got a text that said \\\"I'm pregnant\\\" And you can almost bet she kept it And that's the reason why you left me On top of all that, it wasn't even mine I went and got paternity tested\\u2014damn! When the lights go out And I'm in my bed I think of all the madness in my head All of the things that I did back then When I'm in my bed I think of all the memories I've had All of the things I did back then Wait, hol' up, is that you? With them big ol' thighs after school? Jay 305 had gave me high five When I said I\\u2019m in hot pursuit You said I won\\u2019t ride until Kendrick drive A new Monte Carlo that cruise And that shot my pride, I tried to improv But no freestyle I never do You lookin' for the nigga with the tallest 'fetti You overlookin' every nigga that ain\\u2019t quite ready To make it rain on you like I'm about to break a levee Hol' up, that pussy petty Yeah, your nails did, your hair did Your cell phone is selfish It only got numbers that come with a Hummer Her new prima donna I smelt it Tried to make you mine, ho! Tried to make some time, ho! But I ain\\u2019t got the time or the patience To stop and wait in line, ho! Her dreams holds Versace She fall for Armani Only deal with rich niggas\\u2014fuck you and Mick Romney! I\\u2019m grown now, I\\u2019m on my own now I\\u2019m po-o-o-oppin' Change my phone now when I get home now I got o-o-o-options Fast forward, wait, is that you? With them big ol' thighs after school? And your three kids and three baby daddies Same car note that\\u2019s overdue? I know When the lights go out And I'm in my bed I think of all the madness in my head All of the things that I did back then When I'm in my bed I think of all the memories I've had All of the things I did back then  \"}", "Kendrick-lamar-mortal-man": "\" Ohhh, ohhhh, woahhh Uh, yeah Uh, yeah Uh Yeah, uh The ghost of Mandela, hope my flows stay propellin' Let these words be your Earth and moon, you consume every message As I lead this army, make room for mistakes and depression And with that being said, my nigga, let me ask this question: When shit hit the fan, is you still a fan? When shit hit the fan\\u2014 (one two, one two) When shit hit the fan, is you still a fan? When shit hit the fan, is you still a fan? The ghost of Mandela, hope my flows stay propellin' Let these words be your Earth and moon, you consume every message As I lead this army, make room for mistakes and depression And with that being said, my nigga, let me ask this question: When shit hit the fan, is you still a fan? When shit hit the fan, is you still a fan? Won't you look to your left and right? Make sure you ask your friends When shit hit the fan, is you still a fan? Do you believe in me? Are you deceiving me? Could I let you down easily, is your heart where it need to be? Is your smile on permanent? Is your vow on lifetime? Would you know where the sermon is if I died in this next line? If I\\u2019m tried in a court of law, if the industry cut me off If the government want me dead, plant cocaine in my car Would you judge me a drug-head or see me as K. Lamar? Or question my character and degrade me on every blog? Want you to love me like Nelson, want you to hug me like Nelson I freed you from being a slave in your mind, you\\u2019re very welcome You tell me my song is more than a song, it\\u2019s surely a blessing But a prophet ain\\u2019t a prophet til they ask you this question: When shit hit the fan, is you still a fan? When shit hit the fan, is you still a fan? Won't you look to your left and right? Make sure you ask your friends When shit hit the fan, is you still a fan? The ghost of Mandela, hope my flows stay propellin' Let my words be your Earth and moon, you consume every message As I lead this army, make room for mistakes and depression And with that\\u2014 Do you believe in me? How much you believe in her? You think she gon\\u2019 stick around if them 25 years occur? You think he can hold you down when you down behind bars, hurt? You think y\\u2019all on common ground if you promise to be the first? Can you be immortalized without your life being expired? Even though you share the same blood, is it worth the time? Like, who got your best interest? Like ,how much are you dependent? How clutch are the people that say they love you? And who pretending? How tough is your skin when they turn you in? Do you show forgiveness? What brush do you bend when dusting your shoulders from being offended? What kind of den did they put you in when the lions start hissing? What kind of bridge did they burn? Revenge or your mind when it\\u2019s mentioned You wanna love like Nelson, you wanna be like Nelson You wanna walk in his shoes, but your peacemaking seldom You wanna be remembered that delivered the message That considered the blessing of everyone This your lesson for everyone, say; When shit hit the fan, is you still a fan? When shit hit the fan, is you still a fan? Won't you look to your left and right? Make sure you ask your friends When shit hit the fan, is you still a fan? The voice of Mandela, hope this flow stay propellin' Let my word be your Earth and moon, you consume every message As I lead this army, make room for mistakes and depression And if you riding with me, nigga\\u2014 I been wrote off before, I got abandonment issues I hold grudges like bad judges, don\\u2019t let me resent you That\\u2019s not Nelson-like\\u2014want you to love me like Nelson I went to Robben\\u2019s Island analysing; that\\u2019s where his cell is So I could find clarity\\u2014like, how much you cherish me? Is this relationship a fake, or real as the heavens be? See I got to question it all; family, friends, fans, cats, dogs Trees, plants, grass, how the wind blow, Murphy\\u2019s Law Generation X\\u2014will I ever be your ex? Flaws of a baby step', mauled by the mouth a bit\\u2014pause Put me under stress, crawled under rocks, duckin' y\\u2019all It\\u2019s respect\\u2014but then tomorrow, put my back against the wall How many leaders you said you needed then left \\u2018em for dead? Is it Moses? Is it Huey Newton or Detroit Red? Is it Martin Luther? JFK? Shooter\\u2014you assassin Is it Jackie? Is it Jesse? Oh, I know it\\u2019s Michael Jackson\\u2014oh When shit hit the fan, is you still a fan? When shit hit the fan, is you still a fan? That nigga gave us \\\"Billie Jean,\\\" you say he touched those kids? When shit hit the fan, is you still a fan? The ghost of Mandela, hope my flows stay propelling Let my word be your Earth and moon, you consume every message As I lead this army, make room for mistakes and depression And if you riding with me, nigga, let me ask this question, nigga \\\"I remember you was conflicted Misusing your influence Sometimes I did the same Abusing my power, full of resentment Resentment that turned into a deep depression Found myself screaming in the hotel room I didn\\u2019t wanna self destruct The evils of Lucy was all around me So I went running for answers Until I came home But that didn\\u2019t stop survivor\\u2019s guilt Going back and forth trying to convince myself the stripes I earned Or maybe how A-1 my foundation was But while my loved ones was fighting the continuous war back in the city I was entering a new one A war that was based on apartheid and discrimination Made me wanna go back to the city and tell the homies what I learned The word was respect Just because you wore a different gang color than mine's Doesn\\u2019t mean I can\\u2019t respect you as a black man Forgetting all the pain and hurt we caused each other in these streets If I respect you, we unify and stop the enemy from killing us But I don\\u2019t know, I\\u2019m no mortal man Maybe I\\u2019m just another nigga\\u201d Shit and that\\u2019s all I wrote I was gonna call it \\\"Another Nigga\\\" but, it ain\\u2019t really a poem I just felt like it\\u2019s something you probably could relate to Other than that, now that I finally got a chance to holla at you I always wanted to ask you about a certain situa- About a metaphor actually, uh, you spoke on the ground What you mean by that, what the ground represent?  The ground is gonna open up and swallow the evil Right That\\u2019s how I see it, my word is bond I see\\u2014and the ground is the symbol for the poor people Right The poor people is gonna open up this whole world And swallow up the rich people 'Cause the rich people gonna be so fat And they gonna be so appetizing, you know what I\\u2019m saying Wealthy, appetizing The poor gonna be so poor, and hungry Right You know what I\\u2019m saying, it\\u2019s gonna be like You know what I'm saying, it's gonna be... There might, there might be some cannibalism out this muh-fu- They might eat the rich, you know what I'm saying?  Aight so let me ask you this then Do you see yourself as somebody that\\u2019s rich Or somebody that made the best of they own opportunities?  I see myself as a natural born hustler A true hustler in every sense of the word I took nothin\\u2019, I took the opportunities I worked at the most menial and degrading job And built myself up so I could get it to where I owned it I went from having somebody managing me To me hiring the person that works my management company I changed everything, I realized my destiny In a matter of five years, you know what I\\u2019m saying? I made myself a millionaire, I made millions for a lot of people Now it\\u2019s time to make millions for myself, you know what I\\u2019m saying? I made millions for the record companies I made millions for these movie companies Now I make millions for, for us  And through your different avenues of success How would you say you managed to keep a level of sanity?  By my faith in God, by my faith in the game And by my faith in \\\"all good things come to those that stay true\\\" Right You know what I\\u2019m saying? And it was happening to me for a reason You know what I\\u2019m saying, I was noticing, shit I was punching the right buttons and it was happening So it\\u2019s no problem, you know I mean, it\\u2019s a problem but I\\u2019m not finna let them know I\\u2019m finna go straight through  Would you consider yourself a fighter at heart or somebody that Somebody that only reacts when they back is against the wall?  Shit, I like to think that at every opportunity I\\u2019ve ever been, uh Threatened with resistance, it\\u2019s been met with resistance And not only me but, it goes down my family tree You know what I\\u2019m saying, it\\u2019s in my veins to fight back  Aight well, how long will you think it take before niggas be like \\\"We fighting a war, I\\u2019m fighting a war I can\\u2019t win And I wanna lay it all down\\\"  In this country, a black man only have like 5 years we can exhibit maximum strength And that\\u2019s right now while you a teenager, while you still strong While you still wanna lift weights, while you still wanna shoot back 'Cause once you turn 30 it\\u2019s like They take the heart and soul out of a man Out of a black man, in this country And you don\\u2019t wanna fight no more And if you don\\u2019t believe me, you can look around You don\\u2019t see no loud mouth 30-year old motherfuckers  That\\u2019s crazy, because me being one of your offsprings Of the legacy you left behind, I can truly tell you that There\\u2019s nothing but turmoil goin\\u2019 on so, I wanted to ask you What you think is the future for me and my generation today?  I think that niggas is tired of grabbin' shit out the stores And next time it's a riot it's gonna be like, uh, bloodshed For real, I don\\u2019t think America know that I think America think we was just playing And it\\u2019s gonna be some more playing but It ain\\u2019t gonna be no playing It\\u2019s gonna be murder, you know what I\\u2019m saying? It\\u2019s gonna be like Nat Turner, 1831, up in this motherfucker You know what I\\u2019m saying, it\\u2019s gonna happen  That\\u2019s crazy man, in my opinion Only hope that we kinda have left is music and vibrations Lot a people don\\u2019t understand how important it is, you know Sometimes I can like, get behind a mic And I don\\u2019t know what type of energy I\\u2019ma push out Or where it comes from, trip me out sometimes  Because it's spirits, we ain\\u2019t even really rappin\\u2019 We just letting our dead homies tell stories for us Damn  I wanted to read one last thing to you It\\u2019s actually something a good friend had wrote Describing my world, it says: \\u201cThe caterpillar is a prisoner to the streets that conceived it Its only job is to eat or consume everything around it In order to protect itself from this mad city While consuming its environment The caterpillar begins to notice ways to survive One thing it noticed is how much the world shuns him But praises the butterfly The butterfly represents the talent, the thoughtfulness And the beauty within the caterpillar But having a harsh outlook on life The caterpillar sees the butterfly as weak And figures out a way to pimp it to his own benefits Already surrounded by this mad city The caterpillar goes to work on the cocoon Which institutionalizes him He can no longer see past his own thoughts He\\u2019s trapped When trapped inside these walls certain ideas take root, such as Going home, and bringing back new concepts to this mad city The result? Wings begin to emerge, breaking the cycle of feeling stagnant Finally free, the butterfly sheds light on situations That the caterpillar never considered, ending the internal struggle Although the butterfly and caterpillar are completely different They are one and the same\\\" What\\u2019s your perspective on that? Pac? Pac? Pac?! \"}", "Kendrick-lamar-the-art-of-peer-pressure": "\" Everybody, everybody, everybody Everybody sit yo bitch-ass down And listen to this true mothafuckin' story Told by Kendrick Lamar on Rosecrans, ya bitch Smokin' on the finest dope, ay-ay-ay-ah Drank until I can't no mo', ay-ay-ay-ah Really I'm a sober soul But I'm with the homies right now And we ain't askin' for no favors Rush a nigga quick, then laugh about it later, ay-ay-ay-ah Really, I'm a peacemaker But I'm with the homies right now And Momma used to say (Say, say, say, say) One day it's gon' burn you out (Woo) One day it's gon' burn you out, out, out One day it's gon' burn you out (You, you, you, you, you, you) One day it's gon' burn you But I'm with the homies right now Me and my niggas four deep in a white Toyota A quarter tank of gas, one pistol and orange soda Janky stash box when the federales'll roll up Basketball shorts with the Gonzales Park odor We on the mission for bad bitches and trouble I hope the universe love you today 'Cause the energy we bringin' sure to carry away A flock of positive activists that fill they body with hate If it's necessary; bumpin' Jeezy first album, lookin' distracted Speakin' language only we know, you think it's an accent The windows roll down, all I see is a hand pass it Hotboxin' like George Foreman grillin' the masses Of the workin' world; we pulled up on a bunch of workin' girls And asked them what they workin' with Look at me, I got the blunt in my mouth Usually I'm drug-free, but, shit, I'm with the homies Yeah, nigga, we off a pill and Remy Red Come through and bust ya head, nigga! Me and the homies Sag all the way to the liquor store Where my niggas pour up 4 and get twisted some more Me and the homies I ride for my mothafuckin' niggas Hop out, do my stuff, then hop back in Me and the homies Matter of fact, I hop out that mothafucka And be like \\\"doo-doo-doo-doot, doo-doo-doo-doo-doot!\\u201d It's 2:30 and the sun is beamin' Air conditioner broke and I hear my stomach screamin' Hungry for anything unhealthy And if nutrition can help me I'll tell you to suck my dick, then I'll continue eatin' We speedin' on the 405, passin' Westchester You know, the light-skinned girls in all the little dresses Good Lord, they knew we weren't from 'round there 'Cause every time we down there We pullin' out the Boost Mobile SIM cards Bougie bitches with no extensions Hood niggas with bad intentions, the perfect combination Before we sparked a conversation We seen three niggas in colors we didn't like Then started interrogatin' I never was a gangbanger, I mean I never was stranger to the fonk neither, I really doubt it Rush a nigga quick and then we laugh about it That's ironic, 'cause I've never been violent Until I'm with the homies (Just ridin', just ridin') Me and the homies (Bullshittin', actin' a fool) Me and the homies (Trippin', really trippin') Me and the homies (Just ridin', just ridin', just ridin') Braggin' 'bout the episode we just had A shot of Hennessy didn't make me feel that bad I'm usually a true firm believer of bad karma Consequences from evil will make your past haunt ya We tryna conquer the city with disobedience Quick to turn it up, even if we ain't got the CD in But Jeezy still playin' And our attitude is still \\\"nigga, what is you sayin'?\\\" Pull in front of the house That we been campin' out for like two months The sun is goin' down as we take whatever we want Ayy, ayy, nigga, jackpot, nigga, pop the safe! Ayy, nigga, I think there's somebody in this room! Wait, what?! Nigga, there's somebody in this room! I hit the back window in search of any Nintendo DVD's, plasma-screen TV's in the trunk We made a right, then made a left, then made a right Then made a left, we was just circlin' life My mama called: \\\"Hello? What you doin'?\\\" \\u2014 \\\"Kickin' it.\\\" I shoulda told her I'm probably 'bout to catch my first offense With the homies But \\u2013 they made a right, then made a left Then made a right, then another right One lucky night with the homies K. Dot, you faded, hood? Yeah, we finally got that nigga faded I think he hit the wrong blunt though Ooh, which one? Well, which one he talkin' about? I was finna hit the one with the shenanigans in it I pray he ain't hit that Nah, that nigga straight, he ain't hit that one Got the shenanigans? Give that nigga the shenanigans! Nigga, I think we should push back to the city, fo' real doe Nigga, for what? What that nigga\\u2014 what's that Jeezy song say, nigga? \\\"Last time I checked I was the man on these streets!\\\" Yeah, yeah, that shit right there I'm tryna be the nigga in the street There he go. Man, you don't even know how the shit go Look, here's the plan, luv We gon' use the kickback as a alibi, wait 'til the sun go down, roll out, complete the mission, drop K. Dot off at his mama van, at the park 'Cause I know he tryna fuck on Sherane tonight That's what he's not gon' do Then we all gon' meet back at the block at about 10:30 That's straight, but we should meet up around 12 I'm tryna fuck on somethin' too Nigga, sit yo dumb-ass back down! Nigga, you ain't doin' shit tonight! Matter of fact, nigga, get in the mothafuckin' car! We finna get active! \"}", "Kendrick-lamar-wesleys-theory": "\" Every nigga is a star, ayy, every nigga is a star Every nigga is a star, ayy, every nigga is a star Every nigga is a star, ayy Who will deny that you and I and every nigga is a star? Hit me! When the four corners of this cocoon collide You\\u2019ll slip through the cracks hopin' that you\\u2019ll survive Gather your weight, take a deep look inside Are you really who they idolize? To pimp a butterfly At first, I did love you But now I just wanna fuck Late nights thinkin' of you Until I get my nut Tossed and turned, lesson learned You was my first girlfriend Bridges burned, all across the board Destroyed, but what for? When I get signed, homie, I'ma act a fool Hit the dance floor, strobe lights in the room Snatch your little secretary bitch for the homies Blue-eyed devil with a fat-ass monkey I'ma buy a brand new Caddy on vogues Trunk the hood up, two times, deuce-four Platinum on everythin', platinum on weddin' ring Married to the game and a bad bitch chose When I get signed, homie, I'ma buy a strap Straight from the CIA, set it on my lap Take a few M-16s to the hood Pass 'em all out on the block, what's good? I'ma put the Compton swap meet by the White House Republican run up, get socked out Hit the prez with a Cuban link on my neck Uneducated, but I got a million-dollar check like that We should never gave We should never gave niggas money Go back home, money, go back home We should never gave We should never gave niggas money Go back home, money, go back home (Everybody get out) At first, I did love you (Love you) But now I just wanna fuck (I just wanna fuck) Late nights thinkin' of you (Of you) Until I get my nut ('Til I get my nut) Tossed and turned, lesson learned You was my first girlfriend Bridges burned, all across the board (Across the board) Destroyed, but what for? Yo, what's up? It's Dre Remember the first time you came out to the house? You said you wanted a spot like mine But remember, anybody can get it The hard part is keepin' it, motherfucker What you want you? A house or a car? Forty acres and a mule, a piano, a guitar? Anythin', see, my name is Uncle Sam, I'm your dog Motherfucker, you can live at the mall I know your kind (That's why I'm kind) Don't have receipts (Oh, man, that's fine) Pay me later, wear those gators Clich\\u00e9? Then say, \\\"Fuck your haters\\\" I can see the baller in you, I can see the dollar in you Little white lies, but it's no white-collar in you But it's whatever though because I'm still followin' you Because you make me live forever, baby Count it all together, baby Then hit the register and make me feel better, baby Your horoscope is a gemini, two sides So you better cop everything two times Two coupes, two chains, two C-notes Too much ain't enough, both we know Christmas, tell 'em what's on your wish list Get it all, you deserve it, Kendrick And when you hit the White House, do you But remember, you ain't pass economics in school And everything you buy, taxes will deny I'll Wesley Snipe your ass before thirty-five Yeah, lookin' down, it's quite a drop (It's quite a drop, drop, drop) Lookin' good when you're on top (When you're on top, you got it) You got a medal for us Leavin' metaphors metaphysically in a state of euphoria Look both ways before you cross my mind We should never gave We should never gave niggas money Go back home, money, go back home We should never gave We should never gave niggas money Go back home, money, go back home Tax man comin', tax man comin' Tax man comin', tax man comin' Tax man comin', tax man comin' Tax man comin', tax man comin'  \"}", "Kendrick-lamar-duckworth": "\" It was always me vs the world Until I found it's me vs me Why, why, why, why? Why, why, why, why? Just remember, what happens on Earth stays on Earth! We gon' put it in reverse Darling, I told you many times And I am telling you once again Just to remind you, sweetheart That my\\u2014 Oh, Lamar Hail Mary and marijuana, times is hard Pray with the hooligans, shadows all in the dark Fellowship with demons and relatives, I'm a star Life is one funny mothafucka A true comedian, you gotta love him, you gotta trust him I might be buggin', infomercials and no sleep Introverted by my thoughts; children, listen, it gets deep See, once upon a time inside the Nickerson Garden projects The object was to process and digest poverty's dialect Adaptation inevitable: gun violence, crack spot Federal policies raid buildings and drug professionals Anthony was the oldest of seven Well-respected, calm and collected Laughin' and jokin' made life easier; hard times, mama on crack A four-year-old tellin' his nanny he needed her His family history: pimpin' and bangin' He was meant to be dangerous Clocked him a grip and start slangin' Fifteen, scrapin' up his jeans with quarter pieces Even got some head from a smoker last weekend Dodged a policeman, workin' for his big homie Small-time hustler, graduated to a brick on him 10,000 dollars out of a project housing, that's on the daily Seen his first mil twenty years old, had a couple of babies Had a couple of shooters Caught a murder case, fingerprints on the gun they assumin' But witnesses couldn't prove it That was back when he turned his back and they killed his cousin He beat the case and went back to hustlin' Bird-shufflin', Anthony rang The first in the projects with the two-tone Mustang That 5.0 thing, they say 5-0 came Circlin' parking lots and parking spots And hoppin' out while harrassin' the corner blocks Crooked cops told Anthony he should kick it He brushed 'em off and walked back to the Kentucky Fried Chicken See, at this chicken spot There was a light-skinned nigga that talked a lot With a curly top and a gap in his teeth He worked the window, his name was Ducky He came from the streets, the Robert Taylor Homes Southside Projects, Chiraq, the Terror Dome Drove to California with a woman on him and 500 dollars They had a son, hopin' that he'd see college Hustlin' on the side with a nine-to-five to freak it Cadillac Seville, he'd ride his son around on weekends Three-piece special with his name on the shirt pocket 'Cross the street from the projects, Anthony planned to rob it Stuck up the place before, back in '84 That's when affiliation was really eight gears of war So many relatives tellin' us, sellin' us devilish works Killin' us, crime, intelligent, felonious Prevalent proposition with 9's Ducky was well-aware They robbed the manager and shot a customer last year He figured he'd get on these niggas' good sides Free chicken every time Anthony posted in line Two extra biscuits, Anthony liked him and then let him slide They didn't kill him; in fact, it look like they're the last to survive Pay attention, that one decision changed both of they lives One curse at a time Reverse the manifest and good karma, and I'll tell you why You take two strangers and put 'em in random predicaments Give 'em a soul so they can make their own choices and live with it Twenty years later, them same strangers, you make 'em meet again Inside recording studios where they reapin' their benefits Then you start remindin' them about that chicken incident Whoever thought the greatest rapper would be from coincidence? Because if Anthony killed Ducky, Top Dawg could be servin' life While I grew up without a father and die in a gunfight So, I was takin' a walk the other day\\u2026  \"}", "Kendrick-lamar-black-friday": "\" Dick hard like rottweiler Can you handle it? Can you handle it? Woo woo, woo woo The whole industry been in shambles Everybody fugazi, I\\u2019m just changing the channel Kendrick Lamar, the people\\u2019s champion, I'm animal for analysts Career damaging verses, meditating with candles lit I like my raps extra prolific Since freestyling on lunch tables and park benches And I won\\u2019t mention my 10,000 hours in training While juggling, gang-banging, my balancing was tremendous And now we look at the competition as quick submission They tappin\\u2019 out before we even get a chance to miss \\u2018em What this about, is it money or skill? Maybe it\\u2019s both and I got large amounts of it, it\\u2019s real You see my oath is very unbreakable, my style is never mistakable I can see y\\u2019all incapable To be the God emcees, you know me well Ridiculous, venomous, hate in my heart, the sinister Run for cover, my lineage prove itself I\\u2019m rollin\\u2019 deep in that paper like two Adeles Before scholars, I flowed tighter than virgin lips We here to shake the game up and you're flying through turbulence Everything is high stakes nowadays, that\\u2019s how it played nowadays It\\u2019s like an 8-ball to the face nowadays I'm laced nowadays, my gun is off the waist nowadays It\\u2019s seven figures and retainer for the case nowadays, I'm talking Higher power, every other hour since Eddie Bauer Since stash boxes and lead showers, breaking the padlock And the dead coward dying a thousand deaths, entire lion Surround itself with bears, watch it nigga, you share a profit, ah! This is what they want, I\\u2019m the one This is vintage from 1980 somethin' I\\u2019m the son of the pioneer that got you near the sun Play with him, bitch you better off voting for Donald Trump I\\u2019m yelling Mr. Kanye West for president He probably let me get some head inside the residence I\\u2019m in the White House going all out Bumping College Dropout, God bless Americans Nothing more influential than rap music I merge jazz fusion with the trap music I mix black soul with some rock and roll They never box me in, I\\u2019m David Blaine-ing all you hoes Oh yea, let\\u2019s go there, my DNA is DMT, I\\u2019m so rare My Juvenile was wilder than the Nolia A locomotive couldn\\u2019t track me down in my career Runnin\\u2019 this shit with four pair, son of my bitch, I might demolish A bitch right in front ya, chico, what have you done here? D-Bo, all of it one year, Mississippi to California It gets annoying, niggas wanna deplore him And bitches wanna adore him, but industry shit ain\\u2019t for him Probably thinking it\\u2019s for him, only one me Swallowed the key and kicking the door in, never leasing my foreign Mr. Valevictorian studied the game before them Listen to you with boredom, baby rappers, abort them To the grave I deport them, corporations extort them I\\u2019m snapping off my endorphins, I alien mighty morphin\\u2019 My radiance rather gorgeous, hundred bill to the doorman Hundred mil' in my fortune, they call me back in the morning You're racing against the tortoise, pace myself it\\u2019s important Lace myself with the wisdom my playerism enormous So pay the man for performance, saucy all of my garments Jimi Kendrix performing, this fucking studio haunted (Ah!) I tell a bitch don\\u2019t sweat me (Don't sweat me) I kill this whole fuckin\\u2019 beat if Cole let me (Please Cole) Ib should\\u2019ve never sent the instrumental Every time I start writing I get sentimental This shit is just not fair But why the fuck should I care? The story of your life here Two young stars was born and y\\u2019all gon\\u2019 die here Oh Lord, gotta be the yams Billboard list need 2Pac, damn But number 9 makes sure he lives on, yeah Hoochie, coochie, pussies in a trance Every day a celebration, but even the valley peaking me Is not validation, nigga this TDE And my doggies be salivating, salaries, better ratings And casualties all around me, don\\u2019t make me do demonstrations Whoa Murder my allegations and burning my finger traces Adjourning my power patience and earning royalty payments I\\u2019m sorry y\\u2019all not relating, this party is reservated I kill this whole muthafucking beat if J. Cole say it My nigga Ib chopped the instrumental, I gotta slay it I gotta lay it, gotta show you fuckers I\\u2019m not to play with The ruckus had been my favorite, King Kunta the fuckin\\u2019 greatest Whoa Burnin\\u2019 my leather- (Nah I\\u2019m just fuckin\\u2019 wit cha) \"}", "Sia-the-greatest": "\" Uh-oh, runnin' out of breath, but I Oh, I, I got stamina Uh-oh, running now, I close my eyes Well, oh, I got stamina And uh-oh, I see another mountain to climb But I, I, I got stamina Uh-oh, I need another lover, be mine Cause I, I, I got stamina Don't give up, I won't give up Don't give up, no no no Don't give up, I won't give up Don't give up, no no no I'm free to be the greatest, I'm alive I'm free to be the greatest here tonight, the greatest The greatest, the greatest alive The greatest, the greatest alive Well, uh-oh, runnin' out of breath, but I Oh, I, I got stamina Uh-oh, runnin' now, I close my eyes But, oh, I got stamina And oh yeah, runnin' through the waves of love But I, I got stamina And oh yeah, I'm runnin' and I've just enough And uh-oh, I got stamina Don't give up, I won't give up Don't give up, no no no Don't give up, I won't give up Don't give up, no no no I'm free to be the greatest, I'm alive I'm free to be the greatest here tonight, the greatest The greatest, the greatest alive The greatest, the greatest alive Oh-oh, I got stamina Oh-oh, I got stamina Oh-oh, I got stamina Oh-oh, I got stamina Ayy, I am the truth Ayy, I am the wisdom of the fallen; I'm the youth Ayy, I am the greatest Ayy, this is the proof Ayy, I work hard, pray hard, pay dues, ayy I transform with pressure, I'm hands-on with effort I fell twice before, my bounce back was special Letdowns'll get you, and the critics'll test you But the strong'll survive, another scar may bless you, ah Don't give up (no no), I won't give up (no no) Don't give up, no no no (nah) Don't give up, I won't give up Don't give up, no no no I'm free to be the greatest, I'm alive I'm free to be the greatest here tonight, the greatest The greatest, the greatest alive (Don't give up, don't give up, don't give up, no no no) The greatest, the greatest alive (Don't give up, don't give up, don't give up, no no no) The greatest, the greatest alive (Don't give up, don't give up, don't give up; I got stamina) The greatest, the greatest alive (Don't give up, don't give up, don't give up; I got stamina) The greatest, the greatest alive (Don't give up, don't give up, don't give up; I got stamina) The greatest, the greatest alive (Don't give up, don't give up, don't give up; I got stamina) The greatest, the greatest alive (Don't give up, don't give up, don't give up; I got stamina) The greatest, the greatest alive (Don't give up, don't give up, don't give up; I got stamina) The greatest, the greatest alive (Don't give up, don't give up, don't give up; I got stamina) The greatest, the greatest alive (Don't give up, don't give up, don't give up; I got stamina)  \"}", "The-weeknd-sidewalks": "\" Uh, uh, uh, uh-uh, uh, yeah, like I ran out of tears when I was 18 So nobody made me but the main streets 'Cause too many people think they made me Well, if they really made me then replace me Homeless to Forbes List, these niggas bring no stress I feel like Moses, I feel like I'm chosen And if you ain't my nigga then your girl single to me I don't give a damn if a nigga said he knew me Grew up with no father so nobody ever \\\"son\\\" me My flow too sick, Kevin Costner couldn't touch me I know you wish that nobody ever love me I feel useless when I'm never making money Well, this the life we always fantasized Rich folk problem through a Queen Street nigga's eyes Every time you see me pulling up in Aventadors Just know we been grinding on them sidewalks Sidewalks saved my life They don't ever lie Sidewalks saved my life They showed me all the signs They don't let me down But they lead me on And they don't let me down But they lead me on And they lead me on Say, say, say I come from murder one, brung late night melee Say, say, say We hung all summer, sprung mattress with bae bae Say, say, say Trippin' off Dyke, and my name strike with pay day Say, say, say Flippin' blue lightning, tightening, strapped with AK Say, say, say OG one, told me one, show me one, eight ways How to segue Pussy, power, profit and headache I reminisce my life innocence or life innocent Or life intimate, with fame Light limo tint with light women, dark women in it Awe Kenny, good game She wanna hang with a Starboy The sun and the moon and star, boy Astronomer, anonymous I line 'em up, we grind 'em up, there's nine of us And five of us have probably fucked She mollied up, I tallied up all the parts, boy Twenty legs, arms, head (Head) Head, head, and more head (Head) Oh God, bless the dead (Yah) I'm livin' life, high off life I wear my chokes off to bed I'm the greatest nigga, why you scared to say it? I wanna rock, I wanna rock I wanna cop more land, I never stop I wanna quick advance on a bill if it ain't one Break everything, I'm a hustler, came from Sidewalks saved my life They don't ever lie Sidewalks saved my life They showed me all the signs They don't let me down But they lead me on And they don't let me down But they lead me on And they lead me on  \"}", "Kendrick-lamar-the-recipe": "\" Smokin' weed with you 'Cause you taught me to Smokin' weed with you 'Cause you taught me to Every morning when I wake up, uh Money on my mind, good time to get caked up, uh Sunshine coming through my blinds, I\\u2019m living, but Really though, it's never enough 10 milli on, that's a must, living in California Everybody wanna visit for women, weed and weather They come for women, weed and weather For the women, weed and weather From all around the world for the women, weed and weather These niggas'll kill for that, put it in your grill for that Still everybody gotta build for that, me? I make mills off that How the fuck y'all can't see I ride, when I drive, down the block and You look outside, H-A-T-E in your eyes, I enter big money for the enterprise It's a beautiful day, I guess, for a bitch to roll with Andre, I guess Roll it up, baby, come and lift that dress then roll it up for me when I'm stressed You might catch me in Atlanta looking like a boss New Orleans and then Miami, party in New York Texas I be screwed up, Chi Town I be really pimpin' But nothing like my hometown I'm forever livin' Women, weed and weather They come for women, weed and weather For the women, weed and weather From all around the world for the women, weed and weather Got that women, weed and weather Don't it sound clever, come and play Wh-What more can I say? W-Welcome to LA Uhh, my nigga said he wanna fly out to get him some Three W's only for a three-day run, bitch Take them mothafuckin' panties off, you ain't no nun, shit I be living in the sky every time I ride by them hoes Ribbon in the sky on the radio 'cause Stevie know I control Let it breathe, I control, California living 'til I am old You want to be on to peak on the charts So the peons can be gone and pee on their hearts She in the coupe, she in the Neon 'Cause she on the BS before we can start Fuck with a nigga, ride with a nigga Let 'em know I'm priority, order me Hennessy and, for my niggas, OG Killa Call it Jason Voorhees, boy, he's on his job Boy, he sure be having the marks on they mark Pretty bitches and tire marks, let 'em inhale them pipe exhausts Let 'em reveal how much it cost for this life, controlling my price? No way, hell no, uh-uh If I'm wrong, I don't wanna be right We want to be on to peak on the charts So the peons can be gone and pee on their hearts Women, weed, weather, it's not my fault That it's 82 degrees and my top peeled off You might catch me in Atlanta looking like a boss New Orleans and then Miami, party in New York Texas I be screwed up, Chi Town I be really pimpin' But nothing like my hometown I'm forever livin' Women, weed and weather They come for women, weed and weather For the women, weed and weather From all around the world for the women, weed and weather Got that women, weed and weather Don't it sound clever, come and play Wh-What more can I say? W-Welcome to LA Known for that homegrown where I come from Smoke one, palm trees, double D's got 'em topless in the sun I shall proceed, that's me, mothafuck your opinion Huh, how many ways am I killing 'em? Shit, right around a billion We on it, that mean we living for the moment That mean she'll fuck 'til the morning, time and I got time And I know that I'm in a position of controlling, anything out by that ocean I'm a boss, I'll buy that ocean, ain't nobody fucking with this They want that shit, they often fiend I give it to 'em, but in between My time, I gotta tie shoestrings Life's a trip when you want these things I often slip and then I lean Toward three W's in life You know blow job need an application Eating pussy make appetite And yeah my type, I like 'em brown Just like my drink, the fuck you think? I don't fuck with no hand me downs See if you fuck then it's after me You know how much I'ma make it work? You know her dress livin' in her purse When you discuss your love for lust Just make sure you visit here first - Cali You might catch me in Atlanta, looking like a boss New Orleans and then Miami, party in New York Texas I be screwed up, Chi Town I be really pimpin' But nothing like my hometown I'm forever livin' Women, weed and weather They come for women, weed and weather For the women, weed and weather From all around the world for the women, weed and weather Got that women, weed and weather Don't it sound clever, come and play Wh-What more can I say? W-Welcome to LA  \"}", "Kendrick-lamar-sherane-aka-master-splinters-daughter": "\" Lord God, I come to you a sinner And I humbly repent for my sins I believe that Jesus is Lord I believe that you raised him from the dead I will ask that Jesus will come to my life And be my Lord and Savior I receive Jesus to take control of my life And that I may live for him from this day forth Thank you, Lord Jesus, for saving me with your precious blood In Jesus' name, Amen I met her at this house party on El Segundo and Central She had the credentials of strippers in Atlanta Ass came with a hump, from the jump she was a camel I want to ride like Arabians, push an '04 Mercedes-Benz \\\"Hello, my name is Kendrick,\\\" she said \\\"No, you're handsome.\\\" Whispered in my ear, disappeared, then found her dancin' Ciara had played in the background The parade music we made had us all wearin' shades now \\\"Cool, where you stay?\\\" She said: \\\"Down the street from Dominguez High\\\" Okay, I know that's borderline Compton or Paramount \\\"Well, is it Compton?\\\" \\u2013 \\\"No,\\\" she replied And quickly start battin' her eyes And strictly had wanted her thighs around me Seventeen, with nothin' but pussy stuck on my mental My motive was rather sinful \\\"What you tryin' to get into?\\\" She didn't tell, just gave me her Nextel Dropped the number, we chirped the whole summer, and well The summer had passed, and now I'm likin' her Conversation we havin' probably enticin' her Who could imagine? Maybe my actions will end up wifin' her Love or lust, regardless we'll fuck, 'cause the trife in us It's deep-rooted, the music of bein' young and dumb Is never muted; in fact, it's much louder where I'm from We know a lot 'bout each other, her mother was a crack addict She live with her granny and her younger two brothers Her favorite cousin Demetrius's irrepetible Family history of gang bangin' did make me skeptical But not enough to stop me from gettin' a nut \\\"I wanna come over, what's up?\\\" That's what I told her soon as this episode Of Martin go off, I'm tryin' to get off I was in heat like a cactus, my tactics of bein' thirsty Probably could hurt me, but fuck it, I got some heart Grab my momma's keys, hopped in the car, then, oh boy So now I'm down Rosecrans in a Caravan Passin' Alameda, my gas meter in need of a pump I got enough to get me through the traffic jam At least I hope 'cause my pockets broke as a promise, man I'm thinkin' about that sex, thinkin' about her thighs Or maybe kissin' on her neck, or maybe what position's next Sent a picture of her titties blowin' up my texts I looked at 'em and almost ran my front bumper into Corvette Enthused by the touch of a woman, she's a masseuse And I'm a professional porn star when off the Goose I had a fifth in the trunk like Curtis Jackson for ransom I'm hopin' to get her loose like an Uncle Luke Anthem I'm two blocks away, 250 feet And six steps from where she stay, she wavin' me 'cross the street I pulled up, a smile on my face, and then I see Two niggas, two black hoodies, I froze as my phone rang Please leave your message for 323- Record your message after the tone Kendrick, where you at? Damn! I'm sittin' here waitin' on my van You told me you was gon' be back in fifteen minutes! I gotta go to the county buildin', man These kids ready to eat! I\\u2019m ready to eat, shit I gotta get them food stamps, come on now You on you way or what? I hope you ain\\u2019t out there messin' with them damn hood-rats out there, shit, especially that crazy-ass girl Sherane Plus you got school tomorrow You keep fuckin' around in them streets, you ain\\u2019t gon' pass to the next grade, 11th grade (Is that Kendrick on the phone?) Yo' daddy hollerin' about some damn dominoes He want to holler at you too Go 'head, Kenny, go! Shit (Hello? Yeah, where my motherfuckin' dominoes at?) Kenny! (What?) You on his voicemail! Damn fool (Oh) Shit! (K, where my motherfuckin' dominoes at? This the second time I ask you to bring my fuckin' dominoes!) Kenny, give me the damn phone, shit. Don\\u2019t hang up! Damn! (Keep losin' my goddamn dominoes, we gon' have to go in the backyard and squab, homie) Just let me\\u2014Kendrick When you get this message, man, call me back I need to know when you gon' bring back my damn car This man fussin' about some damn dominoes It ain\\u2019t all that serious, fuck, damn dominoes Shit, I'ma miss my damn appointment! Fuck! Fuck them damn dominoes, nobody wanna hear that Nobody wanna hear yo' ass! Matter of fact, cut my motherfuckin' oldies back on You killin' my motherfuckin' vibe  \"}", "Kendrick-lamar-hood-politics": "\" K-Dot, pick up the phone, nigga Every time I call, it's going to voicemail Don't tell me they got you on some weirdo rap shit, nigga? No socks and skinny jeans and shit, ha Ha-ha-ha-ha-ha-ha-ha-ha-ha-ha-haha Call me on Shaniqua's phone! I been A-1 since day one, you niggas boo boo Your home boy, your block that you're from, boo boo Lil hoes you went to school with, boo boo Baby mama and your new bitch, boo boo We was in the hood, 14 with the deuce-deuce 14 years later going hard, like we used to on the dead homies On the dead homies I don't give a fuck about no politics in rap, my nigga My lil' homie Stunna Deuce ain't never comin' back, my nigga So you better go hard every time you jump on wax, my nigga Fuck what they talkin' 'bout, your shit is where it's at, my nigga Came in this game, you stuck your fangs in this game You wore no chain in this game, your hood, your name in this game Now you double up, time to bubble up the bread and huddle up Stickin' to the scripts, now here if them Benjamins go cuddle up Skip, hop, drip, drop, flip, flop with the white tube sock It goes \\\"Sherm Sticks, burn this\\\" That's what the product smell like when the chemicals mix 50 nigga salute, out the Compton zoo, with the extras El Cos, Monte Carlos, Road Kings, and dressers Rip Ridaz, P-Funkers, Mexicans, they fuck with you Asians, they fuck with you, nobody can fuck with you I been A-1 since day one, you niggas boo boo Your homeboy, your block that you're from, boo boo Lil hoes you went to school with, boo boo Baby mama and your new bitch, boo boo We was in the hood, 14 with the deuce-deuce 14 years later going hard, like we used to on the dead homies On the dead homies Hopped out the Caddy, just got my dick sucked The little homies called and said, \\\"the enemies done cliqued up\\\" Oh, yeah? Puto want to squabble with mi barrio? Oh, yeah? Tell 'em they can run it for the cardio Oh, yeah? Everythin' is everythin', it's scandalous Slow motion for the ambulance, the project filled with cameras The LAPD gamblin', scramblin', football numbers slanderin' Niggas names on paper, you snitched all summer Streets don\\u2019t fail me now, they tell me it's a new gang in town From Compton to Congress, set trippin\\u2019 all around Ain't nothin' new, but a flu of new Demo-Crips and Re-Blood-licans Red state versus a blue state, which one you governin'? They give us guns and drugs, call us thugs Make it they promise to fuck with you No condom, they fuck with you, Obama say, \\\"What it do?\\\" Obama say, \\\"What it do?\\\" Obama say, \\\"What it do?\\\" Obama say, \\\"What it do?\\\" I been A-1 since day one, you niggas boo boo Your homeboy, your block that you're from, boo boo Lil hoes you went to school with, boo boo Baby mama and your new bitch, boo boo We was in the hood, 14 with the deuce-deuce 14 years later going hard, like we used to on the dead homies On the dead homies Everybody want to talk about who this and who that Who the realest and who wack, or who white or who black Critics want to mention that they miss when hip-hop was rappin' Motherfucker, if you did, then Killer Mike'd be platinum Y\\u2019all priorities fucked up, put energy in wrong shit Hennessy and Crown Vic, my memory been gone since Don\\u2019t ask about no camera blocking at award shows No, don\\u2019t ask about my bitch, no, don\\u2019t ask about my Vogues 'Less you askin' me about power, yeah, I got a lot of it I'm the only nigga next to Snoop that can push the button Had the Coast on standby \\u201cK. Dot, what up? I heard they opened up Pandora\\u2019s box\\u201d I box \\u2018em all in, by a landslide Nah homie we too sensitive, it spill out to the streets I make the call and get the coast involved then history repeats But I resolved inside that private hall while sitting down with Jay He said \\\"it's funny how one verse could fuck up the game\\\" I been A-1 since day one, you niggas boo boo- I remember you was conflicted Misusing your influence Sometimes I did the same Abusing my power full of resentment Resentment that turned into a deep depression Found myself screaming in a hotel room I didn't want to self-destruct The evils of Lucy was all around me So I went running for answers Until I came home But that didn't stop survivors guilt Going back and forth Trying to convince myself the stripes I earned Or maybe how A-1 my foundation was But while my loved ones was fighting a continuous war Back in the city I was entering a new one  \"}", "Kendrick-lamar-lust": "\" I need some water, somethin' came over me Way too hot to simmer down might as well overheat Too close to comfort, as blood rush my favorite vein Heartbeat racin' like a junkie's, I just need you to want me Am I askin' too much? Let me put the head in Ooh, I don't want more than that, girl, I respect the cat I promise just a touch, let me put the head in If it's okay, she said, \\\"It's okay\\\" Yeah, I need everybody's motherfuckin' hands up right now I need everybody's motherfuckin'\\u2014 Door and his Nike Air Rattles Rush the fire exit, no time for battles Well I, I never expected This that new shit This that new, new shit Wake up in the mornin', thinkin' 'bout money, kick your feet up Watch you a comedy, take a shit, then roll some weed up Go hit you a lick, go fuck on a bitch Don't go to work today, cop you a fit Or maybe some kicks and make you\\u2014 Door and his Nike Air Rattles Rush the fire exit, no time for battles Well I, I never expected Wake up in the mornin', thinkin' 'bout money, kick your feet up Watch you a comedy\\u2014hol' up! Wake up in the mornin', thinkin' 'bout money, kick your feet up Watch you a comedy, take a shit, then roll some weed up Go hit you a lick, go fuck on a bitch, don't go to work today Cop you a fit or maybe some kicks and make it work today Hang with the homies, stunt on your baby mama Sip some lean, go get a pistol, shoot out the window Bet your favorite team, play you some Madden Go to the club or your mama house Whatever you doin', just make it count (I need some water) Wake up in the mornin', thinkin' 'bout money, kick your feet up Hop in the shower, put on your makeup, lace your weave up Touch on yourself, call up your nigga, tell him he ain't shit Credit card scam, get you a Visa, make it pay your rent Hop on the 'Gram, flex on the bitches that be hatin' on you Pop you a pill, call up your bitches, have 'em waitin' on you Go to the club, have you some fun, make that ass bounce It's whatever, just make it count I need some water, somethin' came over me Way too hot to simmer down might as well overheat Too close to comfort, as blood rush my favorite vein Heartbeat racin' like a junkie's, I just need you to want me Am I askin' too much? Let me put the head in Ooh, I don't want more than that, girl, I respect the cat I promise just a touch, let me put the head in If it's okay, she said, \\\"It's okay\\\" I wake in the mornin', my head spinnin' from the last night Both in a trance, feelings are dead\\u2014what a fast life! Manager called, the lobby call is 11:30 Did this before, promised myself I'd be a hour early Room full of clothes, bag full of money: call it loose change Fumbled my jewelry, 100k, I lost a new chain Hop on the bird, hit the next city for another M Take me a nap and do it again We all woke up, tryna tune to the daily news Lookin' for confirmation, hopin' election wasn't true All of us worried, all of us buried, and our feelings deep None of us married to his proposal, make us feel cheap Still and sad, distraught and mad, tell the neighbor 'bout it Bet they agree, parade the streets with your voice proudly Time passin', things change Revertin' back to our daily programs, stuck in our ways Lust Lately, I feel like I been lustin' over the fame Lately, we lust on the same routine of shame Lately, lately, lately, my lust been heightened (Lately) Lately, it's all contradiction Lately, I'm not here Lately, I lust over self Lust turn into fear Lately, in James 4:4 says Friend of the world is enemy of the Lord Brace yourself, lust is all yours I need some water, somethin' came over me Way too hot to simmer down might as well overheat Too close to comfort, as blood rush my favorite vein Heartbeat racin' like a junkie's, I just need you to want me Am I askin' too much? Let me put the head in Ooh, I don't want more than that, girl, I respect the cat I promise just a touch, let me put the head in If it's okay, she said, \\\"It's okay\\\"  \"}", "Kendrick-lamar-feel": "\" Ain't nobody prayin' for me (Ain't nobody prayin' for me) (Ain't nobody prayin' for me) Ain't nobody prayin' for me (Nobody prayin' for me) Ain't nobody prayin' for me (Ain't nobody prayin' for me) (Nobody prayin' for me) I feel like a chip on my shoulders I feel like I'm losin' my focus I feel like I'm losin' my patience I feel like my thoughts in the basement Feel like, I feel like you're miseducated Feel like I don't wanna be bothered I feel like you may be the problem I feel like it ain't no tomorrow, fuck the world The world is endin', I'm done pretendin' And fuck you if you get offended I feel like friends been overrated I feel like the family been fakin' I feel like the feelings are changin' Feel like my thought of compromise is jaded Feel like you wanna scrutinize how I made it Feel like I ain't feelin' you all Feel like removin' myself, no feelings involved I feel for you, I've been in the field for you It's real for you, right? Shit, I feel like\\u2014 Ain't nobody prayin' for me Ain't nobody prayin' for me Ain't nobody prayin' for me Ain't nobody prayin' I feel niggas been out of pocket I feel niggas tappin' they pockets I feel like debatin' on who the greatest can stop it I am legend, I feel like all of y'all is peasants I feel like all of y'all is desperate I feel like all it take is a second to feel like Mike Jordan whenever holdin' a real mic I ain't feelin' your presence Feel like I'ma learn you a lesson Feel like only me and the music though I feel like your feelin' ain't mutual I feel like the enemy you should know Feel like the feelin' of no hope The feelin' of bad dope A quarter ounce manipulated from soap The feelin', the feelin' of false freedom I'll force-feed 'em the poison that fill 'em up in the prison I feel like it's just me Look, I feel like I can't breathe Look, I feel like I can't sleep Look, I feel heartless, often off this Feelin' of fallin', of fallin' apart with Darkest hours, lost it Fillin' the void of bein' employed with ballin' Streets is talkin', fill in the blanks with coffins Fill up the banks with dollars Fill up the graves with fathers Fill up the babies with bullshit Internet blogs and pulpit, fill 'em with gossip I feel like this gotta be the feelin' where 'Pac was The feelin' of an apocalypse happenin' But nothin' is awkward, the feelin' won't prosper The feelin' is toxic, I feel like I'm boxin' demons Monsters, false prophets schemin' Sponsors, industry promises Niggas, bitches, honkies, crackers, Compton Church, religion, token blacks in bondage Lawsuit visits, subpoena served in concert Fuck your feelings, I mean this for imposters I can feel it, the phoenix sure to watch us I can feel it, the dream is more than process I can put a regime that forms a Loch Ness I can feel it, the scream that haunts all logic I feel like sayin' somethin', I feel like takin' somethin' I feel like skatin' off, I feel like waitin' for 'em Maybe it's too late for 'em I feel like the whole world want me to pray for 'em But who the fuck prayin' for me? Ain't nobody prayin' for me Who prayin' for me? Ain't nobody prayin'  \"}", "Kendrick-lamar-bitch-dont-kill-my-vibe-remix": "\" I am a sinner who's probably gonna sin again Lord forgive me, Lord forgive me Things I don't understand Sometimes I need to be alone Bitch don't kill my vibe, bitch don't kill my vibe I can feel your energy from two planets away I got my drink, I got my music I would share it but today I'm yelling Bitch, don't kill my vibe; bitch, don't kill my vibe Bitch, don't kill my vibe; bitch, don't kill my vibe Look inside of my soul And you can find gold and maybe get rich Hol' up Trinidad Jame$ in four weeks But now my album platinum and shit, so what? Y'all keep the numbers I'm more than another statistic, my nigga This courtesy of Compton (Courtesy of Compton) Brooklyn go hard, motherfucker Love me on the East like I'm Chuck D Dominicans wish that I was born there I'm lookin' to be the god MC You look at my hat and see thorns there I look at the game and see porn there I'm fuckin' this industry hard I'm bagging this money, tea-bagging your honey You thought I was fresh out the yard Don't cry to me dummy, you're a lightweight They tell me you nice and I'm like \\\"wait\\\" Go get me a knife, you're looking like steak And when the stakes are high, I stake out for days And when the water reside, you're Bobby Boucher But we ain't thirsty nigga, never alert me, nigga I got a P89 in a suitcase I know you heard me, nigga, this is a burpee, nigga Lyrical exercise, right now, homie, I'm in the extra vibe Pipe down, on the curb, when you heard that I got these words To the upper echelon, that's excellent (That's excellent) I am a sinner who's probably gonna sin again Lord forgive me, Lord forgive me Things I don't understand Sometimes I need to be alone Bitch don't kill my vibe, bitch don't kill my vibe I can feel your energy from two planets away I got my drink, I got my music I would share it but today I'm yelling Bitch, don't kill my vibe; bitch, don't kill my vibe Bitch, don't kill my vibe; bitch, don't kill my vibe Up in the clouds, me and my spouse Rumors on the ground gettin' too loud Please turn them shits down, can't hear myself think Turbulence, shit, almost spilled my drink In the White House with a mink Running through that bitch like it's my house All up in the hall like a mall Told you motherfuckers, all I do is ball No, I don't 'member you, I don't intend to Empty my memory bank It's a million dollars in it, baby, Hilary Swank Sittin' next to Hillary smellin' like dank Presidential pardon, name one nigga out there harder than him I'll wait I've been in my wave like 20 years straight I've been on my vibe like 20 years straight Don't fuck up my high, fuck up my high Nights like this, I could fuck up a pie An still be straight (still be straight) Fall back, bitch, I got a lot on my plate Don't waste my breath I don't know how many moons a nigga got left Back to this joint, smokin' this shit like I'm tryna' prove a point I'm the highest, the highest title, numero uno Kill my vibe, that's your motherfuckin' funeral Between you and me, turn eulogy to urinals, niggas pissed off I ministered this generation by far Leader of the new school On my toes like a ballerina, who knew I'd be Black Swan? World in my palms, ironically I am the Globetrotters' best 'cause I didn't drop the ball Told niggas when I was 16 That I'd write a 16 to put a nigga right on the big screen In the paddy wagon with six teens Should have been in the pen But now my pen write with morphine I heal niggas, touch down with more fiends I kill niggas, audio crack, khakis to meal ticket Cardio lap, was running for dear life But now I'm running the map, bitch, I'm here nigga Picture lil' ole me giving a fuck for what a fuck nigga gotta say Nigga, you never be Jay, never be Nas, never be Snoop nor Dre You ain't get killed in Vegas or in a Suburban Nigga, Puff Daddy wasn't your favorite So many washed up with detergent But I don't dry tears, I just aim at them on purpose Like blah, Mini-14 like blah Empty out another magazine like blah Let a young nigga get by (Doot!) I kill 'em all when they try to kill my vibe (Doot! Doot!) I am the bad, the good God, the last the hood got The last that would try to pass a good job If Shawn's a black Beatle then I need a 10 second drum solo Bitch see you at Woodstock, ah!  \"}", "J-cole-forbidden-fruit": "\" Me and my bitch, took a little trip Down to the garden, took a little dip (Oh no) Apple juice falling from her lips took a little sip, lil' sip Took a lil' sip, took a lil' sip T-T-Took a lil', took a lil', took a lil' sip Ayo, I walk through the valley of the shadow of death Where niggas hold tech's like they mad at the ref That's why I keep a cross on my chest, either that or a vest Do you believe that Eve had Adam in check And if so, you gotta expect To sip juice from the forbidden fruit and get loose Cole is the king, most definite My little black book thicker than the Old Testament Niggas pay for head but the pussy sold separate Same bitch giving brains to the minister The same reason they call Mr. Cee the finisher Forbidden fruit, watch for the Adam's apple Slick with words don't hate me, son What you eat don't make me shit and who you fuck don't make me cum Put a price on my head won't make me run Try to kill me but it can't be done 'Cause my words gon' live forever You put two and two together Cole here forever Me and my bitch, took a little trip Down to the garden, took a little dip (Oh no) Apple juice falling from her lips took a little sip, little sip Bitches come and go (You know that) Money come and go (You know that) Love come and go (Don't shit last) Bitches come and go (You know that) Money come and go (You know that) Love come and go (Don't shit last) Take a seat baby girl you've been all in my mind I know I ain't called gotta pardon my grind Just copped a maroon 5, no Adam Levine 'Came a man by myself, only father was time I know that she relate baby daddy ain't shit So she raised that nigga kids but she swallowing mine And that's why you all on my mind All on my line like caller number nine 'Cause a nigga poppin' like Harlem in the nine-seven Way before Mase was a reverend I was a young nigga making A's at 11 Or 12, trying to get a taste of the Heaven Or Hell, only time gon' tell Fuck her while her mama home, \\\"baby, don't yell\\\" How many records do a nigga gotta sell Just to get the cover of the XXL Or Fader, fuck your magazine hater When I say that I'm the greatest I ain't talking about later I'ma drop the album same day as Kanye Just to show the Boyz the man now like Wany\\u00e1 And I don't mean no disrespect, I praise legends But this what's next, the boy sick, can't disinfect Life's a bitch and her pussy's wet My clip is loaded and this is the kiss of... death Blaow Me and my bitch, took a little trip Down to the garden, took a little dip (Oh no) Apple juice falling from her lips took a little sip, little sip Bitches come and go (You know that) Money come and go (You know that) Love come and go (Don't shit last) Bitches come and go (You know that) Money come and go (You know that) Love come and go (Don't shit last) Don't shit last, don't shit last and you know that Went to hell, got hot didn't melt The only man above me is God himself All these other niggas is below me Word to Phife, Q-Tip, Ali, and Jarobi What up Queens Cole is the King and you know that Started with a dollar and a dream, and you know that Never give a bird bitch a ring, you should know that Bitch, bitch That should be my new ad lib I got a new one. I finally got a cool ad lib Be at all the shows everybody be like, bitch Bitch, bitch Or you can do the low cool shit, bitch Yo, yo, yo pull over right here, right here, here you go Yeah pull over right here, to the right Pull over, pull over, pull over, pull over Ight, look look, park right here I'ma be out it'll be like thirty minutes tops It'll be like thirty minutes, I'll be right back out, ight Bitches come and go, bitches come and Yo, yo what up, what's popping, I'm back, I'm back Yo you got that piece ready for me, that Jesus piece Nah the gold, the rose gold joint, yeah, yeah, yeah, yeah Yeah let me see that, oh shit what is that some What's, what the fuck is that platinum Is that? What's that chain right there Is that-ss-ss white gold, that's platinum Is that plat, well niggas doing platinum again, niggas doing, niggas ain't even platinum yet right, oh shit bout to make Yo I'm trying to bring that shit back, kill these niggas Let me see that one too, the wat, the watch, the platinum watch  \"}", "Kendrick-lamar-untitled-02-06232014": "\" Pimp-pimp! (Hooray!) Pimp-pimp! (Hooray!) (Hooray!) Pimp-pimp! (Hooray!) Pimp-pimp! I'm sick and tired of being tired Can't pick a side, the Gemini Prophesize if we live or not Promise momma not to fear nobody Seen black turn 'em Burgundy Hundred of them, I know I'm greedy Stuck inside the belly of the beast Can you please pray for me? Get God on the phone Said it won't be long I see jigaboos, I see Styrofoams My hood going brazy Where did we go wrong? I see jigaboos, I see Styrofoams Get Top on the phone Tell the squad come home We gon' ball again 'fore he call us home World is going brazy Where did we go wrong? It's a tidal wave, it's a thunderdome Get God on the phone I just got a raise (I just got a raise) Spent it all on me (I spent it all on me) Diamonds all appraised (Diamonds all appraised) And I'm bossing up (And I'm bossing up) Bitch, get out the way (Bitch, get out the way) I'm the only way, we can fornicate Ah, pimping and posing, look what I drove in, ah Having these hoes and I know that I'm chosen, ah I live by the code and me and my bros and, ah My dollars ain't foldin', you was never the homie Seen black turn 'em Burgundy Hundred of them, I know I'm greedy Stuck inside the belly of the beast Can you please pray for me? Get God on the phone Said it won't be long I see jigaboos, I see Styrofoams My hood going brazy Where did we go wrong? I see jigaboos, I see Styrofoams Get Top on the phone (What's up, my nigga?) Cornrow Kenny, he was born with a vision All morning with the mixed dashboards, triple digits Parallel park like an alien came visit Slideshow for the night show, ten bitches Find hoes with a blindfold, King Kendrick (Hello Billy) So many plays on me I finesse Palisade views with some sex I lost a lot of love for missionary This the first time I confess Me and Top is like a Kobe and Phil A father figure fuck with him, you get killed Fuck with me and he will kill you himself TDE the mafia of the west Move in silence, yeah, we juggin\\u2019 like that Act of violence, yeah, we juggin\\u2019 like that I did a lot of dumb shit in my past Lord forgive me, hoping I don't relapse Dave just bought a new nine eleven Almost thought I\\u2019d seen another plane crash Q just bought a brand new McLaren Rock-a-lack about to buy the projects Moosa got his son dripping in gold Ali 'bout to let his hair down on hoes Me, I'm 'bout to let my hair down on hoes Top billin', that\\u2019s a million a show Might blow the whole no whammy on Soul Might tell Obama be more like Punch Sounwave caught a Grammy last year Mack wop, bet he do what he want Fuck you niggas, level two, I'm not done 2Teez told me that I'm the one I can put a rapper on life support Guarantee that's something none of you want Ten homies down and they all serving life What is like twenty-five hundred a month? What if I empty my bank out and stunt? What if I certified all of these ones? Bitch I get buck, I'm as real as they come Shit is amazing, I'm feeding my cravings You know that you want me come here now lil' baby I'm fuckin, I'm crazy Serving it like I belong in the basement Or live at the Days Inn Yan Yan my relative, black cherry soda Pistol and poverty, come get to know us (Get Top on the phone) Who doing the drums? Man put that nigga on the drums man Yep all day, Mortal Man and Kunta Alright, from the top! \"}", "Kendrick-lamar-god": "\" This what God feel like, huh, he-yeah Laughin' to the bank like, \\\"A-ha!\\\", huh, he-yeah Flex on swole like, \\\"A-ha!\\\", huh, he-yeah You feel some type of way, then a-ha! Huh, he-yeah (A-ha-ha, a-ha-ha) Ever since a young man (Since a young man) All I wanna be was a gunman (Was a gunman) Shootin\\u2019 up the charts, better run, man Y'all gotta see that I won, man Slick as El DeBarge with the finger waves, work it, JT Handle bars like a fade, watch me work it, JT I'm at large, runnin\\u2019 plays like a circuit, JT I'm sellin' verses, JT, watch me work it, JT Look, look\\u2026 hol' up! Don't judge me! My mama caught me with a strap Don't judge me! I was young, fuckin' all the brats Don't judge me! Aimin\\u2019 at your head for a stack Don\\u2019t judge! Don't judge me! Now my home got a Valley peak Don\\u2019t judge me! If I press your line you a freak Don't judge me! Won't you tell a friend? Y'all gon\\u2019 see\\u2014 This what God feel like, huh, he-yeah Laughin' to the bank like, \\\"A-ha!\\\", huh, he-yeah Flex on swole like, \\\"A-ha!\\\", huh, he-yeah You feel some type of way, then a-ha! Huh, he-yeah (A-ha-ha, a-ha-ha) Fuck is you talkin' to? Ayy, do you know who you talkin' to? Slide on you like fallen drapes God toss full of carnivals I kill 'em with kindness Or I kill 'em with diamonds Or I put up like fifteen hundred Get yo' ass killed by the finest Everything in life is a gamble Nothin' in life I can't handle Seen it all, done it all, felt pain more For the cause, I done put blood on sword Everything I do is to embrace y'all Everything I write is a damn eight ball Everything I touch is a damn gold mine Everything I say is from an angel I don't rush shit, fuck shit, always your shit, my shit Cannonballs to ignite shit, morning to the night shift I'm on, I ain't sorry for it Ask for a piece of mine, you charged me for it I wanna see sometimes if you ignore it I'm in the streets sometimes and can't afford it I got a bad habit, levitatin', duckin' haters Oh my! My heart is rich, my heart is famous This what God feel like Huh, he-yeah (This what God feel like) Laughin' to the bank like, \\\"A-ha!\\\" (This what God feel like) Huh, he-yeah (This what God feel like) Flex on swole like, \\\"A-ha!\\\" (This what God feel like) Huh, he-yeah (This what God feel like) You feel some type of way, then a-ha! (This what God feel like) Huh, he-yeah (This what God feel like) This what God feel like  \"}", "Kendrick-lamar-cartoon-and-cereal": "\" I wanna hit line drives\\u2026 Wanna lose weight and keep eating\\u2026 For you\\u2026 Hey, whats up doc? Now I was raised in a sandbox, next to you and her You was holding the handgun, she was giving birth To a baby boy to be just like you, I-I wonder what's that worth I-I wonder if you ever knew that you was a role model to me first The next day I-I woke up in the morning, seen you on the news Looked in the mirror, then realized that I-I-I had something to prove You told me, \\\"Don't be like me, just finish watching cartoons\\\" Which is funny now cause all I see is Wile E. Coyotes in the room And I run it (Blow! Blow! Blow! Blow!) And I run it (Blow! Blow! Blow! Blow!) And I run it (Yeah! Blow!) And I run it (Yeah! Blow!) That's ironic (Blow! Blow! Blow! Blow!) Ironic (Blow! Blow! Blow! Blow!) That's ironic (Y-Yeah!  Blow!) Ironic (Yeah! Blow! Yeah!) Salt all in my wounds Hear my tears all in my tunes Let my life loose in this booth Just for you, mothafucka, hope y'all amused And I run it (Blow! Blow! Blow! Blow!) And I run it (Blow! Blow! Blow! Blow!) And I run it (Y-Yeah! Blow!) And I run it (Yeah! Blow!) That's ironic Liberation\\u2026 Leader\\u2026 Popular pie plant pictured here\\u2026 Wile E. Coyote! Wile E. Coyote! This shit make a nigga just wanna write Reminisce when I had the morning appetite Apple Jacks and after that I hit the TV Guide Animaniac the only thing that gave me peace of mind I\\u2019m a maniac when aiming at the enemy that lied Tell a story that I'll never grow to 25 Not to worry, every warrior will come and see euphoria And that's a covenant I put on every tribe Ain't nobody gon' tie your shoe Nobody gon' abide by your rule Nobody holding your gun How come your tongue say, \\\"killa\\\" then kill my mood Light speed living in the world you know Little old me, feeling like a live wire Bet I put some new tires on a lightning bolt 'Til I wreck into a pole, like a right to vote I'm from the bottom of the jungle Living in the bottom of the food chain When you get a new chain, nigga take it from you A new name, want stripes, and you a zebra look-alike Hope another homicide don't numb you a nun do Things we will never learn soon In the era where we wanna earn soon That's a error, you can smell it in the air And everybody really doomed That's why I'm backdooring you motherfuckas All y'all can suck my dick All them days at the county building I'm 'bout to make my mama rich Cartoons and (Cereal!) I ain't felt this (Good since!) Scrooge McDuck (Here we go!), elementary hood shit Now I was raised in a sandbox, next to you and her You was holding the handgun, she was giving birth To a baby boy to be just like you, I wonder what's that worth I-I wonder if you ever knew that you was a role model to me first The next day I-I woke up in the morning, seen you on the news Looked in the mirror, then realized that I-I-I had something to prove You told me, \\\"Don't be like me, just finish watching cartoons\\\" Which is funny now cause all I see is Wile E. Coyotes in the room And I run it (Blow! Blow! Blow! Blow!) And I run it (Blow! Blow! Blow! Blow!) And I run it (Yeah! Blow!) And I run it (Yeah! Blow!) That's ironic (Blow! Blow! Blow! Blow!) Ironic (Blow! Blow! Blow! Blow!) That's ironic (Y-Yeah!  Blow!) Ironic (Yeah! Blow! Yeah!) Salt all in my wounds Hear my tears all in my tunes Let my life loose in this booth Just for you, mothafucka, hope y'all amused And I run it (Blow! Blow! Blow! Blow!) And I run it (Blow! Blow! Blow! Blow!) And I run it (Y-Yeah! Blow!) And I run it (Yeah! Blow!) That's ironic This shit make a nigga just wanna shit on everybody Even with a pot to piss in I'ma aim sloppy at a loud mouth, discharge Dismiss any business of yours Discounts never did amount to a check That ya ass couldn't cash when the shit bounce Everything dismounts, niggas gon' flip that car AKs for the whole hood House lick went down perfect Two shots to the head he deserved it I overheard it hit my bed with a bowl and remote control Dark Wing Duck lost service Mama said I'd better duck, she's nervous Drama all up in the cut, hit the curtains I mean don't intervene with no gun machine This block stay jerking, the feds stay lurkin' Emerging on everbody corner (Dash for it) Get a toe tag when you play tag With a task of a new (Task force) Everybody wanna know my life How did I make it (Past yours) Well let me tell you like this I've been running this shit since I (Asked for) Cartoons and cereal Now I was raised in a sandbox, next to you and her You was holding the handgun, she was giving birth To a baby boy to be just like you, I wonder what's that worth I-I wonder if you ever knew that you was a role model to me first The next day I-I woke up in the morning, seen you on the news Looked in the mirror, then realized that I-I-I had something to prove You told me, \\\"Don't be like me, just finish watching cartoons\\\" Which is funny now cause all I see is Wile E. Coyotes in the room And I run it Salt all in my wounds Hear my tears all in my tunes Let my life loose in this booth, just for you Muhfucka, hope y'all amused! I did wrong, karma came Crackers gave me ball and chain Friends, enemies all the same State, fed, both can hang Nobody can't mute me But I never said nobody can't shoot me Just another stat to the white folks Still whip work to the white yolk, absolutely! Everyday feel like the one before Hunt the money, don't hunt the ho If you do what you always done Then you get what you always got You dumb buffoons! I ain't seen the back of my eyelids For about the past 72 hours Hand on my heart, face to the hood I pledge every word you ever heard was honest Yeah, this me, no mic No cameras, no lights, just pain Mama, how much trauma can I sustain? Dirty money come with lots of stains Road to riches come with lots of lanes Just another player with lots of game Never had shit, got lots to gain\\u2026 Just another player with lots of game Never had shit, got lots to gain (To be continued)  \"}", "Taylor-swift-bad-blood-remix": "\" \\u2018Cause, baby, now we've got bad blood You know it used to be mad love So take a look what you've done \\u2018Cause, baby, now we've got bad blood, hey! I can't take it back, look where I'm at We was OG like D.O.C., remember that? My TLC was quite OD, ID my facts Now POV of you and me, similar Iraq I don't hate you, but I hate to critique, overrate you These beats of a dark heart, use basslines to replace you Take time and erase you, love don't hear no more No, I don't fear no more Better yet, respect ain't quite sincere no more Oh, it's so sad to Think about the good times You and I \\u2018Cause, baby, now we've got bad blood You know it used to be mad love So take a look what you've done \\u2018Cause, baby, now we've got bad blood, hey! Now we've got problems And I don't think we can solve 'em You made a really deep cut And, baby, now we've got bad blood, hey! Remember when you tried to write me off? Remember when you thought I'd take a loss? Don't you remember? You thought that I would need ya Follow procedure, remember? Oh, wait, you got amnesia It was my season for battle wounds Battle scars, body bumped, bruised Stabbed in the back; brimstone, fire jumping through Still, all my life, I got money and power And you gotta live with the bad blood now Oh, it's so sad to Think about the good times You and I \\u2018Cause, baby, now we've got bad blood You know it used to be mad love So take a look what you've done \\u2018Cause, baby, now we've got bad blood, hey! Now we've got problems And I don't think we can solve 'em You made a really deep cut And, baby, now we've got bad blood, hey! Band-Aids don't fix bullet holes You say sorry just for show You live like that, you live with ghosts You forgive, you forget, but you never let it go Band-Aids don't fix bullet holes You say sorry just for show If you live like that, you live with ghosts If you love like that, blood runs cold \\u2018Cause, baby, now we've got bad blood You know it used to be mad love So take a look what you've done \\u2018Cause, baby, now we've got bad blood, hey! Now we've got problems And I don't think we can solve 'em You made a really deep cut And, baby, now we've got bad blood, hey! \\u2018Cause, baby, now we've got bad blood You know it used to be mad love So take a look what you've done \\u2018Cause, baby, now we've got bad blood, hey! Now we've got problems And I don't think we can solve 'em You made a really deep cut And, baby, now we've got bad blood, hey!  \"}", "Kendrick-lamar-blood": "\" Is it wickedness? Is it weakness? You decide Are we gonna live or die? So I was takin' a walk the other day And I seen a woman\\u2014a blind woman Pacin' up and down the sidewalk She seemed to be a bit frustrated As if she had dropped somethin' and Havin' a hard time findin' it So after watchin' her struggle for a while I decide to go over and lend a helping hand, you know? \\\"Hello ma'am, can I be of any assistance? It seems to me that you have lost something I would like to help you find it.\\\" She replied: \\\"Oh yes, you have lost something You've lost\\u2026 your life.\\\"  {Gunshot} Is it wickedness? Lamar stated his views on police brutality With that line in the song, quote: \\\"And we hate the popo, wanna kill us in the street fo' sho'.\\\" Oh please, ugh, I don't like it  \"}", "Kendrick-lamar-for-free-interlude": "\" Fuck you, motherfucker, you a ho-ass nigga I don't know why you trying to go big, nigga, you ain't shit Walking around like you God's gift to Earth, nigga, you ain't shit You ain't even buy me no outfit for the Fourth I need that Brazilian, wavy, twenty-eight inch, you playin' I shouldn't be fuckin' with you anyway I need a baller-ass, boss-ass nigga You's a off-brand-ass nigga, everybody know it Your homies know it, everybody fuckin' know Fuck you, nigga, don't call me no more You won't know, you gonna lose on a good bitch My other nigga is on, you off What the fuck is really going on? This dick ain't free You lookin' at me like it ain't a receipt Like I never made ends meet Eating your leftovers and raw meat This dick ain't free Livin' in captivity raised my cap salary Celery, tellin' me green is all I need Evidently all I seen was Spam and raw sardines This dick ain't free, I mean, baby You really think we could make a baby named Mercedes Without a Mercedes Benz and twenty-four inch rims Five percent tint, and air conditioning vents? Hell fuckin' naw, this dick ain't free I need forty acres and a mule Not a forty ounce and a pit bull Bullshit, matador, matador Had the door knockin', let 'em in, who's that? Genital's best friend, this dick ain't free Pity the fool that made the pretty in you prosper Titty juice and pussy lips kept me obnoxious Kept me up watchin' pornos in poverty; apology? No Watch you politic with people less fortunate, like myself Every dog has its day, now doggy style shall help This dick ain't free Matter of fact, it need interest Matter of fact, it's nine inches Matter of fact, see our friendship based on business Pension, more pension, you're pinchin' my percents It's been relentless, fuck forgiveness, fuck your feelings Fuck your sources, all distortion, if you fuck it's more abortion More divorce courts and portion My check with less endorsement left me dormant Dusted, doomed, disgusted, forced with Fuck you think is in more shit? Porcelain pipes pressure, bust 'em twice Choice is devastated, decapitated the horseman Oh America, you bad bitch, I picked cotton and made you rich Now my dick ain't free I'ma get my Uncle Sam to fuck you up You ain't no king  \"}", "Rich-the-kid-new-freezer": "\" Ayy, new freezer (New freezer, New freezer) You know what it was when you signed up, ayy Dat way, yuh, yuh, yeah, dat way My bitch too foreign, need a visa (ooh) I don't need her (huh?) Pull up drop top with a eater (skrrt) Two seater (skrrt) New bitch wanna fuck to my AP (AP, ice) New freezer (ice) I woke up thinkin' 'bout bands (bands) Hop off a jet to a check when I land (yuh) My bitch too foreign, need a visa (bitch) I don't need her (huh?) Pull up drop top with a eater (yeah) Two seater (skrrt, skrrt) New bitch wanna fuck to my AP (bitch) New freezer (new freezer) I woke up thinkin' 'bout bands (new freezer) Hop off a jet to a check when I land (dat way) Ooh, money way (money) Diamonds, flexin' (bling, woo) I woke up rich, spend a grip on a necklace (yuh) I put the plug on three way (plug) Maserati go speed race (yeah) Drop a baby on a bitch face (woah) More ice flexin' this way (ice) We put the world on the wave (the wave) Don't give a fuck, 'cause I'm paid (woo) More Act in a lemonade (Act) Pharmacy knowin' my name (my name) I fuck that bitch, 'cause she bougie (she bougie) She suck my dick in the movies (yuh) Trap jumpin' like 2-3 She a foreign lil' freak (freak) My bitch too foreign, need a visa (woo) I don't need her (bitch) Pull up drop top with a eater (skrrt) Two seater (skrrt) New bitch wanna fuck to my AP (AP, ice) New freezer (ice) I woke up thinkin' 'bout bands (bands) Hop off a jet to a check when I land (woo) My bitch too foreign, need a visa (bitch) I don't need her Pull up drop top with a eater (yeah) Two seater (skrrt, skrrt) New bitch wanna fuck to my AP (bitch) New freezer (woah) I woke up thinkin' 'bout bands (what up?) Hop off a jet to a check when I land (ooh, yuh, yuh) Big shot (hol' up, wait) Peanut butter insides (No) Outside, cocaine white, body look like Gentiles (Gentiles) Rule of the day, get a view every day Get a bitch with a tan by the pool every day Get a clip with a plan, give a jewel every day I never sleep, I gotta eat, I gotta dance I Milly Rock when I get that advance How can I shop with like 64 Ms? Talkin' to Top about business again He want a lot with new Bentleys again I want some top from like two sets of twins Twinnie twin twins, yeah, yeah Ayy, bitch (bitch), where your friends? Yeah, yeah (Hol' up) switch (hol' up), she won't end, yeah, yeah Ball 'em in, fallin' in bundles of flowers like parliament Never know, big dawg like ours My bitch too foreign, need a visa (woo) I don't need her (bitch) Pull up drop top with a eater (skrrt) Two seater (skrrt) New bitch wanna fuck to my AP (AP, ice) New freezer (ice) I woke up thinkin' 'bout bands (bands) Hop off a jet to a check when I land (woo) My bitch too foreign, need a visa (bitch) I don't need her Pull up drop top with a eater (yeah) Two seater (skrrt, skrrt) New bitch wanna fuck to my AP (bitch) New freezer (woah) I woke up thinkin' 'bout bands (what up?) Hop off a jet to a check when I land (ooh, yuh, yuh)  \"}", "Chris-brown-autumn-leaves": "\" Oh, no, babe Yeah-yeah Baby, you Ah-ah, ah-ah-ah *Woman moaning* Ah-ah, ah-ah-ah Yeah *Woman moaning* If you leave this time, I fear that you'll be gone for good, so And I hold on like leaves in fall to what is left Said her father left her young and he said he'll be back With that same tone that you just said you'll stay forever with Ooh It seems that all the autumn leaves are falling Ooh-ooh-ooh I feel like you're the only reason for it Ooh All the things you do, all the things you do, all the things you do Ooh-ooh-ooh All the things you do, all the things you do, all the things you do Ooh It seems that you're the only reason for it I've been bleeding in your silence, I feel safer in your violence I hold on like leaves in fall to what is left Before I sleep I talk to God, he must be mad with me, it's karma I'm confused who I'll spend my forever with, oh-oh-oh Ooh It seems that all the autumn leaves are falling Ooh-ooh-ooh I feel like you're the only reason for it Ooh All the things you do, all the things you do, all the things you do Ooh-ooh-ooh All the things you do, all the things you do, all the things you do So the iceberg never broke And I poked at it and I poked at it and I poked at it and I poked (And I poked) And I poked at it but it stayed stagnant Then I poked at it some more (Some more) And in my notepad, man, I wrote (Man, I wrote) If I don't have it, if I don't grab it If it don't chip, then a toe tag is one last, I'ma hope (I'ma hope) So iceberg don't float (Don't float) If I do manage to do damage to you, dammit It'll be grand as, ten Grammies or my granny still standin' with a note (With a note) That read, ''Granted, don't you panic'' When you make mistakes the most (The most) One day, it'll make you grow (You grow) When you outlandish and you lose manners, to God you shall consult (Consult) When the bright cameras are still crammin' in your face and it provoke (Provoke) You to act mannish, just stay planted 'cause you reapin' what you sowed Keep (Keep) positivity in your heart and (And) Keep a noose from 'round your throat and (And) When you get mad and when you poke at it When you poke it at just note, man The iceberg is a reflection of you when you renew your vision Just think if it had sunk Titanic, the fuck it would do to a critic, my nigga? (Ooh-ooh) Yeah, yeah Tell me, when thugs cry, do you hear 'em, Lord? (Ooh-ooh) Do you hear 'em, Lord? Do you hear 'em? And if my ship go down tell me who will abort? And they won't let me live, even with remorse that I give When they gon' rejoice and forgive, tell me how I stay positive (Ooh-ooh) When they never see good in me Even though I got hood in me, don't mean he won't redeem me, Lord It seems that all the autumn leaves are falling Ooh-ooh-ooh I feel like you're the only reason for it Ooh All the things you do, all the things you do, all the things you do Ooh-ooh-ooh All the things you do, all the things you do, all the things you do Ooh Ooh-ooh *Woman moaning* Ooh  \"}", "Jhene-aiko-stay-ready-what-a-life": "\"  Part 1: Stay Ready   We do not exist in Any other instant Here in this dimension You and I are meant to be I have waited lifetimes to find you Now that you're here I can remind you Of the things you've been dreaming Times two I promise you If you just give me 24 Man, all I need is 24 hours I promise you'll want plenty more You've probably been waiting forever So how does it sound: Us on the ground Giving you my love? There's no place quite like here There's no better time than now You gotta stay ready There's no place quite like here There's no better time than now That's why I stay ready Tell me find your spot with the warning that I might slip And when you climb on top that's the ultimate road trip Ride on me like your Pac got me thinkin' it's 96' I can rap on some nineties shit, wrap your leggings around my hip I'm so hip to it, tourists want to come speculate But if I stay monogamous promise this kiss will always taste like candy And, yeah, it's obvious momma now probably can't stand me I'm sure they're tired of this look that you have when you're antsy We gon' fuck around (Mmm), we gon' fuck around And triple through triplets of babies right now And that might break the record and no, that don't mean you're fertile That means we're fucking reckless, plus we don't use protection I find myself reading old text messages when I'm bored We find ourselves sexting 'til that connection is restored I know that sounds immature, but if we never grow up Then I wish you good luck on the seats thats inside this Porsche Come to me, come, come to me Look at what you've done to me You put a gun to me Then you brought the sun to me Shine like blood diamonds Learning to have patience only cause you are timeless The universe energy doesn't lie And this chemistry is infinity at a million times I wrote a million rhymes describing your star power And after 24 bars, you get 24 hours There's no place quite like here There's no better time than now You gotta stay ready There's no place quite like here There's no better time than now That's why I stay ready All that I know is right now Nothing's for sure but, right now Gotta get yours like, right now All that I know is right now Nothing's for sure but, right now Gotta get yours like, right now  Part 2: What A Life All that I know is right now Nothing's for sure but, right now Gotta get yours like, right now I been through some shit man But I be on my shit man I decided That what you give Is what you're given So I been tryna do it right I been doin' like Whatever gets me through the night What a life I'm steady always on the go You steady always on the go We steady losing all control What a life What a life What a life What a life They say The truth ain't pretty But coming from that pretty mouth The truth is fitting 'Cause you ain't never talkin' loud And you know plenty Yeah, you know what I'm talkin' bout 'Cause you just get me Yeah, you so pretty If everything is dipped in gold Then, baby, it will never grow Everything sweet ain't sugar coated What a life What a life What a life What a life What a life What a life that I've been given What a life What a life that I've been living What a life What a life we die to live in What a life  \"}", "Tech-n9ne-fragile": "\" You said you'd never ever break... down But here I am sweeping... pieces off of the ground You said you'd never, ever play... to crowds But I've seen you hoping to play songs to them now I've spent all night long scared of tomorrow, I broke my alarm Everything is almost lost, pick it up slow, before it's gone... We\\u2019re fragile (Wish I\\u2019d have known) I never thought I\\u2019d be so fragile (You\\u2019re not alone) If it didn\\u2019t break before, it\\u2019s about to (We\\u2019ve been here before) I don\\u2019t ever want to change I\\u2019m fragile I don\\u2019t ever want\\u2026 I don't ever... Some of the people appointed to give an opinion Never do get it I want you to come on and gobble a jimmy and... die N9na be givin the remedy and why? Critics are really the enemy and I Can't stand the way they slam today's gifted Effin' incredible, get fanned away with grands to pay This jam will lay scripted Deaf and impeccable Write a rhyme and I put everything in a flow I'm the N9ne I'ma look very mean When a foe scribe a line but he has never been at a show By the times it'll be better, leave it in the sto Cause they wrote nothin' but lies, quotes stuck in my eyes Amateur writer dissin' He's a beginner and hopes for your demise, folks I'ma despise Never do try to listen It's real - I'm mad Clueless when you scribble on your pad How you gonna criticize with a chisel on your nads sizzling your ad You don't really get why I'm so pissed? Understand this: I'm an artist, and I'm sensitive about my shit, yes I'm We\\u2019re fragile (Wish I\\u2019d have known) I never thought I\\u2019d be so fragile (You\\u2019re not alone) If it didn\\u2019t break before, it\\u2019s about to (We\\u2019ve been here before) I don\\u2019t ever want to change I\\u2019m fragile I don\\u2019t ever want\\u2026 I don't ever... Tell me that I'm famous Tell me that my name is Big as Venus Jupiter and then Uranus Tell me that your anus got your head in it I can smell the articles and know you're heinous Tell me that you love me, always thinkin' of me Unconditional, I'm hoping I'm your favourite Grab a fishing pole and throw me with the sharks That's the feelin' I get when you're concentratin' On this pen, on this pad Tell me you're willin' to diss on my craft Tell me the feelin' of pickin' apart this track Stop... Puttin' my heart and my soul in these lines Tellin' me platinum and gold all the time Lookin' to bury, a deep hole for mine Drop... This is more than you, and this is more than you And your entire building slanderin' and abusin' What I call the realest comin' from a student Told myself to use a poem as an UZI Empty magazine, I seen a magazine You seen my trigger finger, then I started shootin' That was nicotine, I'm bout to smoke 'em all And journalists involved should've known my music We\\u2019re fragile (Wish I\\u2019d have known) I never thought I\\u2019d be so fragile (You\\u2019re not alone) If it didn\\u2019t break before, it\\u2019s about to (We\\u2019ve been here before) I don\\u2019t ever want to change I\\u2019m fragile I don\\u2019t ever want\\u2026 I don't ever...  \"}", "Kendrick-lamar-institutionalized": "\" What money got to do with it When I don't know the full definition of a rap image? I'm trapped inside the ghetto and I ain't proud to admit it Institutionalized, I keep runnin' back for a visit, hol' up Get it back I said I'm trapped inside the ghetto and I ain't proud to admit it Institutionalized, I could still kill me a nigga, so what? If I was the president I'd pay my mama's rent Free my homies and them Bulletproof my Chevy doors Lay in the White House and get high, Lord Whoever thought? Master, take the chains off me! Zoom, zoom, zoom, zoom, zoom Zoom, zoom, zoom Zoom, zoom, zoom, zoom, zoom Zoom, zoom, zoom Zoom, zoom, zoom, zoom, zoom Zoom, zoom, zoom Zoom, zoom, zoom, shit Life to me, like a box of chocolate Quid pro quo, somethin' for somethin', that's the obvious Oh shit, flow's so sick, don't you swallow it Bitin' my style, you're salmonella poison positive I can just alleviate the rap industry politics Milk the game up, never lactose intolerant The last remainder of real shit, you know the obvious Me, scholarship? No, streets put me through colleges Be all you can be, true, but the problem is Dream only a dream if work don't follow it Remind me of the homies that used to know me, now follow this I'll tell you my hypothesis, I'm probably just way too loyal K Dizzle will do it for you, my niggas think I'm a god Truthfully all of 'em spoiled, usually, you're never charged But somethin' came over you once I took you to them fuckin' BET Awards You lookin' at artistses like they're harvestses So many Rollies around you and you want all of them Somebody told me you thinkin' 'bout snatchin' jewelry I should've listened when my grandmama said to me Shit don't change until you get up and wash yo' ass, nigga Shit don't change until you get up and wash yo' ass, boy Shit don't change until you get up and wash yo' ass, nigga Oh now, slow down And once upon a time, in a city so divine Called West Side Compton, there stood a little nigga He was five foot something, God bless the kid Took his homie to the show and this is what they said \\\"Fuck am I 'posed to do when I'm lookin' at walkin' licks? The constant big money talk 'bout the mansion and foreign whips The private jets and passport, presidential glass floor Gold bottles, gold models, givin' up the ass for Instagram flicks, suckin' dick, fuck is this? One more sucker wavin' with a flashy wrist My defense mechanism tell me to get him Quickly because he got it It's a recession, then why the fuck he at King of Diamonds? No more livin' poor, meet my four-four When I see 'em, put the per diem on the floor Now Kendrick, know they're your co-workers But it's gon' take a lot 'fore this pistol go cold turkey Now I can watch his watch on the TV and be okay But see I'm on the clock once that watch landin' in LA Remember steal from the rich and givin' it back to the poor? Well, that's me at these awards\\\" I guess my grandmama was warnin' a boy She said... Shit don't change until you get up and wash yo' ass, nigga Shit don't change until you get up and wash yo' ass, boy Shit don't change until you get up and wash yo' ass, nigga Oh now, slow down And once upon a time, in a city so divine Called West Side Compton, there stood a little nigga He was five foot something, dazed and confused Talented but still under the neighborhood ruse You can take your boy out the hood But you can't take the hood out the homie Took his show money, stashed it in the mozey wozey Hollywood's nervous Fuck you, goodnight, thank you much for your service  \"}", "Black-hippy-uoeno": "\" I fucked up the rap game and you ain't even know it I just fucked what's her name and you ain't even know it (you ain't even know it) She got a *beep* tattoo and you ain't even know it (real talk) We about to form a little group and you ain't even know it, let's get it Stuck in a rock and a hard place Eminem, Pac and where God stay Timberlands pop that jaw bone Now bitch nigga, tell me how that tar taste And even Tarzan can get swung on I never hung out with the loud mouth You got a foul mouth And that dead body gon' smell foul when it fouls out She filed my nails in the Bahamas We found ourselves in the Bahamas She found God, meditation, and peace I found myself without a condom You know everybody having them babies It's a beautiful thing it ain't crazy If a rapper monogamous, you know what the problem is? Too many bitches got rabies And I hate a ho-hoppin' woman Stank pussy-poppin' woman You fuckin' fool don't know about you But my dick need 17 years on it Anything after that is just a bonus And I been in the lab with my opponents And since Sway done swayed that list He got a flatscreen the next morning Tell 'em I need my credit when it's due Tell 'em I need my lettuce when it's new Tell 'em I got a fetish for fine fabric, Franklins and saying, \\\"Fuck you\\\" Tell 'em it's TDE 'til I'm DDT'd in that grave And Top Dawg is proof 'til my nigga Whoo Kid get free, ain't shit comin' for free I'm 'bout to rape you niggas 'til you recoup (Dizzle) It's a groovy nigga, that's all day, Backwood hold three grams Got a six-shooter, that revolver spinning, shell stuck inside, but won't jam This hoody here about two stacks, hell yeah that bitch could gon' go ham Molly in her drink, but she asked me to and oh yeah I got this on cam Gangsta nigga, no trap beats, bet I still sound like that new shit Originality in my blueprint, still Figg side, Figueroa pimp Her big ass where my palm hit, pull my dick out, she gon' balm it Swag surfin' all through the world, slide through the sea on a comet O-X-Y for these morons, that be that new shit I'm pushin' Raise off of them pockets, bring more of them coffins These niggas ain't popping, tell them, old niggas, to move on Aw damn I done said it, all them can beheaded She ain't single but she solo, you ain't even know it Unsigned with sold out shows, you ain't even know it My lips black but they ain\\u2019t chapped, she ain\\u2019t even know that Let\\u2019s have sex, she said, \\\"Yes\\\", you know she ain\\u2019t \\\"no\\\" that Seed of life on my chest, my head next to her breast My mind all in the clouds, just bought an ounce of the best No talking when I\\u2019m off that loud I came quick so she pissed You know I\\u2019m good for another round But it\\u2019s hard when everybody on your dick Know real niggas that\\u2019s crips, I know real niggas that\\u2019s bloods Know real niggas that\\u2019s thugging like you ain\\u2019t know what\\u2019s up Got codeine in my cup, got a couple checks that need cashing And you could take that to the bank, what\\u2019s life without a balance? You ain't even know it, nigga, I be everywhere you ain\\u2019t even going I thought it was snowing, but I\\u2019m just the coldest nigga out here flowin' Sick of all that bullshit y\\u2019all been promoting, but (Soul!) Carson in the motherfucking house Del Amo, watch your motherfucking mouth I took the game by storm, just to X men out I'm crazy out my mind, I put my life on the line The tortoise only makes progress when his neck sticks out Just a little token of gold if you ain't know it, though Respect, I get the utmost I'm so dope I'm a walking kilo 36 Os, you don't even know I'm gettin' cheese like Cheetos You mad that we BMFing, bitch-ass niggas steady PMSing I never show my hands, can't know my plans Gotta keep them guessing Rock, I was off the scene Now a nigga back like a four and a half Shooting up the set like Spielberg See the big picture when them hammers flash I don't post a lot on Instagram That's the quickest way they'll get you, man Leave that shit for the bitches man Alphabet boys, they'll get your ass IRS, they was on a nigga Cashed them out, now I'm scot-free Got my passport in my JanSport, now I'm overseas You don't even know it Rock been killin' this shit, no gloves, no mask on me Just 100 thousand cash on me Back then, I was doing bad, homie All my bitches bad now My old hoes try to keep tabs on me Safe to say I'm the man now Fuck ass nigga just stand down 'Fore the shots go up and it's man down Hands down, still popping No prescription, I'm flexing Suplex a pussy, I've been off the edge Too late to push me, nigga I ain't fell off Used to move Frosted Flakes like Kellogg's Pull up to the bank, count paper like tellers Top Dawg, Money Gang, bitch, we've been on Clothesline the beat, nigga, John Cena Been having stripes, can't walk in my Adidas Kicked in the door, hand on the Nina Black Hippy shit, rock gon' bleed 'em I\\u2019m turned up every day, you don\\u2019t even know it Got your bitch with me right now, you don\\u2019t even know it We turn up in the club, you don\\u2019t even know it Got a hundred bottles comin\\u2019, you don\\u2019t even know it We came up from nothin\\u2019, you don\\u2019t even know it Drive a half a million dollar car, you don\\u2019t even know it This a thousand dollar pair of shoes, you don\\u2019t even know it Got a bitch that speak no English, she don\\u2019t even know it This a thousand dollar pair of shoes, you don't even know it This a thousand dollar cup of lean, you don't even know it This a half a million dollar car, you don't even know it I came up from the bottom, you don't even know it My niggas all ride with me on, you don't even know it Got killers with me right now, you don't even know it This a million dollar watch nigga, you don't even know it Got a million dollar crib nigga, you don't even know it  \"}", "Beyonce-freedom": "\" Tryna rain, tryna rain on the thunder Tell the storm I'm new I'ma walk, I'ma march on the regular Painting white flags blue Lord, forgive me, I've been running Running blind in truth I'ma rain, I'ma rain on this bitter love Tell the sweet I'm new I'm telling these tears, \\\"Go and fall away, fall away,\\\" oh May the last one burn into flames Freedom! Freedom! I can't move Freedom, cut me loose! Yeah Freedom! Freedom! Where are you? 'Cause I need freedom, too! I break chains all by myself Won't let my freedom rot in hell Hey! I'ma keep running 'Cause a winner don't quit on themselves I'ma wade, I'ma wave through the waters Tell the tide, \\\"Don't move\\\" I'ma riot, I'ma riot through your borders Call me bulletproof Lord, forgive me, I've been runnin' Runnin' blind in truth I'ma wade, I'ma wave through your shallow love Tell the deep I'm new I'm telling these tears, \\\"Go and fall away, fall away,\\\" oh May the last one burn into flames Freedom! Freedom! I can't move Freedom, cut me loose! Freedom! Freedom! Where are you? 'Cause I need freedom, too! I break chains all by myself Won't let my freedom rot in hell Hey! I'ma keep running Cause a winner don't quit on themselves Ten Hail Marys, I meditate for practice Channel 9 news tell me I'm movin' backwards Eight blocks left, death is around the corner Seven misleadin' statements 'bout my persona Six headlights wavin' in my direction (Come on) Five-O askin' me what's in my possession Yeah, I keep runnin', jump in the aqueducts Fire hydrants and hazardous Smoke alarms on the back of us But mama, don't cry for me, ride for me Try for me, live for me Breathe for me, sing for me Honestly guidin' me I could be more than I gotta be Stole from me, lied to me, nation hypocrisy Code on me, drive on me Wicked, my spirit inspired me, like yeah Open correctional gates in higher desert (Yeah) Open our mind as we cast away oppression (Yeah) Open the streets and watch our beliefs And when they carve my name inside the concrete I pray it forever reads Freedom! Freedom! I can't move Freedom, cut me loose! Freedom! Freedom! Where are you? 'Cause I need freedom, too! I break chains all by myself Won't let my freedom rot in hell Hey! I'ma keep running 'Cause a winner don't quit on themselves What you want from me? Is it truth you seek? Oh, father, can you hear me? What you want from me? Is it truth you seek? Oh, father, can you hear me? Hear me out I had my ups and downs, but I always find the inner strength to pull myself up. I was served lemons, but I made lemonade.  \"}", "Kendrick-lamar-untitled-07-2014-2016": "\" Pimp-pimp! (Hooray!) Pimp-pimp! (Hooray!) (Hooray!) Pimp-pimp! (Hooray!) (Hooray!) Love won't get you high as this Drugs won't get you high as this Fame won't get you high as this Chains won't get you high as this Juice won't get you high as this Crew won't get you high as this Hate won't get you high as this Levitate, levitate, levitate, levitate, uh Love won't get you high as this Drugs won't get you high as this Fame won't get you high as this Chains won't get you high as this Juice won't get you high as this Levitate, levitate, levitate, levitate Life won't get you high like this here, no He won't get you high like this here, no She won't get you high like this here, no \\\"For Free?\\\" won't get you high like this here, no Two keys won't get you high, no, no, no Bentleys won't get you high, like, no Levitate, levitate, levitate, levitate Life won't get you high, no, no, no He won't get you high, no, no, no She won't get you high, no, no, no \\\"For Free?\\\" won't get you high, no, no, no Two keys won't get you high, no, no, no Bentleys won't get you high, no, no, no Bars won't get you high, no, no, no Levitate, levitate, levitate, levitate Shut your fuckin' mouth and get some cash, you bitch, you You be in your feelings, I be in my bag, you bitch, you Santa's reindeer better have some ass, you bitch, you Everything I'm working, gotta be the gas, you bitch, you (Don't fuck around, don't fuck around, don't fuck around, don't fuck a\\u2026) Shut your fuckin' mouth and get some cash, you bitch You be in your feelings, I be in my bag, you bitch Santa's reindeer better have some ass, you bitch Everything I'm working, gotta be the Levitate, levitate, levitate, levitate Me don't want problem (Me don't want problem) Me don't want trick (Me don't want trick) Me do want dollars (Me do want dollars) Me want it big (Me do want dollars) Me don't want problem (We ride Impalas) Me don't want trick (Me don't want trick) Me do want dollars (Me don't want trick) Levitate, levitate, levitate, levitate We don't want problem (We don't want problem) We don't want trick (We don't want trick) We do want dollar (We do want dollar) We do it big (We don't want problem) We do it big (We don't want problem) We do it big (We don't want trick) We don't want problem (We don't want problem) Levitate, levitate, levitate, levitate Compton is where I'm from Is where I'm from, where is I'm from Yeah, yeah Young Egypt Look, look I feel like Pacino in Godfather, I'm charged Our Father who art in Heaven, Kendrick at large Came in the game with a plan of beatin' the odds What an accomplishment, broken promises Kept my focus anonymous till I dealt with the consequence The greatest, the latest mogul, you know what time it is You niggas fear me like y'all fear God You sound frantic, I hear panic in your voice Just know the mechanics of making your choice and writin' your bars Before you poke out your chest, loosen your bra Before you step out of line and dance with the star I could never end a career if it never start The murderous capital, avenues lookin' like evil dead zombies With batteries to the head The flattery of watchin' my stock rise The salary, the compensation tripled my cock size I run through these stop signs with no brake fluid Just premium gas, do it for dolo Crash markets and prejudiced tags, look at my photo Black excellence, pessimist died countin' my coin Hope it's evident that I inspired a thousand emcees to do better I blew cheddar on youth centers, buildings and Bimmers and blue leather Forecastin' my future, this is the future The mastermind until my next album, more power to you *Gunshot* Come on, come on, come on, come on Come on, come on, come on, come on, come on Come on, come on, come on, come on (Hell yeah), come on Come on, come on, come on, come on Come on, come on This is a fifteen minute song (Ahahaha) We're just jammin' out, we on stage Taz, we just jammin' out (Shhh) Hundred thousand (Aw, yeah, aw, shit, hahahaha) Hundred thousand, you gotta see it! Look, look, look, go back to the down note They all sing this shit, everybody Now I don't let you down, down for You see, you see, you see, you see (Right) But I don't shake you down, dog for you, you, you, you, uh They say the government ain't the truth, truth, (Mhm) truth, truth And the politicians always mislead the youth, youth, youth, youth But head is the answer Head is the future Don't second guess yourself Come on, give me some help Hey one more time, band, I need y'all to help me out right now (Hahahaha) Head is the answer (Yeah) Head is the futu\\u2014it's the future, that nigga said Don't second guess yourself (Crazy, holy shit, hahaha) Come on, give me some help Say come on, come on, come on, come on, come on Come on, come on\\u2014my background singer\\u2014come on, come on (Right, yeah, yeah, yeah) Say, come on, come on, come on, come on, come on Come on, come on, come on, come on I said, girl you make me wanna, uh Great, the\\u2014the ho's screaming now, uh (Hahahaha) I said baby you make You make me wanna just, ah! Baby, (Hahahaha) you got me speechless right now (Hahaha, you gotta take it there) I gotta take it there, I ain't even playin' no more Uh, said you just make me wanna drag you down To the ground, to the ground Like bam, bam, bam, bam, bam Ju\\u2014you just make me wanna drag you down To\\u2014down, around like bam, bam, bam, bam, bam And, baby, if your mama's around, if your mama's around If your mama's around, if your mama's around Tell her, tell her No discrimination (Haha), she young nigga chasin' (Ahahah!) And she can get this dick too! I said come on, come on, come on, come on, come on, come on Yeah, nigga You gotta do it, man We gonna lay that shit We gonna lay that shit man, and watch what it's gon' do  \"}", "Future-mask-off-remix": "\" Call it how it is Hendrix I promise, I swear, I swear If Young Metro don't trust you, I\\u2019m gon' shoot you You heard, spit it, yo Percocets, molly, Percocets Percocets, molly, Percocets Rep the set, gotta rep the set Chase a check, never chase a bitch Mask on, fuck it, mask off Mask on, fuck it, mask off Percocets, molly, Percocets Chase a check, never chase a bitch Don't chase no bitches Two cups, toast up with the gang From food stamps to a whole 'nother domain Out the bottom, I'm the livin' proof (super) Ain't compromising, half a million on a coupe Drug houses, lookin' like Peru Graduated, I was overdue Pink molly, I can barely move Ask about me, I'm gon' bust a move Rick James, thirty-three chains Ocean air, cruisin' Biscayne Top off, that\\u2019s a liability Hit the gas, boostin' my adrenaline Percocets, molly, Percocets Percocets, molly, Percocets Rep the set, gotta rep the set Chase a check, never chase a bitch Mask on, fuck it, mask off Mask on, fuck it, mask off Percocets, Molly, Percocets Chase a check, never chase a bitch Don't chase no bitches Four-door Maybach, I drive anything Buy my Range, make 'em go insane (Oh my Lord, praise him be) DJ EscoMoe City Uh, I got a halo I level up every time God say so Shooter on payroll Lookin' like Pancho, lookin' like Pedro Money tree from Tarzan Ten dividends gon' grow when I say \\\"grow\\\" Kung Fu Kenny with the Midas touch Ain't no penny that I don't touch All my enemy bite on dust Ain't no talkin' when it's fatal Havin' heart, I can't tell Half of y'all might need help I might fall in Rodeo (bitch) I might ball in Australia (say no more) I might call her for real (say no more) All the ass gon' unveil Wind blows in the windows And I snuck in when the vent close She copy like 10-4 Know who we sent for Platinum, platinum, platinum Gotta look at self and ask what happened How y'all let a conscious nigga go commercial While only makin' conscious albums? How y'all let the braids on TV? How y'all let the hood at the table? Now y'all don't even know how to rate him Niggas lookin' like I'm a created player Everybody who didn't pay respect Gotta 'fess up now and pay ya debts Gotta lay somethin' down if makin' threats Gotta say somethin' now, don't hold ya breath I mean, I'm floatin', I got the sauce, got the potion I got 'em all in convulsions and emotions I put careers in negotions And put the body in the ocean I made an oath when my nigga told me to go in Then he died on a cold bench All my old friends livin' life on a slow end Gotta keep shit rollin', it's deep (it's deep) I done fucked so much, I can't sleep I done fucked so much, I'm retired (swear to God) I'm 'bout to live my life through Dave Free (swear to God) She said she broke down when Prince died (it's alright) Bitch, my hair down, Prince live through me (I am Prince) Get your ass up and be inspired (get inspired) You know how many bodies in the street? (how many?) Take the mask off so you can see Percocets, molly, Percocets Percocets, molly, Percocets Rep the set, gotta rep the set Chase a check, never chase a bitch Mask on, fuck it, mask off Mask on, fuck it, mask off Percocets, molly, Percocets Chase a check, never chase a bitch Don't chase no bitches Mask on, fuck it, mask off Mask on, fuck it, mask off Mask on, fuck it, mask off Gas gone, never nod off Vengeance is mine, said the Lord  \"}", "Kendrick-lamar-momma": "\" Oh shit! I need that I need that sloppy, that sloppy Like a Chevy in quicksand Yeah, that sloppy This feelin' is unmatched This feelin' is brought to you by adrenaline and good rap Black Pendleton ball cap (West, west, west) We don't share the same synonym, fall back (West, west, west) Been in it before internet had new acts Mimicking radio's nemesis made me wack My innocence limited, the experience lacked Ten of us with no tentative tactic that cracked The mind of a literate writer, but I did it in fact You admitted it once I submitted it wrapped in plastic Remember scribblin', scratchin' diligent sentences backwards Visiting freestyle cyphers for your reaction Now I can live in a stadium, pack it the fastest Gamblin' Benjamin benefits, sinnin' in traffic Spinnin' women in cartwheels, linen fabric on fashion Winnin' in every decision Kendrick is master that mastered it Isn't it lovely how menaces turned attraction? Pivotin' rappers, finish your fraction while writing blue magic Thank God for rap, I would say it got me a plaque But what's better than that? The fact it brought me back home We been waitin' for you Waitin' for you Waitin' for you Waitin' for you I know everything I know everything, know myself I know morality, spirituality, good and bad health I know fatality might haunt you I know everything, I know Compton I know street shit, I know shit that's conscious I know everything, I know lawyers, advertisement, their sponsors I know wisdom, I know bad religion, I know good karma I know everything, I know history I know the universe works mentally I know the perks of bullshit isn't meant for me I know everything, I know cars, clothes, hoes, and money I know loyalty, I know respect, I know those that's ornery I know everything, the highs, the lows, the groupies, the junkies I know if I'm generous at heart, I don't need recognition The way I'm rewarded, well, that's God's decision I know you know that line's for Compton School District Just give it to the kids, don\\u2019t gossip 'bout how it was distributed I know how people work I know the price of life, I'm knowin' how much it\\u2019s worth I know what I know and I know it well not to ever forget Until I realized I didn\\u2019t know shit The day I came home We been waitin' for you Waitin' for you Waitin' for you Waitin' for you I met a little boy that resembled my features Nappy afro, gap in his smile Hand-me-down sneakers bounced through the crowd Run a number on man and woman that crossed him Sun beamin' on his beady beads, exhausted Tossin' footballs with his ashy black ankles Breakin' new laws mama passed on home trainin' He looked at me and said, \\\"Kendrick, you do know my language You just forgot because of what public schools had painted Oh, I forgot, 'Don't Kill My Vibe', that's right, you're famous I used to watch on Channel 5, TV was taken But never mind, you're here right now, don't you mistake it It's just a new trip, take a glimpse of your family's ancestor Make a new list of everything you thought was progress And that was bullshit I know your life is full of turmoil Spoiled by fantasies of who you are, I feel bad for you I can attempt to enlighten you without frightenin' you If you resist, I'll back off quick, go catch a flight or two But if you pick destiny over rest in peace Then be an advocate, tell your homies especially To come back home\\\" This is a world premiere This is a world premiere This is a world premiere I been lookin' for you my whole life, an appetite For the feeling I can barely describe, where you reside? Is it in a woman, is it in money or mankind? Tell me something, got me losing my mind, ah! You make me wanna jump Jump, jump, jump, jump Let's talk about love Jump, jump, jump, jump Let's talk about love Jump, jump, jump, jump Let's talk about love Jump, jump, jump, jump Let's talk about love I been lookin' for you my whole life, an appetite For the feeling I can barely describe, where you reside? Is it in a woman, is it in money, or mankind? Tell me something, think I'm losing my mind, ah! I say, where you at? From the front to the back I'm lookin' for you, I react only when you react Ah, I thought I found you, back in the ghetto When I was seventeen with the .38 Special Maybe you're in a dollar bill, maybe you're not real Maybe only the wealthy get to know how you feel Maybe I'm paranoid, ha, maybe I don't need you anyway Don't lie to me, I'm suicidal anyway I can be your advocate I can preach for you if you tell me what the matter is  \"}"}