{"Childish-gambino-heartbeat": "\" I wanted you to know That I am ready to go, heartbeat My heartbeat I wanted you to know Whenever you are around, can't speak I can't speak I wanted you to know That I am ready to go, heartbeat My heartbeat I wanted you to know Whenever you are around, can't speak I can't speak I know what your boy like Skinny tie and a cuff type He go and make breakfast You walk around naked I might just text you Turn your phone over, when it's all over No settling down, my text go to your screen You know better than that I come around when you least expect me I'm sitting at the bar when your glass is empty You thinking that this song's coming on to tempt me I need to be alone like the way you left me You start calling, you start crying I come over, I'm inside you I can't find you, the girl that I once had But the sex that we have isn't half bad Text say that \\\"It's not fair\\\" That's code for \\\"He's not here\\\" And I'ma flirt with this new girl And I'ma call if it don't work So we fuck 'til we come to conclusions All the things that we thought we were losing I'm a ghost and you know this That's why we broke up in the first place 'Cause I wanted you to know That I am ready to go, heartbeat My heartbeat I wanted you to know Whenever you are around, can't speak I can't speak I wanted you to know That I am ready to go, heartbeat My heartbeat I wanted you to know Whenever you are around, can't speak I can't speak It's late night Thursday I know that you heard me But you don't want the same thing Well two can play that game So I'm chilling with my girlfriend But she not my real girlfriend She got a key to my place but She's not my real girlfriend Stupid, so dummy Say the wrong thing and wrong girls come runnin' I'm paranoid that these girls want something from me And it's hard to make a dime go 100 And my dude freakin' out over a worse fate She on time, but she late for they first date Cause he went and tried out a new condom Slipped off in a threesome, good problems? Right? Wrong Askin' him if she wanna play games With the Super Smash Brothers, but none of them you I miss the sex when you kiss whenever you through 69 is the only dinner for two I was wrong, but would you have listened to you? Uh, you were crazy I got a heart, but the artichoke Is the only thing girls want when you in that smoke And light I wanted you to know That I am ready to go, heartbeat My heartbeat I wanted you to know Whenever you are around, can't speak I can't speak I wanted you to know That I am ready to go, heartbeat My heartbeat I wanted you to know Whenever you are around, can't speak I can't speak So we're done? This the real shit? We used to hold hands like field trips I'm a jerk, but your dude is a real dick I read his post on your wall and I feel sick He ain't cool, he ball and all that But he just a fake nigga who blog in all caps You couldn't wait to date I'm going straight for your thighs like the cake you ate I give a fuck about the niggas that you say you ate You know that I\\u2019m the best when I\\u2019m a-fake-tionate I'm the best that you had, face it J and Keyshia are related: racist I give you money, then you burn me, then you made off She ain't a killer, but she'd fucking blow your head off I know he wondering, \\\"What the fuck you hiding?\\\" That we dated like raps about Bin Laden Ayo, fuck this Are we dating? Are we fucking? Are we best friends? Are we something? In between that? I wish we never fucked, and I mean that  (But not really, you say the nastiest shit in bed and it\\u2019s fuckin\\u2019 awesome)  \"}", "Daft-punk-get-lucky": "\" Like the legend of the phoenix All ends with beginnings What keeps the planet spinning The force from the beginning We've come too far To give up who we are So let's raise the bar And our cups to the stars She's up all night to the sun, I'm up all night to get some She's up all night for good fun, I'm up all night to get lucky We're up all night to the sun, we're up all night to get some We're up all night for good fun, we're up all night to get lucky We're up all night to get lucky, we're up all night to get lucky We're up all night to get lucky, we're up all night to get lucky The present has no ribbon Your gift keeps on giving What is this I'm feeling? If you want to leave, I'm with it We've come too far To give up who we are So let's raise the bar And our cups to the stars She's up all night to the sun, I'm up all night to get some She's up all night for good fun, I'm up all night to get lucky We're up all night to the sun, we're up all night to get some We're up all night for good fun, we're up all night to get lucky We're up all night to get lucky, we're up all night to get lucky We're up all night to get lucky, we're up all night to get lucky We're up all night to get We're up all night to get We're up all night to get We're up all night to get We're up all night to get We're up all night to get We're up all night to get (Lucky) We're up all night to get We're up all night to get lucky We're up all night to get lucky We're up all night to get lucky We're up all night to get lucky We're up all night to get lucky We're up all night to get lucky We're up all night to get lucky We're up all night to get lucky We've come too far To give up who we are So let's raise the bar And our cups to the stars She's up all night to the sun, I'm up all night to get some She's up all night for good fun, I'm up all night to get lucky We're up all night to the sun, we're up all night to get some We're up all night for good fun, we're up all night to get lucky We're up all night to get lucky, we're up all night to get lucky We're up all night to get lucky, we're up all night to get lucky We're up all night to get lucky We're up all night to get lucky We're up all night to get lucky We're up all night to get lucky  \"}", "Eminem-rock-bottom": "\" Ayo, this song is dedicated To all the happy people All the happy people who have real nice lives And have no idea what it's like to be broke as fuck I feel like I'm walkin' a tight rope without a circus net Poppin' Percocet, I'm a nervous wreck I deserve respect but I work a sweat for this worthless check I'm 'bout to burst this TEC at somebody to reverse this debt Minimum wage got my adrenaline caged Full of venom and rage, 'specially when I'm engaged And my daughter's down to her last diaper, it's got my ass hyper I pray that God answers, maybe I'll ask nicer Watchin' ballers while they flossin' in they Pathfinders These overnight stars becomin' autograph-signers We all long to blow up and leave the past behind us Along with the small fries and average half-pinters But player-haters turnin' bitch like they have vaginas 'Cause we see them dollar signs and let the cash blind us Money'll brainwash you and leave yo' ass mindless Them snakes slither in the grass, spineless That's rock bottom, when this life makes you mad enough to kill That's rock bottom, when you want somethin' bad enough to steal That's rock bottom, when you feel like you've had it up to here 'Cause you mad enough to scream, but you sad enough to tear That's rock bottom, when this life makes you mad enough to kill That's rock bottom, when you want somethin' bad enough to steal That's rock bottom, when you feel like you've had it up to here 'Cause you mad enough to scream, but you sad enough to tear My life is full of empty promises and broken dreams I'm hopin' things look up, but there ain't no job openings I feel discouraged, hungry and malnourished Livin' in this house with no furnace, unfurnished And I'm sick of workin' dead-end jobs with lame pay And I'm tired of bein' hired and fired the same day But fuck it, if you know the rules to the game, play 'Cause when we die, we know we all goin' the same way 'Cause it's cool to be the player, but it sucks to be the fan When all you need is bucks to be the man, plus a luxury sedan Or comfortable and roomy in a 6 But they threw me in the mix with all these gloomy lunatics Who walk around depressed, and smoke a pound of cess a day And yesterday went by so quick, it seems like it was just today My daughter wants to throw the ball, but I'm too stressed to play Live half my life and throw the rest away That's rock bottom, when this life makes you mad enough to kill That's rock bottom, when you want somethin' bad enough to steal That's rock bottom, when you feel like you've had it up to here 'Cause you mad enough to scream, but you sad enough to tear That's rock bottom, when this life makes you mad enough to kill That's rock bottom, when you want somethin' bad enough to steal That's rock bottom, when you feel like you've had it up to here 'Cause you mad enough to scream, but you sad enough to tear There's people that love me and people that hate me (Yup) But it's the evil that made me This backstabbin', deceitful and shady (Mhm) I want the money, the women, the fortune and fame That means I end up burnin' in Hell, scorchin' in flame That means I'm stealin' your checkbook and forgin' your name This lifetime bliss for eternal torture and pain 'Cause right now, I feel like I've just hit the rock bottom I've got problems, now everybody on my block's got 'em (Duh) I'm screamin' like them two cops when 2Pac shot 'em Holdin' two Glocks, hope your doors got new locks on 'em My daughter's feet ain't got no shoes or socks on 'em And them rings you wearin' look like they got a few rocks on 'em And while you flaunt 'em I could be takin' 'em to shops to pawn 'em I got a couple of rings and a brand-new watch, you want 'em? 'Cause I ain't never went gold off one song I'm runnin' up on someone's lawn with guns drawn That's rock bottom, when this life makes you mad enough to kill That's rock bottom, when you want somethin' bad enough to steal That's rock bottom, when you feel like you've had it up to here 'Cause you mad enough to scream, but you sad enough to tear That's rock bottom, when this life makes you mad enough to kill That's rock bottom, when you want somethin' bad enough to steal That's rock bottom, when you feel like you've had it up to here 'Cause you mad enough to scream, but you sad enough to tear That's rock bottom  \"}", "Akon-smack-that": "\" Shady, Konvict, Upfront Akon, Slim Shady I see the one, could she be that lady? Ayy I feel you creepin', I can see you from my shadow Wanna jump up in my Lamborghini Gallardo? Maybe go to my place and just kick it like Tae Bo? And possibly bend you over? Look back and watch me Smack that, all on the floor Smack that, give me some more Smack that, 'til you get sore Smack that, oh-oh-oh-oh-oh Smack that, all on the floor Smack that, give me some more Smack that, 'til you get sore Smack that, oh-oh-oh-oh-oh Upfront style, ready to attack now Pull in the parking lot slow with the 'Lac down Konvict's got the whole thing packed now Step in the club and wardrobe intact now I feel it, dawnin' cracked now Ooh, I see it dull and backed now I'ma call her, then I put the mack down Money no problem, pocket full of that now I feel you creepin', I can see you from my shadow Wanna jump up in my Lamborghini Gallardo? Maybe go to my place and just kick it like Tae Bo? And possibly bend you over? Look back and watch me Smack that, all on the floor Smack that, give me some more Smack that, 'til you get sore Smack that, oh-oooh Smack that, all on the floor Smack that, give me some more Smack that, 'til you get sore Smack that, oh-oh-oh-oh-oh Oh, looks like another club banger They better hang on when they throw this thang on Get a little drink on, they gon' flip For this Akon shit, you can bank on it Pedicure, manicure, kitty-cat claws The way she climbs up and down them poles Lookin' like one of them Putty-Cat Dolls Tryin' to hold my woodie back through my drawers Steps upstage, didn't think I saw her Creeps up behind me, and she's like \\\"You're \\u2014\\\" I'm like, \\\"I know, let's cut to the chase\\\" No time to waste, back to my place Plus from the club to the crib, it's like a mile away Or more like a palace, shall I say And plus, I got a pal if your gal is game In fact, he's the one singin' the song that's playin' (Akon!) I feel you creepin', I can you see from my shadow Wanna jump up in my Lamborghini Gallardo? Maybe go to my place and just kick it like Tae Bo? And possibly bend you over? Look back and watch me Smack that, all on the floor Smack that, give me some more Smack that, 'til you get sore Smack that, oh-oooh Smack that, all on the floor Smack that, give me some more Smack that, 'til you get sore Smack that, oh-oooh Eminem's rollin', D and 'em rollin' Bu and all marvelous, them rollin' Women just ho-in', big booty rollin' Soon, I'll be all in them and throwin' D (D) Hittin' no less than three (Three) Block wheel style like whee (Whee) Girl, I can tell you want me, because lately I feel you creepin', I can see you from my shadow Wanna jump up in my Lamborghini Gallardo? Maybe go to my place and just kick it like Tae Bo? And possibly bend you over? Look back and watch me Smack that, all on the floor Smack that, give me some more Smack that, 'til you get sore Smack that, oh-oooh Smack that, all on the floor Smack that, give me some more Smack that, 'til you get sore Smack that, oh-oh-oh-oh-oh  \"}", "Kanye-west-homecoming": "\" Yeah And you say Chi city! Chi city! Chi city! I'm comin' home again Do you think about me now and then? (Yeah) Do you think about me now and then? 'Cause I'm comin' home again (Ow!) -Min' home again I met this girl when I was three years old And what I loved most, she had so much soul She said, \\\"Excuse me, little homie, I know you don't know me But my name is Windy and I like to blow trees.\\\" And from that point, I never blow her off Niggas come from out of town, I like to show her off They like to act tough, she like to toe 'em off And make 'em straighten up their hat 'cause she know they soft And when I grew up, she showed me how to go downtown In the nighttime, her face lit up, so astoundin' I told her in my heart is where she'll always be She never messed with entertainers 'cause they always leave She said, \\\"It felt like they walked and drove on me.\\\" Knew I was gang affiliated, got on TV and told on me I guess that's why last winter she got so cold on me She said, \\\"'Ye, keep makin' that, keep makin' that platinum and gold for me!\\\" I'm comin' home again Do you think about me now and then? Do you think about me now and then? 'Cause I'm comin' home again -Min' home again Do you think about me now and then? Do you think about me now and then? Oh! Now I'm comin' home again Maybe we can start again But if you really cared for her Then you wouldn't've never hit the airport to follow your dreams Sometimes I still talk to her But when I talk to her, it always seems like she talkin' 'bout me She said, \\\"You left your kids, and they just like you They wanna rap and make soul beats just like you But they just not you,\\\" and I just got through Talkin' 'bout what niggas tryin' to do: just not new Now everybody got the game figured out all wrong I guess you never know what you got 'til it's gone I guess that's why I'm here and I can't come back home And guess when I heard that? When I was back home Every interview, I'm representin' you, makin' you proud Reach for the stars, so if you fall, you land on a cloud Jump in the crowd, spark your lighters, wave 'em around If you don't know by now, I'm talkin' 'bout Chi-Town I'm comin' home again Do you think about me now and then? Do you think about me now and then? 'Cause I'm comin' home again -Min' home again Baby, do you remember when Fireworks at Lake Michigan? Oh! Now I'm comin' home again -Min' home again Baby, do you remember when Fireworks at Lake Michigan? Oh! Now I'm comin' home again Maybe we can start again Loy-oy-al, loy-oy-al Comin' home again Loy-oy-al, loy-oy-al Comin' home again Maybe we can start again  \"}", "Daft-punk-instant-crush": "\" I didn't want to be the one to forget I thought of everything I'd never regret A little time with you is all that I get That's all we need because it's all we can take One thing I never see the same when you're 'round I don\\u2019t believe in him, his lips on the ground I wanna take you to that place in the \\u201cRoche\\u201d But no one gives us any time anymore He asks me once if I\\u2019d look in on his dog You made an offer for it, then you ran off I got this picture of us kids in my head And all I hear is the last thing that you said \\\"I listened to your problems, now listen to mine\\\" I didn't want to anymore, oh-oh-oh And we will never be alone again 'Cause it doesn't happen every day Kinda counted on you being a friend Can I give it up or give it away? Now I thought about what I wanna say But I never really know where to go So I chained myself to a friend 'Cause I know it unlocks the door And we will never be alone again 'Cause it doesn't happen every day Kinda counted on you being a friend Gotta give it up or give it away Now I thought about what I wanna say But I never really know where to go So I chained myself to a friend Some more again It didn't matter what they wanted to see He thought he saw someone that looked just like me The summer memory that just never dies We worked too long and hard to give it no time He sees right through me, it's so easy with lies Cracks in the road that I would try and disguise He runs his scissors at the seam in the wall He cannot break it down or else he would fall One thousand lonely stars hiding in the cold Take it, oh I don't wanna sing anymore \\\"I listened to your problems, now listen to mine\\\" I didn't want to anymore, oh-oh-oh And we will never be alone again 'Cause it doesn't happen every day Kinda counted on you being a friend Can I give it up or give it away? Now I thought about what I wanna say But I never really know where to go So I chained myself to a friend 'Cause I know it unlocks the door And we will never be alone again 'Cause it doesn't happen every day Kinda counted on you being a friend Can I give it up or give it away? Now I thought about what I wanna say But I never really know where to go So I chained myself to a friend 'Cause I know it unlocks the- I don't understand, don't get upset I'm not with you We\\u2019re swimming around, it's all I do When I'm with you And we will never be alone again 'Cause it doesn't happen every day Kinda counted on you being a friend Can I give it up or give it away? Now I thought about what I wanna say But I never really know where to go So I chained myself to a friend 'Cause I know it unlocks the door And we will never be alone again 'Cause it doesn't happen every day Kinda counted on you being a friend Can I give it up or give it away? Now I thought about what I wanna say But I never really know where to go So I chained myself to a friend 'Cause I know it unlocks the door  \"}", "Outkast-hey-ya": "\" 1, 2, 3, uh! My baby don't mess around Because she loves me so, and this I know for sure (Uh) But does she really wanna But can't stand to see me walk out the door? (Ah) Don't try to fight the feeling 'Cause the thought alone is killing me right now (Uh) Thank God for Mom and Dad For sticking to together 'cause we don't know how (C'mon) Hey ya! Hey ya! Hey ya! Hey ya! Hey ya! Hey ya! Hey ya! Hey ya! You think you've got it, oh, you think you've got it But \\u201cgot it\\u201d just don't get it 'til there's nothing at all We get together, oh, we get together But separate's always better when there's feelings involved If what they say is \\u201cNothing is forever\\u201d Then what makes, then what makes, then what makes Then what makes, what makes, what makes love the exception? So why oh, why oh, why oh, why oh, why oh Are we so in denial when we know we're not happy here? Y'all don't want to hear me, you just want to dance Hey ya! (Uh-oh) Hey ya! (Uh-oh) Don't want to meet your daddy Hey ya! (Uh-oh) Just want you in my Caddy (Uh-oh) Hey ya! (Uh-oh) Don't want to meet your mama (Uh-oh) Hey ya! Uh-oh Just want to make you cumma (Uh-oh) Hey ya! Uh-oh I'm, I'm, I'm, I'm just being honest (Uh-oh) Hey ya! I'm just being honest Hey, alright now, alright now, fellas (Yeah?) Now, what's cooler than being cool? (Ice Cold!) I can't hear ya I say what's, what's cooler than being cool? (Ice Cold!) Alright, alright, alright, alright, alright, alright, alright, alright Alright, alright, alright, alright, alright, alright Okay now, ladies (Yeah?) Now, we gon' break this thing down in just a few seconds Now don't have me break this thing down for nothing Now I want to see y'all on your baddest behavior Lend me some sugar, I am your neighbor Ah, here we go! Shake it, sh-shake it, shake it, sh-shake it (Uh-oh) Shake it, sh-shake it, Shake it, shake it, sh-shake it (Uh-oh) Shake it like a Polaroid picture, hey ya! Shake it, sh-shake it, shake it, sh-shake it Shake it, shake it (okay), shake it, sugar Shake it like a Polaroid picture Now all the Beyonc\\u00e9s and Lucy Lius And baby dolls, get on the floor You know what to do, oh, you know what to do You know what to do Hey ya! (Uh-oh) Hey ya! (Uh-oh) Hey ya! (Uh-oh) Hey ya! (Uh-oh, hey ya!) Hey ya! (Uh-oh) Hey ya! (Oh, oh, uh-oh) Hey ya! (Uh-oh) Hey ya! (Uh-oh)  \"}", "Michael-jackson-billie-jean": "\" She was more like a beauty queen from a movie scene I said, \\\"Don't mind, but what do you mean, I am the one Who will dance on the floor in the round?\\\" She said I am the one Who will dance on the floor, in the round She told me her name was Billie Jean As she caused a scene Then every head turned with eyes that dreamed of being the one Who will dance on the floor in the round People always told me, \\\"Be careful of what you do Don't go around breaking young girls' hearts\\\" (Hee-eeh) And mother always told me, \\\"Be careful of who you love And be careful of what you do (Oh-oh) 'Cause the lie becomes the truth\\\" (Oh-oh) Billie Jean is not my lover She's just a girl who claims that I am the one (Oh, baby) But the kid is not my son, hoo! She says I am the one (Oh, baby) But the kid is not my son (Hee-hee-hee, no-no-no, hee-hee-hee) Hoo! For forty days and for forty nights, the law was on her side But who can stand when she's in demand? Her schemes and plans 'Cause we danced on the floor in the round, hee! So take my strong advice, just remember to always think twice (Don't think twice) Do think twice! (Ah-hoo!) She told my baby we'd danced till three, then she looked at me Then showed a photo of a baby crying, his eyes were like mine (Oh, no) 'Cause we danced on the floor in the round, baby (Ooh, hee-hee-hee) People always told me, \\\"Be careful of what you do And don't go around breaking young girls' hearts\\\" (Don't break no hearts!) (Hee-hee) She came and stood right by me Then the smell of sweet perfume (Ha-oh) This happened much too soon (Ha-oh, ha-ooh) She called me to her room (Ha-oh, hoo!) Billie Jean is not my lover (Hoo!) She's just a girl who claims that I am the one But the kid is not my son No-no-no, no-no-no-no-no-no Billie Jean is not my lover She's just a girl who claims that I am the one (Oh baby) But the kid is not my son (Oh, no, no) She says I am the one (Oh baby) But the kid is not my son (No, hee-hee) Ah, hee-hee-hee Hee! Hoo! She says I am the one, but the kid is not my son No-no-no, hoo! (Oh) Billie Jean is not my lover She's just a girl who claims that I am the one But the kid is not my son No-no-no, no-no-no-no She says I am the one, but the kid is not my son (No-no-no) She says I am the one (You know what you did) She says he is my son (Breaking my heart babe) She says I am the one Billie Jean is not my lover Billie Jean is not my lover Billie Jean is not my lover Billie Jean is not my lover Billie Jean is not my lover (Don't call me Billie Jean) Billie Jean is not my...  \"}", "Nirvana-smells-like-teen-spirit": "\" Load up on guns, bring your friends It's fun to lose and to pretend She's over-bored and self-assured Oh no, I know a dirty word Hello, hello, hello, how low Hello, hello, hello, how low Hello, hello, hello, how low Hello, hello, hello With the lights out, it's less dangerous Here we are now, entertain us I feel stupid and contagious Here we are now, entertain us A mulatto, an albino A mosquito, my libido Yeah, hey, yay I'm worse at what I do best And for this gift, I feel blessed Our little group has always been And always will until the end Hello, hello, hello, how low Hello, hello, hello, how low Hello, hello, hello, how low Hello, hello, hello With the lights out, it's less dangerous Here we are now, entertain us I feel stupid and contagious Here we are now, entertain us A mulatto, an Albino A mosquito, my libido Yeah, hey, yay And I forget just why I taste Oh yeah, I guess it makes me smile I found it hard, it's hard to find Oh well, whatever, nevermind Hello, hello, hello, how low Hello, hello, hello, how low Hello, hello, hello, how low Hello, hello, hello With the lights out, it's less dangerous Here we are now, entertain us I feel stupid and contagious Here we are now, entertain us A mulatto, an albino A mosquito, my libido A denial, a denial, a denial, a denial, a denial A denial, a denial, a denial, a denial  \"}", "Nirvana-come-as-you-are": "\" Come as you are, as you were As I want you to be As a friend, as a friend As an old enemy Take your time, hurry up Choice is yours, don't be late Take a rest as a friend As an old memoria Memoria Memoria Memoria Come doused in mud, soaked in bleach As I want you to be As a trend, as a friend As an old memoria Memoria Memoria Memoria And I swear that I don't have a gun No, I don't have a gun No, I don't have a gun Memoria Memoria Memoria (No, I don't have a gun) And I swear that I don't have a gun No, I don't have a gun No, I don't have a gun No, I don't have a gun No, I don't have a gun Memoria Memoria  \"}", "Red-hot-chili-peppers-californication": "\" Psychic spies from China try to steal your mind's elation An' little girls from Sweden dream of silver screen quotation And if you want these kind of dreams, it's Californication It's the edge of the world and all of Western civilization The sun may rise in the east at least it's settled in a final location It's understood that Hollywood sells Californication Pay your surgeon very well to break the spell of aging Celebrity skin, is this your chin or is that war you're waging? First born unicorn Hardcore soft porn Dream of Californication Dream of Californication Dream of Californication Dream of Californication Marry me, girl, be my fairy to the world, be my very own constellation A teenage bride with a baby inside getting high on information And buy me a star on the boulevard, it's Californication Space may be the final frontier but it's made in a Hollywood basement And Cobain, can you hear the spheres singing songs off Station to Station? And Alderaan's not far away, it's Californication Born and raised by those who praise control of population Well, everybody's been there and I don't mean no vacation First born unicorn Hardcore soft porn Dream of Californication Dream of Californication Dream of Californication Dream of Californication Destruction leads to a very rough road but it also breeds creation And earthquakes are to a girl's guitar they're just another good vibration And tidal waves couldn't save the world from Californication Pay your surgeon very well to break the spell of aging Sicker than the rest, there is no test but this is what you're craving First born unicorn Hardcore soft porn Dream of Californication Dream of Californication Dream of Californication Dream of Californication  \"}", "Red-hot-chili-peppers-snow-hey-oh": "\" Come to decide that the things that I tried Were in my life just to get high on When I sit alone, come get a little known But I need more than myself this time Step from the road to the sea to the sky And I do believe that we rely on When I lay it on, come get to play it on All my life to sacrifice Hey, oh Listen what I say, oh I got your hey, oh Now listen what I say, oh When will I know that I really can't go To the well once more time to decide on When it's killing me, when will I really see All that I need to look inside? Come to believe that I better not leave Before I get my chance to ride When it's killing me, what do I really need All that I need to look inside? Hey, oh Listen what I say, oh Come back and hey, oh Look at what I say, oh The more I see, the less I know The more I like to let it go Hey oh, whoa-whoa Deep beneath the cover of another perfect wonder Where it's so white as snow Privately divided by a world so undecided And there's nowhere to go In between the cover of another perfect wonder And it's so white as snow Running through the field where all my tracks will be concealed And there's nowhere to go Ho! When to descend to amend for a friend All the channels that have broken down Now you bring it up, I'm gonna ring it up Just to hear you sing it out Step from the road to the sea to the sky And I do believe what we rely on When I lay it on, come get to play it on All my life to sacrifice Hey, oh Listen what I say, oh I got your hey, oh Listen what I say, oh The more I see, the less I know The more I like to let it go Hey oh, whoa-whoa Deep beneath the cover of another perfect wonder Where it's so white as snow Privately divided by a world so undecided And there's nowhere to go In between the cover of another perfect wonder Where it's so white as snow Running through the field where all my tracks will be concealed And there's nowhere to go I said hey, hey yeah Oh yeah, tell my love now Hey, hey yeah Oh yeah, tell my love now Deep beneath the cover of another perfect wonder Where it's so white as snow Privately divided by a world so undecided And there's nowhere to go Deep beneath the cover of another perfect wonder Where it's so white as snow Running through the field where all my tracks will be concealed And there's nowhere to go I said hey, oh yeah (Ooh) Oh yeah, tell my love now (Ooh) Hey, hey yeah, oh yeah (Ooh-ooh-ooh) Ooh-ooh Ooh-ooh  \"}", "Metallica-nothing-else-matters": "\" So close no matter how far Couldn't be much more from the heart Forever trusting who we are And nothing else matters Never opened myself this way Life is ours, we live it our way All these words I don't just say And nothing else matters Trust I seek and I find in you Everyday for us something new Open mind for a different view And nothing else matters Never cared for what they do Never cared for what they know But I know So close no matter how far It couldn't be much more from the heart Forever trusting who we are And nothing else matters Never cared for what they do Never cared for what they know But I know I never opened myself this way Life is ours, we live it our way All these words I don't just say And nothing else matters Trust I seek and I find in you Everyday for us something new Open mind for a different view And nothing else matters Never cared for what they say Never cared for games they play Never cared for what they do Never cared for what they know And I know, yeah-yeah! So close no matter how far Couldn't be much more from the heart Forever trusting who we are No, nothing else matters  \"}", "Metallica-master-of-puppets": "\" End of passion play, crumbling away I'm your source of self-destruction Veins that pump with fear, sucking darkest clear Leading on your death's construction Taste me, you will see, more is all you need Dedicated to how I'm killing you Come crawling faster Obey your master Your life burns faster Obey your... Master! Master! Master of Puppets, I'm pulling your strings Twisting your mind and smashing your dreams Blinded by me, you can't see a thing Just call my name 'cause I'll hear you scream Master! Master! Just call my name 'cause I'll hear you scream Master! Master! Needlework the way, never you betray Life of death becoming clearer Pain monopoly, ritual misery Chop your breakfast on a mirror Taste me, you will see, more is all you need Dedicated to how I'm killing you Come crawling faster (faster) Obey your master (master) Your life burns faster (faster) Obey your... Master! Master! Master of Puppets, I'm pulling your strings Twisting your mind and smashing your dreams Blinded by me, you can't see a thing Just call my name 'cause I'll hear you scream Master! Master! Just call my name 'cause I'll hear you scream Master! Master! (Master, master, master, master...) Master! Master! Where\\u2019s the dreams that I\\u2019ve been after? Master! Master! You promised only lies Laughter! Laughter! All I hear or see is laughter Laughter! Laughter! Laughing at my cries Fix me! Hell is worth all that, natural habitat Just a rhyme without a reason Never-ending maze, drift on numbered days Now, your life is out of season I will occupy, I will help you die I will run through you, now I rule you too Come crawling faster (faster) Obey your master (master) Your life burns faster (faster) Obey your... Master! Master! Master of puppets, I'm pulling your strings Twisting your mind and smashing your dreams Blinded by me, you can't see a thing Just call my name 'cause I'll hear you scream Master! Master! Just call my name 'cause I'll hear you scream Master! Master! \"}", "Dr-dre-whats-the-difference": "\" What's the difference between me and you? What's the difference between me and you? Back when Cube was rollin' with Lorenzo in a Benzo I was bangin' with a gang of instrumentals Got the pens and pencils, got down to business But sometimes the business end of this shit Can turn your friends against you But you was a real nigga, I could sense it in you I still remember the window of the car that you went through That's fucked up, but I'll never forget the shit we been through And I'ma do whatever it takes to convince you 'Cause you my nigga, Doc, and Eazy, I'm still with you Fuck the beef, nigga, I miss you And that's just being real with you You see the truth is Everybody wanna know how close me and Snoop is And who I'm still cool with Then I got these fake-ass niggas I first blew with Claimin' that they non-violent, talkin' like they (Do not resist the beat) Spit venom in interviews, speakin' on reunions Move units, then talk shit and we can do this Until then, I ain't even speakin' your name Just keep my name outta your mouth And we can keep it the same, nigga It ain't that I'm too big to listen to the rumors It's just that I'm too damn big to pay attention to 'em That's the difference What's the difference between me and you? You talk a good one, but you don't do what you supposed to do I act on what I feel and never deal with emotions I'm used to livin' big dog style and straight coastin' What's the difference between me and you? You talk a good one, but you don't do what you supposed to do I act on what I feel and never deal with emotions I'm used to livin' big dog style and straight coastin' Yo, I stay with it, while you try to perpetrate and play with it Never knew about the next level until Dre did it I stay committed while you motherfuckers babysitted I smash you critics like a overhand right from Riddick Come and get it, shitted on villains by the millions I be catchin' bitches while bitches be catchin' feelings So what the fuck am I supposed to do? I pop bottles and hot hollow-points at each and all of you A heartless bastard, high and plastered My style is like the reaction from too much acid Never come down, pass it around if you can't handle it Hang Hollywood niggas by they Soul Train laminates What's the difference between me and you? (What?) About five bank accounts, three ounces, and two vehicles Until my death, I'm Bangladesh I suggest you hold yo' breath 'til ain't none left Yo, that's the difference! What's the difference between me and you? You talk a good one, but you don't do what you supposed to do I act on what I feel and never deal with emotions I'm used to livin' big dog style and straight coastin' What's the difference between me and you? You talk a good one, but you don't do what you supposed to do I act on what I feel and never deal with emotions I'm used to livin' big dog style and straight coastin' A'ight, hold up, hold up! Stop the beat a minute, I got somethin' to say, Dre I wanna tell you this shit right now While this fuckin' weed is in me (What the fuck?) I don't know if I ever told you this But I love you, dog, I got your motherfuckin' back (Right) Just know this shit Slim, I don't know if you noticed it But I've had your back from day one, Nigga, let's blow this bitch I mean it dog, you ever need somebody offed: \\\"Whose throat is it?\\\" Well if you ever kill that Kim bitch I'll show you where the ocean is Well, that's cool, and I appreciate the offer But if I do decide to really murder my daughter's momma I'ma sit her up in the front seat and put sunglasses on her And cruise around with her for seven hours through California And have her wavin' at people (Hi!) Then drop her off on the corner at the police station And drive off honkin' the horn for her Raw dawg, get your arm gnawed off Drop the sawed off And beat you with the piece it was sawed off of Fuck blood, I wanna see some lungs coughed up Get shot up in the hot tub 'til the bubbles pop up In they nose and cough snot up, mucus in hot water That's for tryin' to talk like The Chronic was lost product That's for even thinkin' of havin' them thoughts thought up You better show some respect whenever the Doc's brought up So what's the difference between us? We can start at the penis Or we can scream \\\"I just don't give a fuck\\\" and see who means it What's the difference between me and you? You talk a good one, but you don't do what you supposed to do I act on what I feel and never deal with emotions I'm used to livin' big dog style and straight coastin' What's the difference between me and you? You talk a good one, but you don't do what you supposed to do I act on what I feel and never deal with emotions I'm used to livin' big dog style and straight coastin' What's the difference between me and-- *Gunshot*  \"}", "Pharrell-williams-happy": "\" It might seem crazy what I'm 'bout to say Sunshine she's here, you can take a break I'm a hot air balloon that could go to space With the air, like I don't care, baby, by the way (Because I'm happy) Clap along if you feel like a room without a roof (Because I'm happy) Clap along if you feel like happiness is the truth (Because I'm happy) Clap along if you know what happiness is to you (Because I'm happy) Clap along if you feel like that's what you wanna do Here come bad news, talking this and that (Yeah!) Well, give me all you got, don't hold it back (Yeah!) Well, I should probably warn ya, I'll be just fine (Yeah!) No offense to you, don\\u2019t waste your time, here's why (Because I'm happy) Clap along if you feel like a room without a roof (Because I'm happy) Clap along if you feel like happiness is the truth (Because I'm happy) Clap along if you know what happiness is to you (Because I'm happy) Clap along if you feel like that's what you wanna do Bring me down Can't nothing bring me down My level's too high to bring me down Can't nothing bring me down, I said Bring me down Can't nothing bring me down My level's too high to bring me down Can't nothing bring me down, I said (Because I'm happy) Clap along if you feel like a room without a roof (Because I'm happy) Clap along if you feel like happiness is the truth (Because I'm happy) Clap along if you know what happiness is to you (Because I'm happy) Clap along if you feel like that's what you wanna do (Because I'm happy) Clap along if you feel like a room without a roof (Because I'm happy) Clap along if you feel like happiness is the truth (Because I'm happy) Clap along if you know what happiness is to you (Because I'm happy) Clap along if you feel like that's what you wanna do Bring me down Can't nothing bring me down My level's too high to bring me down Can't nothing bring me down, I said... (Because I'm happy) Clap along if you feel like a room without a roof (Because I'm happy) Clap along if you feel like happiness is the truth (Because I'm happy) Clap along if you know what happiness is to you (Because I'm happy) Clap along if you feel like that's what you wanna do (Because I'm happy) Clap along if you feel like a room without a roof (Because I'm happy) Clap along if you feel like happiness is the truth (Because I'm happy) Clap along if you know what happiness is to you (Because I'm happy) Clap along if you feel like that's what you wanna do  \"}", "Diddy-ill-be-missing-you": "\" Every day I wake up, I hope I'm dreamin' I can't believe this shit Can't believe you ain't here Sometimes it's just hard for a nigga to wake up It's just hard to just keep goin' It's like I feel empty inside without you bein' here I would do anything man, to bring you back I'd give all this shit, shit don't mean nothing I saw your son today, he look just like you You was the greatest, you'll always be the greatest I miss you B.I.G Can't wait 'til that day, when I see your face again I can't wait 'til that day, when I see your face again Yeah, this right here (Tell me why) Goes out to everyone that has lost someone That they truly loved (C'mon, check it out) Seems like yesterday we used to rock the show I laced the track, you locked the flow So far from hangin' on the block for dough Notorious, they got to know that Life ain't always what it seem to be Words can't express what you mean to me Even though you're gone, we still a team Through your family, I'll fulfill your dream (That's right) In the future, can't wait to see If you open up the gates for me Reminisce some time, the night they took my friend Try to black it out, but it plays again When it's real, feelings hard to conceal Can't imagine all the pain I feel Give anythin' to hear half your breath (Half your breath) I know you still livin' your life after death Every step I take, every move I make Every single day, every time I pray I'll be missin' you Thinkin' of the day when you went away What a life to take, what a bond to break I'll be missin' you (I miss you B.I.G.) It's kinda hard with you not around Know you in heaven, smilin' down Watchin' us while we pray for you Every day we pray for you 'Til the day we meet again In my heart is where I'll keep you, friend Memories give me the strength I need to proceed Strength I need to believe My thoughts Big I just can't define (Can't define) Wish I could turn back the hands of time Us in the six, shop for new clothes and kicks You and me takin' flicks Makin' hits, stages they receive you on Still can't believe you're gone (Can't believe you're gone) Give anything to hear half your breath (Half your breath) I know you still livin' your life after death Every step I take, every move I make (I miss you) Every single day, every time I pray I'll be missin' you (Yeah, yeah, yeah) Thinkin' of the day when you went away What a life to take, what a bond to break I'll be missin' you Somebody tell me why One glad morning When this life is over I know I'll see your face Every night I pray, every step I take Every move I make, every single day Every night I pray, every step I take Every day that passes Is a day that I get closer Every move I make, every single day To seeing you again We miss you B.I.G Every night I pray, every step I take And we won't stop 'Cause we can't stop Every move I make, every single day That's right Every night I pray, every step I take Every move I make, every single day We miss you B.I.G Every step I take, every move I make (I miss you) Every single day, every time I pray I'll be missin' you (Yeah, yeah, yeah) Thinkin' of the day when you went away What a life to take, what a bond to break I'll be missin' you (We miss you) Every step I take, every move I make Every single day, every time I pray I'll be missin' you (I'll be missin' you) Thinkin' of the day (Thinkin' of the day) when you went away What a life to take, what a bond to break I'll be missin' you (We miss you)  \"}", "The-beatles-let-it-be": "\" When I find myself in times of trouble, Mother Mary comes to me Speaking words of wisdom, \\u201clet it be\\u201d And in my hour of darkness, she is standing right in front of me Speaking words of wisdom, \\u201clet it be\\u201d Let it be, let it be Let it be, let it be Whisper words of wisdom Let it be And when the brokenhearted people living in the world agree There will be an answer, let it be For though they may be parted, there is still a chance that they will see There will be an answer, let it be Let it be, let it be Let it be, let it be Yeah, there will be an answer Let it be Let it be, let it be Let it be, let it be Whisper words of wisdom Let it be Let it be, let it be Let it be, yeah, let it be Whisper words of wisdom Let it be And when the night is cloudy, there is still a light that shines on me Shine on 'til tomorrow, let it be I wake up to the sound of music, Mother Mary comes to me Speaking words of wisdom, let it be Let it be, let it be Let it be, yeah, let it be There will be an answer Let it be Let it be, let it be Let it be, yeah, let it be There will be an answer Let it be Let it be, let it be Let it be, yeah, let it be Whisper words of wisdom Let it be  \"}", "Muse-uprising": "\" Paranoia is in bloom The PR transmissions will resume They'll try to push drugs that keep us all dumbed down And hope that we will never see the truth around (So come on) Another promise, another seed Another packaged lie to keep us trapped in greed And all the green belts wrapped around our minds And endless red tape to keep the truth confined (So come on) They will not force us They will stop degrading us They will not control us We will be victorious (So come on) Interchanging mind control Come let the revolution take its toll If you could flick the switch and open your third eye You'd see that we should never be afraid to die (So come on) Rise up and take the power back It's time the fat cats had a heart attack You know that their time's coming to an end We have to unify and watch our flag ascend (So come on) They will not force us They will stop degrading us They will not control us We will be victorious (So come on)  Hey, hey, hey, hey Hey, hey, hey, hey They will not force us They will stop degrading us They will not control us We will be victorious (So come on)  \"}", "Iggy-pop-the-passenger": "\" I am a passenger And I ride and I ride I ride through the city's backsides I see the stars come out of the sky Yeah, they're bright in a hollow sky You know it looks so good tonight I am the passenger I stay under glass I look through my window so bright I see the stars come out tonight I see the bright and hollow sky Over the city's ripping sky And everything looks good tonight Singin' la la la la la la la la La la la la la la la la La la la la la la la la la la Get into the car We'll be the passenger We'll ride through the city tonight We'll see the city's ripped backsides We'll see the bright and hollow sky We'll see the stars that shine so bright The sky was made for us tonight Oh, the passenger How, how he rides Oh, the passenger He rides and he rides He looks through his window What does he see? He sees the sight of hollow sky He sees the stars come out tonight He sees the city's ripped backsides He sees the winding ocean drive And everything was made for you and me All of it was made for you and me 'Cause it just belongs to you and me So let's take a ride and see what's mine Singin' la la la la la la la la La la la la la la la la La la la la la la la la la la Oh, the passenger He rides and he rides He sees things from under glass He looks through his window's eye He sees the things he knows are his He sees the bright and hollow sky He sees the city asleep at night He sees the stars are out tonight And all of it is yours and mine And all of it is yours and mine So let's ride and ride and ride and ride Singin' la la la la la la la la La la la la la la la la La la la la la la la la la la Singin' la la la la la la la la La la la la la la la la La la la la la la la la la la  \"}", "David-bowie-starman": "\" Hey now, now Oh, oh, oh Didn't know what time it was, the lights were low I leaned back on my radio Some cat was layin down some rock 'n' roll \\\"Lotta soul,\\\" he said Then the loud sound did seem to fade Came back like a slow voice on a wave of phase That weren't no DJ, that was hazy cosmic jive There's a starman waiting in the sky He'd like to come and meet us But he thinks he'd blow our minds There's a starman waiting in the sky He's told us not to blow it 'Cause he knows it's all worthwhile He told me Let the children lose it Let the children use it Let all the children boogie I had to phone someone so I picked on you Hey, that's far out, so you heard him too Switch on the TV, we may pick him up on channel two Look out your window, I can see his light If we can sparkle he may land tonight Don't tell your poppa or he'll get us locked up in fright There's a starman waiting in the sky He'd like to come and meet us But he thinks he'd blow our minds There's a starman waiting in the sky He's told us not to blow it 'Cause he knows it's all worthwhile He told me Let the children lose it Let the children use it Let all the children boogie Starman waiting in the sky He'd like to come and meet us But he thinks he'd blow our minds There's a starman waiting in the sky He's told us not to blow it 'Cause he knows it's all worthwhile He told me Let the children lose it Let the children use it Let all the children boogie La, la, la, la-la, la, la, la La, la, la, la-la, la, la, la La, la, la, la-la, la, la, la La, la, la, la-la, la, la, la La, la, la, la-la, la, la, la La, la, la, la-la, la, la, la La, la, la, la-la, la, la, la La, la, la, la-la, la, la, la  \"}", "Queen-dont-stop-me-now": "\" Tonight I'm gonna have myself a real good time I feel alive And the world, I'll turn it inside out, yeah I'm floating around in ecstasy, so (Don't stop me now) (Don't stop me) 'Cause I'm havin' a good time, havin' a good time I'm a shooting star leaping through the sky Like a tiger defying the laws of gravity I'm a racing car passing by like Lady Godiva I'm gonna go, go, go, there's no stopping me I'm burning through the sky, yeah Two hundred degrees, that's why they call me Mister Fahrenheit I'm travelling at the speed of light I wanna make a supersonic man outta you (Don't stop me now) I'm having such a good time, I'm having a ball (Don't stop me now) If you wanna have a good time, just give me a call (Don't stop me now) 'Cause I'm having a good time (Don't stop me now) Yes, I'm having a good time I don't wanna stop at all, yeah I'm a rocket ship on my way to Mars on a collision course I am a satellite, I'm out of control I'm a sex machine ready to reload Like an atom bomb about to, oh, oh, oh, oh, oh, explode! I'm burning through the sky, yeah Two hundred degrees, that's why they call me Mister Fahrenheit I'm travelling at the speed of light I wanna make a supersonic woman of you (Don't stop me, don't stop me, don't stop me) Hey, hey, hey (Don't stop me, don't stop me, ooh, ooh, ooh) I like it (Don't stop me, don't stop me) Have a good time, good time (Don't stop me, don't stop me) Woah Let loose, honey, all right Oh, I'm burning through the sky, yeah Two hundred degrees, that's why they call me Mister Fahrenheit, hey Travelling at the speed of light I wanna make a supersonic man outta you (Yeah, yeah) (Don't stop me now) I'm having such a good time, I'm having a ball (Don't stop me now) If you wanna have a good time, just give me a call (Ooh, alright) (Don't stop me now) 'Cause I'm having a good time (Yeah, yeah) (Don't stop me now) Yes, I'm having a good time I don't wanna stop at all Ah, da da da da Da da ah ah Ah da da, ah ah ah Ah, da da Ah, da da ah ah Ooh, ooh ooh, ooh ooh  \"}", "Queen-and-david-bowie-under-pressure": "\" Mmm num ba de Dum bum ba be Doo buh dum ba beh beh Pressure pushing down on me Pressing down on you, no man ask for Under pressure that burns a building down Splits a family in two Puts people on streets Um ba ba be Um ba ba be De day da Ee day da- that's okay It's the terror of knowing what this world is about Watching some good friends screaming, \\\"Let me out!\\\" Pray tomorrow gets me higher Pressure on people, people on streets Day day de mm hm Da da da ba ba Okay Chipping around, kick my brains around the floor These are the days it never rains but it pours Ee do ba be Ee da ba ba ba Um bo bo Be lap People on streets Ee da de da de People on streets Ee da de da de da de da It's the terror of knowing what this world is about Watching some good friends screaming, 'Let me out' Pray tomorrow gets me higher, high Pressure on people, people on streets Turned away from it all like a blind man Sat on a fence but it don't work Keep coming up with love but it's so slashed and torn Why, why, why? Love, love, love, love, love Insanity laughs under pressure we're breaking Can't we give ourselves one more chance? Why can't we give love that one more chance? Why can't we give love, give love, give love, give love Give love, give love, give love, give love, give love? Because love's such an old-fashioned word And love dares you to care for The people on the (People on streets) edge of the night And love (People on streets) dares you to change our way of Caring about ourselves This is our last dance This is our last dance This is ourselves under pressure Under pressure Under pressure Pressure  \"}", "Eminem-criminal": "\" A lot of people ask me stupid fuckin' questions A lot of people think that what I say on a record Or what I talk about on a record That I actually do in real life or that I believe in it Or if I say that I wanna kill somebody That I'm actually gonna do it or that I believe in it Well, shit, if you believe that, then I'll kill you You know why? \\u2018Cause I'm a criminal! Criminal! You're goddamn right I'm a criminal! Yeah, I'm a criminal! My words are like a dagger with a jagged edge That'll stab you in the head, whether you're a fag or lez Or a homosex, hermaph or a trans-a-vest Pants or dress, hate fags? The answer's yes Homophobic? Nah, you're just heterophobic Starin' at my jeans, watchin' my genitals bulgin' (Ooh!) That's my motherfuckin' balls, you'd better let go of 'em They belong in my scrotum, you'll never get hold of 'em! \\\"Hey, it's me, Versace! Whoops, somebody shot me! And I was just checkin' the mail, get it? Checkin' the male?\\\" How many records you expectin' to sell After your second LP sends you directly to jail? Come on, relax, guy! I like gay men Right, Ken? Give me an amen! (A-men!) \\\"Please Lord, this boy needs Jesus Heal this child, help us destroy these demons Oh, and please send me a brand new car And a prostitute while my wife's sick in the hospital\\\" Preacher, preacher! Fifth grade teacher! You can't reach me, my mom can't neither You can't teach me a goddamn thing \\u2018cause I watch TV and Comcast cable And you ain't able to stop these thoughts You can't stop me from toppin' these charts And you can't stop me from droppin' each March With a brand new CD for these fuckin' retards (Duh) And to think, it's just little ol' me Mr. Don't-Give-a-Fuck still won't leave I'm a criminal! \\u2018Cause every time I write a rhyme these people think it's a crime To tell 'em what's on my mind, I guess I'm a criminal! I don't gotta say a word, I just flip 'em the bird And keep goin', I don't take shit from no one I'm a criminal! \\u2018Cause every time I write a rhyme these people think it's a crime To tell 'em what's on my mind, I guess I'm a criminal! I don't gotta say a word, I just flip 'em the bird And keep goin', I don't take shit from no one The mother did drugs, hard liquor, cigarettes and speed The baby came out, disfigured ligaments, indeed It was a seed who would grow up just as crazy as she Don't dare make fun of that baby, \\u2018cause that baby was me I'm a criminal, an animal caged who turned crazed But how the fuck you supposed to grow up when you weren't raised? So as I got older and I got a lot taller My dick shrunk smaller, but my balls got larger I drank more liquor to fuck you up quicker Than you'd wanna fuck me up for sayin' the word\\u2014 My morals went *thhbbpp* when the president got oral Sex in his Oval Office on top of his desk off of his own employee Now, don't ignore me, you won't avoid me You can't miss me: I'm white, blonde-haired, and my nose is pointy I'm the bad guy who makes fun of people that die In plane crashes and laughs as long as it ain't happenin' to him Slim Shady, I'm as crazy as Em- -inem and Kim combined (The maniac's in) In place of the Doctor \\u2018cause Dre couldn't make it today He's a little under the weather, so I'm takin' his place (Mm-mm-mmm!) Oh, that's Dre with an AK to his face Don't make me kill him too and spray his brains all over the place I told you, Dre, you should've kept that thang put away I guess that'll teach you not to let me play with it, eh? I'm a criminal! DRIVER: Aight look EMINEM: Uh-huh DRIVER: Just go up in that motherfucker, get the motherfuckin' money and get the fuck up outta there EMINEM: Aight DRIVER: I\\u2019ll be right here waitin' on you EMINEM: Aight DRIVER: Yo, Em EMINEM: What?! DRIVER: Don't kill nobody this time EMINEM: Awwright\\u2026 goddamn, this motherfucker gets on my fuckin' nerves! {*Whistling*} How you doin'? TELLER: Hi, how can I help you? EMINEM: Yeah, I need to make a withdrawal TELLER: Okay EMINEM: Put the fuckin' money in the bag, bitch, and I won\\u2019t kill you! TELLER: What? Oh my God, don\\u2019t kill me! EMINEM: I\\u2019m not gonna kill you, bitch, quit lookin' around TELLER: Don\\u2019t kill me, I've got two kids at home don't kill me! EMINEM: I said I\\u2019m not gonna fuckin' kill you TELLER: Don't kill me! EMINEM: Hurry the fuck up! {*Gunshot*} Thank you! Windows tinted on my ride when I drive in it (Go, go, go!) So when I rob a bank, run out and just dive in it So I'll be disguised in it and if anybody identifies The guy in it, I hide for five minutes Come back, shoot the eyewitness Fire at the private eye hired to pry in my business Die bitches, bastards, brats, pets This puppy's lucky I didn't blast his ass yet If I ever gave a fuck, I'd shave my nuts Tuck my dick in between my legs and cluck You motherfuckin' chickens ain't brave enough To say the stuff I say, so just tape it shut Shit, half the shit I say, I just make it up To make you mad, so kiss my white naked ass And if it's not a rapper that I make it as I'ma be a fuckin' rapist in a Jason mask I'm a criminal! \\u2018Cause every time I write a rhyme these people think it's a crime To tell 'em what's on my mind, I guess I'm a criminal! I don't gotta say a word, I just flip 'em the bird And keep goin', I don't take shit from no one I'm a criminal! \\u2018Cause every time I write a rhyme these people think it's a crime To tell 'em what's on my mind, I guess I'm a criminal! I don't gotta say a word, I just flip 'em the bird And keep goin', I don't take shit from no one I'm a criminal! \\u2018Cause every time I write a rhyme these people think it's a crime To tell 'em what's on my mind, I guess I'm a criminal! I don't gotta say a word, I just flip 'em the bird And keep goin', I don't take shit from no one I'm a criminal! \\u2018Cause every time I write a rhyme these people think it's a crime To tell 'em what's on my mind, I guess I'm a criminal! I don't gotta say a word, I just flip 'em the bird And keep goin', I don't take shit from no one I am a criminal!  \"}", "Nicki-minaj-starships": "\" (RedOne..., Uh) Let's go to the beach, each Let\\u2019s go get a wave They say, what they gonna say? Have a drink, clink, found the Bud Light Bad bitches like me is hard to come by The patron own, let's go get it on The zone on, yes I'm in the zone Is it two, three? Leave a good tip I'ma blow off my money and don't give two shits, oh, oh I'm on the floor, floor I love to dance So give me more, more, 'til I can't stand Get on the floor, floor Like it's your last chance If you want more, more Then here I am Starships were meant to fly Hands up and touch the sky Can't stop cause we\\u2019re so high Let's do this one more time Starships were meant to fly Hands up and touch the sky Let's do this one last time Can't stop... (We're higher than a motherfucka) (We're higher than a motherfucka) (We're higher than a motherfucka) Jump in my hoopty-hoopty-hoop I own that And I ain't payin' my rent this month I owe that But fuck who you want, and fuck who you like Dancehall life, there's no end in sight Twinkle, twinkle little star Now everybody let me hear you say ray, ray, ray Now spend all your money cause today pay day And if you're a G, you a G-G-G My name is Onika, you can call me Nicki Get on the floor, floor Like it's your last chance If you want more, more Then here I am Starships were meant to fly Hands up and touch the sky Can't stop 'cause we\\u2019re so high Let's do this one more time Starships were meant to fly Hands up and touch the sky Let's do this one last time Can't stop... (We're higher than a motherfucka) (We're higher than a motherfucka) (We're higher than a motherfucka) Starships were meant to fly Hands up and touch the sky Can't stop 'cause we\\u2019re so high Let's do this one more time Starships were meant to fly Hands up and touch the sky Let's do this one last time Can't stop... (We're higher than a motherfucka) (We're higher than a motherfucka) (We're higher than a motherfucka)  \"}", "Taylor-swift-shake-it-off": "\" I stay out too late Got nothing in my brain That's what people say, mm, mm That's what people say, mm, mm I go on too many dates But I can't make them stay At least that's what people say, mm, mm That's what people say, mm, mm But I keep cruisin' Can't stop, won't stop movin' It's like I got this music in my mind Saying it's gonna be alright 'Cause the players gonna play, play, play, play, play And the haters gonna hate, hate, hate, hate, hate Baby, I'm just gonna shake, shake, shake, shake, shake I shake it off, I shake it off Heartbreakers gonna break, break, break, break, break And the fakers gonna fake, fake, fake, fake, fake Baby, I'm just gonna shake, shake, shake, shake, shake I shake it off, I shake it off I never miss a beat I'm lightning on my feet And that's what they don\\u2019t see, mm, mm That's what they don\\u2019t see, mm, mm I'm dancing on my own (Dancing on my own) I make the moves up as I go (Moves up as I go) And that's what they don't know, mm, mm That\\u2019s what they don\\u2019t know, mm, mm But I keep cruisin' Can't stop, won't stop groovin' It's like I got this music in my mind Saying it's gonna be alright 'Cause the players gonna play, play, play, play, play And the haters gonna hate, hate, hate, hate, hate Baby, I'm just gonna shake, shake, shake, shake, shake I shake it off, I shake it off Heartbreakers gonna break, break, break, break, break And the fakers gonna fake, fake, fake, fake, fake Baby, I'm just gonna shake, shake, shake, shake, shake I shake it off, I shake it off Shake it off, I shake it off I, I, I shake it off, I shake it off I, I, I shake it off, I shake it off I, I, I shake it off, I shake it off Hey, hey, hey Just think while you've been getting down and out about the liars And the dirty, dirty cheats of the world You could've been getting down To this sick beat My ex-man brought his new girlfriend She's like, \\u201cOh my God,\\u201d but I'm just gonna shake And to the fella over there with the hella good hair Won't you come on over, baby? We can shake, shake, shake Yeah, oh, oh, oh 'Cause the players gonna play, play, play, play, play And the haters gonna hate, hate, hate, hate, hate (Haters gonna hate) Baby, I'm just gonna shake, shake, shake, shake, shake I shake it off, I shake it off Heartbreakers gonna break, break, break, break, break (Mmhm) And the fakers gonna fake, fake, fake, fake, fake (And fake, and fake, and fake) Baby, I'm just gonna shake, shake, shake, shake, shake I shake it off, I shake it off Shake it off, I shake it off I, I, I shake it off, I shake it off I, I, I shake it off, I shake it off I, I, I shake it off, I shake it off Shake it off, I shake it off I, I, I shake it off, I shake it off I, I, I shake it off, I shake it off I, I, I shake it off, I shake it off (Yeah) Shake it off, I shake it off I, I, I shake it off, I shake it off (You got to) I, I, I shake it off, I shake it off I, I, I shake it off, I shake it off \"}", "Taylor-swift-blank-space": "\" Nice to meet you, where you been? I could show you incredible things Magic, madness, heaven, sin Saw you there, and I thought \\\"Oh my God, look at that face You look like my next mistake Love's a game, wanna play?\\\" Ayy New money, suit and tie I can read you like a magazine Ain't it funny? Rumors fly And I know you heard about me So hey, let's be friends I'm dyin' to see how this one ends Grab your passport and my hand I can make the bad guys good for a weekend So it's gonna be forever Or it's gonna go down in flames You can tell me when it's over, mm If the high was worth the pain Got a long list of ex-lovers They'll tell you I'm insane 'Cause you know I love the players And you love the game 'Cause we're young and we're reckless We'll take this way too far It'll leave you breathless, hmm Or with a nasty scar Got a long list of ex-lovers They'll tell you I'm insane But I've got a blank space, baby And I'll write your name Cherry lips, crystal skies I could show you incredible things Stolen kisses, pretty lies You're the King, baby, I'm your Queen Find out what you want Be that girl for a month Wait, the worst is yet to come Oh, no Screaming, crying, perfect storms I can make all the tables turn Rose garden filled with thorns Keep you second guessin' like \\\"Oh my God, who is she?\\\" I get drunk on jealousy But you'll come back each time you leave 'Cause, darling, I'm a nightmare dressed like a daydream So it's gonna be forever Or it's gonna go down in flames You can tell me when it's over, mm If the high was worth the pain Got a long list of ex-lovers They'll tell you I'm insane 'Cause you know I love the players And you love the game 'Cause we're young and we're reckless We'll take this way too far It'll leave you breathless, hmm Or with a nasty scar Got a long list of ex-lovers They'll tell you I'm insane But I've got a blank space, baby And I'll write your name Boys only want love if it's torture Don't say I didn't, say I didn't warn ya Boys only want love if it's torture Don't say I didn't, say I didn't warn ya So it's gonna be forever Or it's gonna go down in flames You can tell me when it's over, mm If the high was worth the pain Got a long list of ex-lovers They'll tell you I'm insane 'Cause you know I love the players And you love the game 'Cause we're young and we're reckless We'll take this way too far It'll leave you breathless, hmm Or with a nasty scar Got a long list of ex-lovers They'll tell you I'm insane But I've got a blank space, baby And I'll write your name  \"}", "Katy-perry-hot-n-cold": "\" You change your mind like a girl changes clothes Yeah, you PMS like a bitch; I would know And you overthink, always speak cryptically I should know that you're no good for me 'Cause you're hot then you're cold You're yes, then you're no You're in, then you're out You're up, then you're down You're wrong when it's right It's black and it's white We fight, we break up We kiss, we make up (You) You don't really wanna stay, no (You) But you don't really wanna go, oh You're hot then you're cold You're yes, then you're no You're in, then you're out You're up, then you're down We used to be just like twins, so in sync The same energy, now's a dead battery Used to laugh (Used to laugh) 'bout nothing ('Bout nothing) Now you're plain (Now you're plain) boring (Boring) I should know (I should know) that you're not gonna change 'Cause you're hot then you're cold You're yes, then you're no You're in, then you're out You're up, then you're down You're wrong when it's right It's black and it's white We fight, we break up We kiss, we make up (You) You don't really wanna stay, no (You) But you don't really wanna go, oh You're hot then you're cold You're yes, then you're no You're in, then you're out You're up, then you're down Someone call the doctor Got a case of a love bipolar Stuck on a roller coaster Can't get off this ride You change your mind like a girl changes clothes 'Cause you're hot then you're cold You're yes, then you're no You're in, then you're out You're up, then you're down You're wrong when it's right It's black and it's white We fight, we break up We kiss, we make up You're hot then you're cold You're yes, then you're no You're in, then you're out You're up, then you're down You're wrong when it's right It's black and it's white We fight, we break up We kiss, we make up (You) You don't really wanna stay, no (You) But you don't really wanna go, oh You're hot then you're cold You're yes, then you're no You're in, then you're out You're up, then you're down  \"}", "Adele-hello": "\" Hello, it's me I was wondering if after all these years you'd like to meet To go over everything They say that time's supposed to heal ya, but I ain't done much healing Hello, can you hear me? I'm in California dreaming about who we used to be When we were younger and free I've forgotten how it felt before the world fell at our feet There's such a difference between us And a million miles Hello from the other side I must've called a thousand times To tell you I'm sorry for everything that I've done But when I call, you never seem to be home Hello from the outside At least, I can say that I've tried To tell you I'm sorry for breaking your heart But it don't matter, it clearly doesn't tear you apart anymore Hello, how are you? It's so typical of me to talk about myself, I'm sorry I hope that you're well Did you ever make it out of that town where nothing ever happened? It's no secret that the both of us Are running out of time So hello from the other side I must've called a thousand times To tell you I'm sorry for everything that I've done But when I call, you never seem to be home Hello from the outside At least, I can say that I've tried To tell you I'm sorry for breaking your heart But it don't matter, it clearly doesn't tear you apart anymore (Highs, highs, highs, highs, lows, lows, lows, lows) Ooh, anymore (Highs, highs, highs, highs, lows, lows, lows, lows) Ooh, anymore (Highs, highs, highs, highs, lows, lows, lows, lows) Ooh, anymore (Highs, highs, highs, highs, lows, lows, lows, lows) Anymore Hello from the other side I must've called a thousand times To tell you I'm sorry for everything that I've done But when I call, you never seem to be home Hello from the outside At least, I can say that I've tried To tell you I'm sorry for breaking your heart But it don't matter, it clearly doesn't tear you apart anymore \"}", "Adele-rolling-in-the-deep": "\" There's a fire starting in my heart Reaching a fever pitch, and it's bringing me out the dark Finally, I can see you crystal clear Go ahead and sell me out, and then I'll lay your shit bare See how I'll leave with every piece of you Don't underestimate the things that I will do There's a fire starting in my heart Reaching a fever pitch, and it's bringing me out the dark The scars of your love remind me of us They keep me thinkin' that we almost had it all The scars of your love, they leave me breathless I can't help feeling We could have had it all (You're gonna wish you \\u2013 never had met me) Rolling in the deep (Tears are gonna fall, rolling in the deep) You had my heart inside of your hand (You're gonna wish you \\u2013 never had met me) And you played it to the beat (Tears are gonna fall, rolling in the deep) Baby, I have no story to be told But I've heard one on you Now I'm gonna make your head burn Think of me in the depths of your despair Make a home down there As mine sure won't be shared (You're gonna wish you \\u2013 never had met me) The scars of your love remind me of us (Tears are gonna fall, rolling in the deep) They keep me thinkin' that we almost had it all (You're gonna wish you \\u2013 never had met me) The scars of your love, they leave me breathless (Tears are gonna fall, rolling in the deep) I can't help feeling We could have had it all (You're gonna wish you \\u2013 never had met me) Rolling in the deep (Tears are gonna fall, rolling in the deep) You had my heart inside of your hand (You're gonna wish you \\u2013 never had met me) And you played it to the beat (Tears are gonna fall, rolling in the deep) Could have had it all Rolling in the deep You had my heart inside of your hand But you played it with a beating Throw your soul through every open door (oh-oh) Count your blessings to find what you look for (whoa-oh) Turn my sorrow into treasured gold (oh-oh) You'll pay me back in kind and reap just what you sow (You're gonna wish you \\u2013 never had met me) We could have had it all (Tears are gonna fall, rolling in the deep) We could have had it all (You're gonna wish you \\u2013 never had met me) It all, it all, it all (Tears are gonna fall, rolling in the deep) We could have had it all (You're gonna wish you \\u2013 never had met me) Rolling in the deep (Tears are gonna fall, rolling in the deep) You had my heart inside of your hand (You're gonna wish you \\u2013 never had met me) And you played it to the beat (Tears are gonna fall, rolling in the deep) We could have had it all (You're gonna wish you \\u2013 never had met me) Rolling in the deep (Tears are gonna fall, rolling in the deep) You had my heart inside of your hand (You're gonna wish you \\u2013 never had met me) But you played it, you played it, you played it You played it to the beat  \"}", "Coldplay-viva-la-vida": "\" I used to rule the world Seas would rise when I gave the word Now in the morning I sleep alone Sweep the streets I used to own I used to roll the dice Feel the fear in my enemy's eyes Listen as the crowd would sing Now the old King is dead, long live the King One minute I held the key Next the walls were closed on me And I discovered that my castles stand Upon pillars of salt and pillars of sand I hear Jerusalem bells a-ringing Roman Cavalry choirs are singing Be my mirror, my sword and shield My missionaries in a foreign field For some reason I can't explain Once you'd gone there was never Never an honest word And that was when I ruled the world It was the wicked and wild wind Blew down the doors to let me in Shattered windows and the sound of drums People couldn't believe what I'd become Revolutionaries wait For my head on a silver plate Just a puppet on a lonely string Oh who would ever want to be king? I hear Jerusalem bells a-ringing Roman Cavalry choirs are singing Be my mirror, my sword and shield My missionaries in a foreign field For some reason I can't explain I know Saint Peter won't call my name Never an honest word But that was when I ruled the world Oh-oh-oh oh-oh Oh-oh-oh oh-oh Oh-oh-oh oh-oh Oh-oh-oh oh-oh (oh-oh-oh oh-oh) I hear Jerusalem bells a-ringing (oh-oh-oh oh-oh) Roman Cavalry choirs are singing (oh-oh-oh oh-oh) Be my mirror, my sword and shield (oh-oh-oh oh-oh) My missionaries in a foreign field (oh-oh-oh oh-oh) For some reason I can't explain (oh-oh-oh oh-oh) I know Saint Peter won't call my name Never an honest word But that was when I ruled the world  \"}", "Coldplay-paradise": "\" Oo-oo-oo, oo-oo-oo, oo-oo-oo Oo-oo-oo, oo-oo-oo, oo-oo-oo When she was just a girl She expected the world But it flew away from her reach So she ran away in her sleep And dreamed of para-para-paradise Para-para-paradise Para-para-paradise Every time she closed her eyes Oo-oo-oo, oo-oo-oo, oo-oo-oo Oo-oo-oo, oo-oo-oo, oo-oo-oo When she was just a girl She expected the world But it flew away from her reach And the bullets catch in her teeth Life goes on, it gets so heavy The wheel breaks the butterfly Every tear, a waterfall In the night, the stormy night, she'll close her eyes In the night, the stormy night, away she'd fly And dream of para-para-paradise Para-para-paradise Para-para-paradise Oh-oh-oh-oh-oh-oh-oh-oh She'd dream of para-para-paradise Para-para-paradise Para-para-paradise Oh-oh-oh-oh-oh-oh-oh-oh La-la La-la-la-la-la La-la-la-la-la La-la-la-la So lying underneath those stormy skies She'd say, \\\"Oh, oh-oh-oh-oh I know the sun must set to rise\\\" This could be para-para-paradise Para-para-paradise This could be para-para-paradise Oh-oh-oh-oh-oh oh-oh-oh This could be para-para-paradise Para-para-paradise This could be para-para-paradise Oh-oh-oh-oh-oh oh-oh-oh This could be para-para-paradise Para-para-paradise This could be para-para-paradise Oh-oh-oh-oh-oh oh-oh-oh Oo-oo-oo, oo-oo-oo, oo-oo-oo Oo-oo-oo, oo-oo-oo, oo-oo-oo Oo-oo-oo, oo-oo-oo, oo-oo-oo Oo-oo-oo, oo-oo-oo  \"}", "Macklemore-and-ryan-lewis-thrift-shop": "\" \\\"Hey, Macklemore, can we go thrift shopping?\\\" What what, what, what What what, what, what What what, what, what What what, what, what What what, what, what Bada, bada, bada doo da What what, what, what Bada, bada, bada doo da What what, what, what Bada, bada, bada doo da Bada, bada, bada doo da Bada, bada, bada doo da Bada, bada, bada doo da Bada, bada, bada doo da I'm gonna pop some tags Only got 20 dollars in my pocket I'm, I'm, I'm huntin', lookin' for a come up This is fucking awesome Now Walk into the club like, \\\"What up? I got a big cock\\\" Nah, I'm just pumped, I bought some shit from a thrift shop Ice on the fringe is so damn frosty The people like, \\\"Damn, that's a cold ass honkey\\\" Rollin' in hella deep, headed to the mezzanine Dressed in all pink 'cept my gator shoes, those are green Draped in a leopard mink, girl standin' next to me Probably should've washed this, smells like R. Kelly sheets Piss... But shit, it was 99 cents! Fuck it, coppin' it, washin' it, 'bout to go and get some compliments Passin' up on those moccasins someone else has been walkin' in Bummy and grungy, fuck it man, I am stunting and flossin' And saving my money and I'm hella happy; that\\u2019s a bargain, bitch I'ma take your grandpa's style, I'ma take your grandpa's style No, for real, ask your grandpa, can I have his hand-me-downs? (Thank you!) Velour jumpsuit and some house slippers Dookie brown leather jacket that I found diggin' They had a broken keyboard, I bought a broken keyboard I bought a skeet blanket, then I bought a knee board Hello, hello, my ace man, my mellow John Wayne ain't got nothing on my fringe game, hell no I could take some Pro Wings, make 'em cool, sell those The sneaker heads would be like, \\\"Ah, he got the Velcros\\\" I'm gonna pop some tags Only got 20 dollars in my pocket I'm, I'm, I'm huntin', lookin' for a come up This is fucking awesome I'm gonna pop some tags Only got 20 dollars in my pocket I'm, I'm, I'm huntin', lookin' for a come up This is fucking awesome What you know about rockin' a wolf on your noggin? What you knowin' about wearin' a fur fox skin? I'm diggin', I'm diggin' I'm searchin' right through that luggage One man's trash, that's another man's come up Thank your granddad for donatin' that plaid button- up shirt 'cause right now, I'm up in hurr stuntin' I'm at the Goodwill, you can find me in the bins I'm not, I'm not stuck on searchin' in that section (Mens) Your grammy, your auntie, your mama, your mammy I'll take those flannel zebra jammies Second hand and I'll rock that, motherfucker The built-in onesie with the socks on the motherfucker I hit the party and they stop in that motherfucker They be like, \\\"Oh, that Gucci? That's hella tight\\\" I'm like, \\\"Yo, that's 50 dollars for a T-shirt\\\" Limited edition, let's do some simple addition 50 dollars for a T-shirt, that's just some ignorant bitch shit I call that getting-swindled-and-pimped shit I call that getting tricked by business That shirt's hella dough And having the same one as six other people in this club is a hella don't Peep game, come take a look through my telescope Tryna get girls from a brand? Man, you hella won't! Man, you hella won't! Goodwill, poppin' tags, yeah! I'm gonna pop some tags Only got 20 dollars in my pocket I'm, I'm, I'm huntin', lookin' for a come up This is fucking awesome I'll wear your granddad's clothes I look incredible I'm in this big-ass coat From that thrift shop down the road I'll wear your granddad's clothes (Damn right) I look incredible (Now come on, man) I\\u2019m in this big-ass coat (Big-ass coat) From that thrift shop down the road (Let's go, come on!) I'm gonna pop some tags Only got 20 dollars in my pocket I'm, I'm, I'm huntin', lookin' for a come up This is fucking awesome \\\"Is that your grandma's coat?\\\"  \"}", "Ed-sheeran-shape-of-you": "\" The club isn't the best place to find a lover So the bar is where I go Me and my friends at the table doing shots Drinking fast and then we talk slow And you come over and start up a conversation with just me And trust me I'll give it a chance now Take my hand, stop, put Van the Man on the jukebox And then we start to dance, and now I'm singing like Girl, you know I want your love Your love was handmade for somebody like me Come on now, follow my lead I may be crazy, don't mind me Say, boy, let's not talk too much Grab on my waist and put that body on me Come on now, follow my lead Come, come on now, follow my lead I'm in love with the shape of you We push and pull like a magnet do Although my heart is falling too I'm in love with your body And last night you were in my room And now my bed sheets smell like you Every day discovering something brand new I'm in love with your body Oh\\u2014I\\u2014oh\\u2014I\\u2014oh\\u2014I\\u2014oh\\u2014I I'm in love with your body Oh\\u2014I\\u2014oh\\u2014I\\u2014oh\\u2014I\\u2014oh\\u2014I I'm in love with your body Oh\\u2014I\\u2014oh\\u2014I\\u2014oh\\u2014I\\u2014oh\\u2014I I'm in love with your body Every day discovering something brand new I'm in love with the shape of you One week in we let the story begin We're going out on our first date You and me are thrifty, so go all you can eat Fill up your bag and I fill up a plate We talk for hours and hours about the sweet and the sour And how your family is doing okay Leave and get in a taxi, then kiss in the backseat Tell the driver make the radio play, and I'm singing like Girl, you know I want your love Your love was handmade for somebody like me Come on now, follow my lead I may be crazy, don't mind me Say, boy, let's not talk too much Grab on my waist and put that body on me Come on now, follow my lead Come, come on now, follow my lead I'm in love with the shape of you We push and pull like a magnet do Although my heart is falling too I'm in love with your body And last night you were in my room And now my bed sheets smell like you Every day discovering something brand new I'm in love with your body Oh\\u2014I\\u2014oh\\u2014I\\u2014oh\\u2014I\\u2014oh\\u2014I I'm in love with your body Oh\\u2014I\\u2014oh\\u2014I\\u2014oh\\u2014I\\u2014oh\\u2014I I'm in love with your body Oh\\u2014I\\u2014oh\\u2014I\\u2014oh\\u2014I\\u2014oh\\u2014I I'm in love with your body Every day discovering something brand new I'm in love with the shape of you Come on, be my baby, come on Come on, be my baby, come on Come on, be my baby, come on Come on, be my baby, come on Come on, be my baby, come on Come on, be my baby, come on Come on, be my baby, come on Come on, be my baby, come on I'm in love with the shape of you We push and pull like a magnet do Although my heart is falling too I'm in love with your body Last night you were in my room And now my bed sheets smell like you Every day discovering something brand new I'm in love with your body Come on, be my baby, come on Come on, be my baby, come on I'm in love with your body Come on, be my baby, come on Come on, be my baby, come on I'm in love with your body Come on, be my baby, come on Come on, be my baby, come on I'm in love with your body Every day discovering something brand new I'm in love with the shape of you  \"}", "Britney-spears-toxic": "\" Baby, can't you see I'm calling? A guy like you should wear a warning It's dangerous, I'm falling There's no escape, I can't wait I need a hit, baby, give me it You're dangerous, I'm lovin' it Too high, can't come down Losing my head, spinnin' 'round and 'round Do you feel me now? With a taste of your lips, I'm on a ride You're toxic, I'm slippin' under With a taste of a poison paradise I'm addicted to you Don't you know that you're toxic? And I love what you do Don't you know that you're toxic? It's getting late to give you up I took a sip from my devil's cup Slowly, it's taking over me Too high, can't come down It's in the air and it's all around Can you feel me now? With a taste of your lips, I'm on a ride You're toxic, I'm slippin' under With a taste of a poison paradise I'm addicted to you Don't you know that you're toxic? And I love what you do Don't you know that you're toxic? Don't you know that you're toxic? With a taste of your lips, I'm on a ride You're toxic, I'm slippin' under With a taste of a poison paradise I'm addicted to you Don't you know that you're toxic? With a taste of your lips, I'm on a ride You're toxic, I'm slippin' under (Toxic) With a taste of a poison paradise I'm addicted to you Don't you know that you're toxic? Intoxicate me now with your lovin' now I think I'm ready now (I think I'm ready now) Intoxicate me now with your lovin' now I think I'm ready now  \"}", "Eminem-love-the-way-you-lie": "\" Just gonna stand there and watch me burn? Well, that's all right because I like the way it hurts Just gonna stand there and hear me cry? Well, that's all right because I love the way you lie I love the way you lie I can't tell you what it really is, I can only tell you what it feels like And right now, there's a steel knife in my windpipe I can't breathe, but I still fight while I can fight As long as the wrong feels right, it's like I'm in flight High off her love, drunk from her hate It's like I'm huffin' paint and I love her, the more I suffer, I suffocate And right before I'm about to drown, she resuscitates Me, she fuckin' hates me, and I love it \\u2014 \\\"Wait! Where you going?\\\" \\u2014 \\\"I'm leaving you!\\\" \\u2014 \\\"No, you ain't! Come back!\\\" \\u2014 We're runnin' right back, here we go again It's so insane, 'cause when it's goin' good, it's goin' great I'm Superman with the wind at his back, she's Lois Lane But when it's bad, it's awful, I feel so ashamed I snapped, \\\"Who's that dude?\\\", I don't even know his name I laid hands on her, I'll never stoop so low again I guess I don't know my own strength Just gonna stand there and watch me burn? Well, that's all right because I like the way it hurts Just gonna stand there and hear me cry? Well, that's all right because I love the way you lie I love the way you lie I love the way you lie You ever love somebody so much you can barely breathe when you're with 'em? You meet, and neither one of you even know what hit 'em Got that warm fuzzy feelin', yeah, them chills, used to get 'em Now you're gettin' fuckin' sick of lookin' at 'em? You swore you'd never hit 'em, never do nothin' to hurt 'em Now you're in each other's face spewin' venom in your words when you spit 'em You push, pull each other's hair, scratch, claw, bit 'em Throw 'em down, pin 'em, so lost in the moments when you're in 'em It's the rage that took over, it controls you both So they say you're best to go your separate ways, guess that they don't know ya 'Cause today, that was yesterday, yesterday is over It's a different day, sound like broken records playin' over But you promised her, next time you'll show restraint You don't get another chance, life is no Nintendo game, but you lied again Now you get to watch her leave out the window Guess that's why they call it window pane Just gonna stand there and watch me burn? Well, that's all right because I like the way it hurts Just gonna stand there and hear me cry? Well, that's all right because I love the way you lie I love the way you lie I love the way you lie Now, I know we said things, did things that we didn't mean Then we fall back into the same patterns, same routine But your temper's just as bad as mine is, you're the same as me When it comes to love you're just as blinded, baby, please Come back, it wasn't you, baby, it was me Maybe our relationship isn't as crazy as it seems Maybe that's what happens when a tornado meets a volcano All I know is I love you too much to walk away though Come inside, pick up your bags off the sidewalk Don't you hear sincerity in my voice when I talk? Told you this is my fault, look me in the eyeball Next time I'm pissed, I'll aim my fist at the drywall Next time? There won't be no next time! I apologize, even though I know it's lies I'm tired of the games, I just want her back, I know I'm a liar If she ever tries to fuckin' leave again, I'ma tie her To the bed and set this house on fire, just gonna Just gonna stand there and watch me burn? Well, that's all right because I like the way it hurts Just gonna stand there and hear me cry? Well, that's all right because I love the way you lie I love the way you lie I love the way you lie  \"}", "Rihanna-umbrella": "\" Uh-huh, uh-huh (Yeah, Rihanna) Uh-huh, uh-huh (Good Girl Gone Bad) Uh-huh, uh-huh (Take three, action) Uh-huh, uh-huh (Hov) No clouds in my stones Let it rain, I hydroplane in the bank Coming down with the Dow Jones When the clouds come, we gone, we Roc-A-Fella We fly higher than weather, in G5's or better You know me (You know me) In anticipation for precipitation, stack chips for the rainy day Jay\\u2014Rain Man is back With Little Miss Sunshine, Rihanna, where you at? You have my heart And we'll never be worlds apart Maybe in magazines But you'll still be my star Baby, \\u2018cause in the dark You can't see shiny cars And that's when you need me there With you, I'll always share Because When the sun shine, we shine together Told you I'll be here forever Said I'll always be your friend Took an oath, I'ma stick it out to the end Now that it's raining more than ever Know that we'll still have each other You can stand under my umbrella You can stand under my umbrella, ella, ella, eh, eh, eh Under my umbrella, ella, ella, eh, eh, eh Under my umbrella, ella, ella, eh, eh, eh Under my umbrella, ella, ella, eh, eh, eh, eh, eh-eh These fancy things Will never come in between You're part of my entity Here for infinity When the war has took its part When the world has dealt its cards If the hand is hard Together we'll mend your heart Because When the sun shine, we shine together Told you I'll be here forever Said I'll always be your friend Took an oath, I'ma stick it out to the end Now that it's raining more than ever Know that we'll still have each other You can stand under my umbrella You can stand under my umbrella, ella, ella, eh, eh, eh Under my umbrella, ella, ella, eh, eh, eh Under my umbrella, ella, ella, eh, eh, eh Under my umbrella, ella, ella, eh, eh, eh, eh, eh-eh You can run into my arms It's okay, don't be alarmed Come into me There's no distance in between our love So gon' and let the rain pour I'll be all you need and more Because When the sun shine, we shine together Told you I'll be here forever Said I'll always be your friend Took an oath, I'ma stick it out to the end Now that it's raining more than ever Know that we'll still have each other You can stand under my umbrella You can stand under my umbrella, ella, ella, eh, eh, eh Under my umbrella, ella, ella, eh, eh, eh Under my umbrella, ella, ella, eh, eh, eh Under my umbrella, ella, ella, eh, eh, eh, eh, eh-eh It's rainin', rainin' Ooh, baby, it's rainin', rainin' Baby, come here to me Come into me It's rainin', rainin' Ooh, baby, it's rainin', rainin' You can always come into me Come into me It's pourin' rain It's pourin' rain Come here to me Come into me It's pourin' rain It's pourin' rain  \"}", "Rihanna-diamonds": "\" Shine bright like a diamond Shine bright like a diamond Find light in the beautiful sea I choose to be happy You and I, you and I We're like diamonds in the sky You're a shooting star I see A vision of ecstasy When you hold me, I'm alive We're like diamonds in the sky I knew that we'd become one right away Oh, right away At first sight, I felt the energy of sun rays I saw the life inside your eyes So shine bright, tonight You and I We're beautiful, like diamonds in the sky Eye to eye So alive We're beautiful, like diamonds in the sky Shine bright like a diamond (Woah) Shine bright like a diamond (Woah) Shinin' bright like a diamond We're beautiful, like diamonds in the sky Shine bright like a diamond (Woah) Shine bright like a diamond (Woah) Shinin' bright like a diamond We're beautiful, like diamonds in the sky Palms rise to the universe As we moonshine and molly Feel the warmth, we'll never die We're like diamonds in the sky You're a shooting star I see A vision of ecstasy When you hold me, I'm alive We're like diamonds in the sky At first sight I felt the energy of sun rays I saw the life inside your eyes So shine bright, tonight You and I We're beautiful, like diamonds in the sky Eye to eye So alive We're beautiful, like diamonds in the sky Shine bright like a diamond (Woah) Shine bright like a diamond (Woah) Shinin' bright like a diamond We're beautiful, like diamonds in the sky Shine bright like a diamond (Woah) Shine bright like a diamond (Woah) Shinin' bright like a diamond We're beautiful, like diamonds in the sky Shine bright like a diamond Shine bright like a diamond Shine bright like a diamond So shine bright, tonight You and I We're beautiful, like diamonds in the sky Eye to eye So alive We're beautiful, like diamonds in the sky Shine bright like a diamond (Woah) Shine bright like a diamond (Woah) Shine bright like a diamond Oh-oh, yeah Shine bright like a diamond (Woah) Shine bright like a diamond (Woah) Shine bright like a diamond Shine bright like a diamond  \"}", "Jay-z-and-kanye-west-niggas-in-paris": "\" \\\"We're going to skate to one song, one song only\\\" Ball so hard mothafuckers wanna fine me So I ball so hard mothafuckers wanna fine me But first niggas gotta find me What's fifty grand to a mothafucker like me? Can you please remind me? (Ball so hard) This shit crazy Y'all don't know that don't shit faze me The Nets could go 0 for 82 And I'd look at you like this shit gravy (Ball so hard) This shit weird We ain't even 'posed to be here (Ball so hard) Since we here It's only right that we'd be fair Psycho: I'm liable to go Michael, take your pick Jackson, Tyson, Jordan, Game 6 (Ball so hard) Got a broken clock Rollies that don't tick-tock Audemars that's losing time Hidden behind all these big rocks (B-ball so hard) I'm shocked too I'm supposed to be locked up too If you escaped what I've escaped You'd be in Paris getting fucked up too (B-ball so hard) Let's get faded Le Meurice for like six days Gold bottles, scold models Spillin' Ace on my sick J's (Ball so hard) Bitch, behave Just might let you meet 'Ye Chi-Town's D. Rose I'm moving the Nets to BK Ball so hard mothafuckers wanna fine me That shit cray, that shit cray, that shit cray B-ball so hard mothafuckers wanna fine me That shit cray, that shit cray, that shit cray She said, \\\"'Ye, can we get married at the mall?\\\" I said, \\\"Look, you need to crawl 'fore you ball Come and meet me in the bathroom stall And show me why you deserve to have it all\\\" (Ball so hard) That shit cray, ain't it, Jay? (Ball so hard) What she order, fish fillet? (Ball so hard) \\\"Your whip so cold\\\" \\u2013 this old thing? (Ball so hard) Act like you'll ever be around mothafuckers like this again Bougie girl, grab my hand Fuck that bitch; she don't wanna dance Excuse my French, but I'm in France, ahah, I'm just sayin' Prince Williams ain't do it right if you ask me 'Cause I was him I would have married Kate and Ashley What's Gucci, my nigga? What's Louis, my killer? What's drugs, my dealer? What's that jacket, Margiela? Doctors say I'm the illest 'Cause I'm suffering from realness Got my niggas in Paris And they going gorillas, huh \\\"I don't even know what that means No one knows what it means, but it's provocative No, it's not, it's gross Gets the people going\\\" Ball so hard mothafuckers wanna fine me B-ball so hard mothafuckers wanna fine me You are now watching the throne Don't let me get in my zone Don't let me get in my zone Don't let me get in my zone These other niggas is lyin' Actin' like the summer ain't mine (I got that hot bitch in my home) (You know how many hot bitches I own?) Don't let me get in my zone Don't let me get in my zone Don't let me get in my zone Don't let me get in my zone The stars is in the building They hands is to the ceiling I know I'm 'bout to kill it How you know? I got that feeling You are now watching the throne Don't let me into my zone Don't let me into my zone (I'm definitely in my zone, zone, zone, zone, zone...) \"}", "Jessie-j-price-tag": "\" Okay, Coconut Man, Moonhead and Pea You ready? Seems like everybody's got a price I wonder how they sleep at night When the sale comes first and the truth comes second Just stop for a minute and smile Why is everybody so serious? Acting so damn mysterious Got shades on your eyes And your heels so high that you can't even have a good time Everybody look to their left Everybody look to their right Can you feel that? Yeah, we're paying with love tonight It's not about the money, money, money We don't need your money, money, money We just wanna make the world dance Forget about the price tag Ain't about the, uh, cha-ching, cha-ching Ain't about the, yeah, ba-bling, ba-bling Wanna make the world dance Forget about the price tag We need to take it back in time When music made us all unite And it wasn't low blows and video hoes Am I the only one getting tired? Why is everybody so obsessed? Money can't buy us happiness Can we all slow down and enjoy right now? Guarantee we'll be feeling alright Everybody look to their left Everybody look to their right Can you feel that? Yeah, we're paying with love tonight It's not about the money, money, money We don't need your money, money, money We just wanna make the world dance Forget about the price tag Ain't about the, uh, cha-ching, cha-ching Ain't about the, yeah, ba-bling, ba-bling Wanna make the world dance Forget about the price tag Well, keep the price tag and take the cash back Just give me six strings and a half stack And you can keep the cars, leave me the garage And all I, yes, all I need are keys and guitars And it's within' 30 seconds, I'm leaving to Mars Yeah, we leaping across these undefeatable odds It's like this man, you can't put a price on a life We do this for the love, so we fight and sacrifice every night So we ain't gon' stumble and fall, never Waiting to see this in the sign of defeat, uh-uh So we gon' keep everyone moving their feet So bring back the beat and then everyone sing It's not about the money, money, money We don't need your money, money, money We just wanna make the world dance Forget about the price tag Ain't about the, uh, cha-ching, cha-ching Ain't about the, yeah, ba-bling, ba-bling Wanna make the world dance Forget about the price tag It's not about the money, money, money We don't need your money, money, money We just wanna make the world dance Forget about the price tag Ain't about the, uh, cha-ching, cha-ching Ain't about the, yeah, ba-bling, ba-bling Wanna make the world dance Forget about the price tag Yeah, yeah, ooh-ooh Forget about the price tag  \"}", "Run-dmc-its-tricky": "\" This speech is my recital, I think it's very vital To rock (a rhyme), that's right (on time) \\\"It's Tricky\\\" is the title, here we go... It's Tricky to rock a rhyme, to rock a rhyme that's right on time It's Tricky... it's Tricky (Tricky) Tricky (Tricky) It's Tricky to rock a rhyme, to rock a rhyme that's right on time It's Tricky... Tr-tr-tr-tricky (Tricky) Trrrrrrrrrrricky I met this little girlie, her hair was kinda curly Went to her house and bust her out, I had to leave real early These girls are really sleazy, all they just say is please me Or spend some time and rock a rhyme, I said \\\"It's not that easy\\\" It's Tricky to rock a rhyme, to rock a rhyme that's right on time It's Tricky... (How is it D?) It's Tricky (Tricky) Tricky (Trrrrrricky) It's Tricky to rock a rhyme, to rock a rhyme that's right on time It's Tricky... Tricky (Tricky) Tricky In New York, the people talk and try to make us rhyme They really (hawk) but we just (walk) because we have no time And in the city, it's a pity 'cause we just can't hide Tinted windows don't mean nothin', they know who's inside It's Tricky to rock a rhyme, to rock a rhyme that's right on time It's Tricky... (How is it D?) Tricky (Tricky) Tricky (Tricky) It's Tricky to rock a rhyme, to rock a rhyme that's right on time It's Tricky... Tricky (Tricky) Tricky (Tricky) huh! When I wake up people take up mostly all of my time I'm not singin', phone keep ringin' cause I make up a rhyme I'm not braggin', people naggin' cause they think I'm a star Always tearin' what I'm wearin', I think they're goin' too far A girl named Carol follows Darryl every gig we play Then D dissed her and dismissed her, now she's jockin' Jay I ain't lyin', girls be cryin' cause I'm on TV They even bother my poor father cause he's down with me It's Tricky to rock a rhyme, to rock a rhyme that's right on time It's Tricky... (How is it?) Tricky (Tricky) Tricky (Tricky) It's Tricky to rock a rhyme, to rock a rhyme that's right on time It's Tricky... Tr-tr-tr-tr-tr-tricky (Tr-Tr-Tr-Tricky) Tr-tr-tr... We are not thugs (we don't use drugs) but you assume (on your own) They offer coke (and lots of dope) but we just leave it alone It's like that y'all (y'all), but we don't quit You keep on (rock!) shock 'cause this is it...  \"}", "One-direction-night-changes": "\" Going out tonight, changes into something red Her mother doesn't like that kind of dress Everything she never had, she's showing off Driving too fast, moon is breaking through her hair She's heading for something that she won't forget Having no regrets is all that she really wants We\\u2019re only getting older, baby And I\\u2019ve been thinking about it lately Does it ever drive you crazy Just how fast the night changes? Everything that you\\u2019ve ever dreamed of Disappearing when you wake up But there\\u2019s nothing to be afraid of Even when the night changes, it will never change me and you Chasing her tonight, doubts are running 'round her head He's waiting, hides behind a cigarette Heart is beating loud and she doesn't want it to stop Moving too fast, moon is lighting up her skin She's falling, doesn't even know it yet Having no regrets is all that she really wants We\\u2019re only getting older, baby And I\\u2019ve been thinking about it lately Does it ever drive you crazy Just how fast the night changes? Everything that you\\u2019ve ever dreamed of Disappearing when you wake up But there\\u2019s nothing to be afraid of Even when the night changes, it will never change me and you Going out tonight, changes into something red, her mother doesn't like that kind of dress Reminds her of the missing piece of innocence she lost We\\u2019re only getting older, baby And I\\u2019ve been thinking about it lately Does it ever drive you crazy Just how fast the night changes? Everything that you\\u2019ve ever dreamed of Disappearing when you wake up But there\\u2019s nothing to be afraid of Even when the night changes It will never change, baby, it will never change, baby It will never change, me and you  \"}", "Pink-floyd-another-brick-in-the-wall-pt-2": "\" We don't need no education We don't need no thought control No dark sarcasm in the classroom Teacher, leave them kids alone Hey! Teacher! Leave them kids alone! All in all, it's just another brick in the wall All in all, you're just another brick in the wall We don't need no education We don't need no thought control No dark sarcasm in the classroom Teachers leave them kids alone Hey! Teacher! Leave us kids alone! All in all, you're just another brick in the wall All in all, you're just another brick in the wall Wrong, do it again! *Children playing* Wrong, do it again! If you don't eat your meat, you can't have any pudding! (Wrong, do it again!) How can you have any pudding if you don't eat your meat? (Wrong, do it again!) You! Yes! You behind the bike sheds! Stand still, laddie! (If you don't eat your meat, you can't have any pudding! How can you have any pudding if you don't eat your meat?) (You! Yes! You behind the bike sheds! Stand still, laddie!) *Children playing* *Phone beeping sound*  \"}", "Pink-floyd-wish-you-were-here-artwork-credits-an": "\"  Original Artwork   Experience Edition Artwork   Immersion Edition Artwork   Credits Produced by PINK FLOYD Mastered by JAMES GUTHRIE and JOEL PLANTE at das boot recording, 2011  \"}", "Kanye-west-stronger": "\" Work it, make it, do it, makes us Harder, better, faster, stronger N-now th-that that don't kill me Can only make me stronger I need you to hurry up now \\u2018Cause I can't wait much longer I know I got to be right now \\u2018Cause I can't get much wronger Man, I've been waiting all night now That's how long I been on ya (Work it harder, make it better Do it faster, makes us stronger) (I need you right now!) (I need you right now!) Let's get lost tonight You could be my black Kate Moss tonight Play secretary, I'm the boss tonight And you don't give a fuck what they all say, right? Awesome, the Christian in Christian Dior Damn, they don't make 'em like this anymore I ask, \\u2018cause I'm not sure Do anybody make real shit anymore? Bow in the presence of greatness \\u2018Cause right now thou hast forsaken us You should be honored by my lateness That I would even show up to this fake shit So go ahead, go nuts, go apeshit 'Specially in my Pastell\\u00e9, on my Bape shit Act like you can't tell who made this New Gospel, homie, take six And take this, haters! N-now th-that that don't kill me Can only make me stronger I need you to hurry up now \\u2018Cause I can't wait much longer I know I got to be right now \\u2018Cause I can't get much wronger Man, I've been waiting all night now That's how long I been on ya (Work it harder, make it better Do it faster, makes us stronger) (I need you right now!) (I need you right now!) me likey I don't know if you got a man or not If you made plans or not If God put me in your plans or not I'm trippin', this drink got me sayin' a lot But I know that God put you in front of me So how the hell could you front on me? There's a thousand you's, there's only one of me I'm trippin', I'm caught up in the moment, right? \\u2018Cause it's Louis Vuitton Don night So we gon' do everything that Kan like Heard they'd do anything for a Klondike Well, I'd do anything for a blonde dyke And she'll do anything for the limelight And we'll do anything when the time's right Uh, baby, you're makin' it (Harder, better, faster, stronger) N-now th-that that don't kill me Can only make me stronger I need you to hurry up now \\u2018Cause I can't wait much longer I know I got to be right now \\u2018Cause I can't get much wronger Man, I've been waiting all night now That's how long I been on ya (Work it harder, make it better Do it faster, makes us stronger) (I need you right now!) (I need you right now!) You know how long I've been on ya Since Prince was on Apollonia Since O.J. had Isotoners Don't act like I never told ya Don't act like I never told ya Don't act like I never told ya Don't act like I never told ya Don't act like I never told ya Baby, you're makin' it (Harder, better, faster, stronger) N-now th-that that don't kill me Can only make me stronger I need you to hurry up now \\u2018Cause I can't wait much longer I know I got to be right now \\u2018Cause I can't get much wronger Man, I've been waiting all night now That's how long I been on ya (Work it harder, make it better Do it faster, makes us stronger) (I need you right now!) (I need you right now!) Right now! Work it harder, make it better Do it faster, makes us stronger (I need you right now!) (I need you right now!) You know how long I've been on ya Since Prince was on Apollonia Since O.J. had Isotoners Don't act like I never told ya You know how long I've been on ya Since Prince was on Apollonia Since O.J. had Isotoners Don't act like I never told ya told ya told ya Never told ya\\u2026told ya told ya told ya Never told ya\\u2026told ya told ya told ya Never told ya\\u2026told ya told ya told ya Never told ya\\u2026told ya told ya told ya Never over\\u2026Never over\\u2026 Never over\\u2026 Never over\\u2026 Never over\\u2026Never over\\u2026 Never over\\u2026 Never over\\u2026 (Harder, better, faster, stronger) Work it harder, make it better Do it faster, makes us stronger More than ever, hour after\\u2014 Our work is never over Work it harder, make it better Do it faster, makes us stronger More than ever, hour after\\u2014 Our work is never over Work it harder, make it better Do it faster, makes us stronger More than ever, hour after\\u2014 Our work is never over Work it harder, make it better Do it faster, makes us stronger More than ever, hour after\\u2014 Our work is never over  \"}", "A-ap-rocky-praise-the-lord-da-shine": "\" Get it Text a message, I don't know the number Flexin' on these niggas, every bone and muscle Steady taking shots, but never hurting numbers Even then, y'all don't worry nothin' And I'd like to give a shout-out to my niggas with a game plan And shout-outs to my niggas with escape plans Uh, twenty bands, rain dance We could either rain check or we can make plans Pockets loaded, rocket loaded, okay, let's rock and roll this It's time to go, Lock, Stock, and Two Smoking Barrels Locked and loaded, diamonds glowing, chart-climbing on 'em You'd think I'm jumping out the window how I got 'em open Line around the corner, line 'em up the block and over Sometimes I even stop the smoking when it's time to focus My shades, Dior, my pants, velour Create, explore, expand, conquer I came, I saw, I came, I saw I praise the Lord, then break the law I take what's mine, then take some more It rains, it pours, it rains, it pours I came, I saw, I came, I saw I praise the Lord, then break the law I take what's mine, then take some more It rains, it pours, it rains, it pours Yeah, I sold the pack, the loose, the hard (Yeah) I listened to X, I peeped the bars (Yeah) The snakes, the rats, the cats, the dogs The game's a trap, protect your heart (Yeah) I waited in line, return, refine The new design, it's time to shine To shine, to shine, to shine, to shine I hustle, I flex, the world is mine So please believe, allow the greaze These niggas disease, don't speak, we squeeze I make the devil go weak the knees You hate, you're lame, your loss I came, I saw, I came, I saw I praise the Lord, then break the law I take what's mine, then take some more It rains, it pours, it rains, it pours I came, I saw, I came, I saw I praise the Lord, then break the law I take what's mine, then take some more It rains, it pours, it rains, it pours Uh, she came, I came, now what's my name? My chain, my pants, my pants with the chain They know it's me, the hat and the shades They heard my voice and they ran to the stage My Vans, my braids, my mans, my babes My girls, my ex, my hoes that I left The way I stepped out the car, that's a flex Give thanks, get fresh, praise the Lord then finesse, bless I came, I saw, I came, I saw I praise the Lord, then break the law I take what's mine, then take some more It rains, it pours, it rains, it pours I came, I saw, I came, I saw I praise the Lord, then break the law I take what's mine, then take some more It rains, it pours, it rains, it pours  \"}", "Nwa-straight-outta-compton": "\" You are now about to witness the strength of street knowledge Straight outta Compton! Crazy motherfucker named Ice Cube From the gang called Niggas Wit Attitudes When I'm called off, I got a sawed-off Squeeze the trigger and bodies are hauled off You too, boy, if you fuck with me The police are gonna have to come and get me Off your ass, that's how I'm going out For the punk motherfuckers that's showing out Niggas start to mumble, they wanna rumble Mix 'em and cook 'em in a pot, like gumbo Going off on the motherfucker like that With a gat that's pointed at your ass So give it up smooth Ain't no telling when I'm down for a jack move Here's a murder rap to keep y'all dancin' With a crime record like Charles Manson AK-47 is the tool Don't make me act a motherfucking fool Me you can go toe to toe, no maybe I'm knocking niggas out the box, daily Yo, weekly, monthly and yearly Until them dumb motherfuckers see clearly That I'm down with the capital C-P-T Boy, you can't fuck with me So when I'm in your neighborhood, you better duck \\u2018Cause Ice Cube is crazy as fuck As I leave, believe I'm stompin' But when I come back boy, I'm coming straight outta Compton (Compton Compton Compton) Yo, Ren! (Whassup?) Tell 'em where you from! Straight outta Compton, another crazy ass nigga More punks I smoke, yo, my rep gets bigger I'm a bad motherfucker, and you know this But the pussy-ass niggas won't show this But I don't give a fuck, I'ma make my snaps If not from the records, from jacking or craps Just like burglary, the definition is jacking And when I'm legally armed it's called packing Shoot a motherfucker in a minute I find a good piece of pussy and go up in it So if you're at a show in the front row I'ma call you a bitch or dirty-ass ho You'll probably get mad like a bitch is supposed to But that shows me, slut, you're not opposed to A crazy motherfucker from the street Attitude legit, \\u2018cause I'm tearing up shit MC Ren controls the automatic For any dumb motherfucker that starts static Not the right hand, \\u2018cause I'm the hand itself Every time I pull an AK off the shelf The security is maximum, and that's a law R-E-N spells Ren, but I'm raw See, \\u2018cause I'm the motherfucking villain The definition is clear, you're the witness of a killin' That's taking place without a clue And once you're on the scope, your ass is through Look, you might take it as a trip But a nigga like Ren is on a gangsta tip Straight outta Compton (Compton Compton Compton) (Straight outta Compton) Eazy is his name, and the boy is coming\\u2026 Straight outta Compton Is a brother that'll smother your mother And make your sister think I love her Dangerous motherfucker raising hell And if I ever get caught, I make bail See, I don't give a fuck, that's the problem I see a motherfucking cop, I don't dodge him But I'm smart, lay low, creep a while And when I see a punk pass, I smile To me it's kinda funny, the attitude showing a nigga driving But don't know where the fuck he's going, just rolling Looking for the one they call Eazy But here's a flash, they'll never seize me Ruthless, never seen, like a shadow in the dark Except when I unload You see a spark and jump over hesitation And hear the scream of the one who got the lead penetration Feel a little gust of wind and I'm jetting But leave a memory no one'll be forgetting So what about the bitch who got shot? Fuck her! You think I give a damn about a bitch? I ain't a sucker This is an autobiography of the E And if you ever fuck with me You'll get taken by a stupid dope brother who will smother Word to the motherfucker, straight outta Compton (Compton Compton Compton) (Straight outta Compton) Damn, that shit was dope!  \"}", "Drake-passionfruit": "\" Hold on, hold on, fuck that. Fuck that shit. Hold on, I got to start this mothafuckin' record over again, wait a minute. Fuck that shit. Still on this mothafuckin\\u2019 record. I'ma play this mothafucka for y'all. Ayy, y\\u2019all get some more drinks goin' on, I'll sound a whole lot better. Listen Seein' you got ritualistic Cleansin' my soul of addiction for now 'Cause I'm fallin' apart, yeah Tension Between us just like picket fences You got issues that I won\\u2019t mention for now \\u2019Cause we're fallin\\u2019 apart Passionate from miles away Passive with the things you say Passin' up on my old ways I can't blame you, no, no Passionate from miles away Passive with the things you say Passin' up on my old ways I can\\u2019t blame you, no, no Listen Harder buildin' trust from a distance I think we should rule out commitment for now 'Cause we're fallin' apart Leavin' You're just doing that to get even Don't pick up the pieces, just leave it for now They keep fallin' apart Passionate from miles away Passive with the things you say Passin' up on my old ways I can't blame you, no, no Passionate from miles away Passive with the things you say Passin' up on my old ways I can't blame you, no, no Um, trying to think of the right thing to say  \"}", "Drake-gods-plan": "\" And they wishin' and wishin' and wishin' and wishin' They wishin' on me, yuh I been movin' calm, don't start no trouble with me Tryna keep it peaceful is a struggle for me Don't pull up at 6 AM to cuddle with me You know how I like it when you lovin' on me I don't wanna die for them to miss me Yes, I see the things that they wishin' on me Hope I got some brothers that outlive me They gon' tell the story, shit was different with me God's plan, God's plan I hold back, sometimes I won't, yuh I feel good, sometimes I don't, ayy, don't I finessed down Weston Road, ayy, 'nessed Might go down a G.O.D., yeah, wait I go hard on Southside G, yuh, wait I make sure that north-side eat And still, bad things It's a lot of bad things That they wishin' and wishin' and wishin' and wishin' They wishin' on me Bad things It's a lot of bad things That they wishin' and wishin' and wishin' and wishin' They wishin' on me Yuh, ayy, ayy She say, \\\"Do you love me?\\\" I tell her, \\\"Only partly I only love my bed and my mama, I'm sorry\\\" Fifty Dub, I even got it tatted on me 81, they'll bring the crashers to the party And you know me Turn the O2 into the O3, dog Without 40, Oli, there'd be no me 'Magine if I never met the broskies God's plan, God's plan I can't do this on my own, ayy, no, ayy Someone watchin' this shit close, yep, close I've been me since Scarlett Road, ayy, road, ayy Might go down as G.O.D., yeah, wait I go hard on Southside G, ayy, wait I make sure that north-side eat, yuh And still, bad things It's a lot of bad things That they wishin' and wishin' and wishin' and wishin' They wishin' on me, yeah, yeah Bad things It's a lot of bad things That they wishin' and wishin' and wishin' and wishin' They wishin' on me, yeah  \"}", "Lil-wayne-mirror": "\" Uh, with everything happening today You don't know whether you're coming or going, but You think that you're on your way Life lined up on the mirror, don't blow it Woah, look at me when I'm talking to you You looking at me but I'm looking through you I see the blood in your eyes I see the love in disguise I see the pain hidden in your pride I see you're not satisfied And I don't see nobody else I see myself, I'm looking at the.. Mirror on the wall (Woah) Here we are again (Yeah) Through my rise and fall (Uh) You've been my only friend (Yeah) You told me that they can Understand the man I am So why are we here Talking to each other again? Uh, I see the truth in your lies I see nobody by your side But I'm with you when you're all alone And you correct me when I'm looking wrong I see the guilt beneath the shame I see your soul through your window pane I see the scars that remain I see Wayne, I'm lookin' at the.. Mirror on the wall Here we are again (Yeah) Through my rise and fall (Uh-huh) You've been my only friend (My only friend) You told me that they can Understand the man I am (They can't understand) So why are we here (Misunderstood) Talking to each other again? (Woah) Looking at me now I can see my past Damn, I look just like my fucking dad Light it up, that's smoke and mirrors I even look good in a broken mirror I see my mama smile, that's a blessing I see the change, I see the message And no message coulda been any clearer So I'm starting with the man in the... Mirror on the wall (MJ taught me that) Here we are again Through my rise and fall (Uh) You've been my only friend (Take 'em to Mars, man) You told me that they can Understand the man I am So why are we Talking to each other again? (Uh) Mirror on the wall (Woah) Here we are again (Yeah) Through my rise and fall You've been my only friend (Any questions?) You told me that they can (I come to you) Understand the man I am (You always have the answer) So why are we here Talking to each other again? Mirror on the wall Hey B.P, looks like I did take 'em to Mars this time So why are we Talking to each other again?  \"}"}